{
  "settings_title": "Einstellungen",
  "save": "Speichern",
  "load_df_error": "Kritischer Fehler: Daten ('db.parquet') konnten nicht geladen werden. Die Anwendung kann nicht fortgesetzt werden.",
  "load_screen_title": "🎓 Strategische Analyse der universitären Einschreibungen in Kuba",
  "main_image_caption": "Universität von Havanna. Ein Symbol für die Hochschulbildung in Kuba.",
  "main_markdown_1": "Eine Reise, um den Weg der Hochschulbildung zu beleuchten.",
  "sidebar_title": "🧭 Sektions-Explorer",
  "sidebar_radio_title_main": "Wählen Sie eine Sektion:",
  "sidebar_radio_title_sub_prefix": "Untersektion: ",
  "sidebar_info": "Analyse basierend auf Immatrikulationsdaten für den Zeitraum 2015-16 bis 2024-25.\n\n -- ⚠️ Das akademische Jahr 2018-2019 ist aufgrund fehlender Daten nicht enthalten; die Analysen werden ohne dieses Jahr durchgeführt.",
  "subseccion_not_valid_in": "Ungültige Untersektion in ",
  "back": "Zurück: ",
  "next": "Weiter: ",
  "authors": "Autoren:",
  "author_reynier": "Reynier Ramos González",
  "author_ernesto": "Ernesto Herrera García",
  "lang_select_label": "Sprache / Idioma",
  "lang_select_help": "Wählen Sie Ihre bevorzugte Sprache für die Anwendung.",
  "_women": "Frauen",
  "_men": "Männer",
  "_total_enrollment": "Gesamteinschreibungen",
  "_total_enrollment_projected": "Gesamteinschreibungen (prognostiziert)",
  "_total_enrollment_historical": "Gesamteinschreibungen (historisch)",
  "_projection_start": "Prognosebeginn",
  "_academic_year": "Akademisches Jahr",
  "_enrollment": "Einschreibungen",
  "_legend": "Legende",
  "_projected_short": "Prog.",
  "_50_parity": "50% Parität",
  "_university": "Universität",
  "_date": "Datum",
  "_career": "Studiengang",
  "_offers": "Angebote",
  "_elements": "Elemente",
  "_number_of_students": "Anzahl der Studierenden",
  "_all_provinces": "ALLE PROVINZEN",
  "_all_municipalities": "ALLE GEMEINDEN",
  "_founded_in": "Gegründet",
  "_organism": "Trägerorganisation",
  "_address": "Adresse",
  "_main_modality": "Hauptmodalität",
  "generic_warn_figs": "Das nationale Übersichtsdiagramm (A1) konnte nicht erstellt werden.",
  "ask_ai_component": {
    "ai_initial_response_text": "🤖 Fragen zu dieser Analyse? Fragen Sie den KI-Assistenten!",
    "restart_conversation": "Diese Konversation neu starten",
    "your_question_here": "Schreiben Sie Ihre Frage hier...",
    "thinking": "Ihre Anfrage wird bearbeitet...",
    "code_download": "📥 Code herunterladen",
    "generated_image": "Generiertes Bild",
    "error_parsing_table": "Fehler beim Parsen der Tabelle"
  },
  "gamification_controller": {
    "confirm_deactivation_title": "Deaktivierung bestätigen",
    "confirm_deactivation_warning": "Sind Sie sicher, dass Sie den Spielmodus deaktivieren möchten?",
    "confirm_deactivation_text": "Sie werden die interaktiven Minispiele nicht mehr sehen und Ihren aktuellen Fortschritt verlieren.",
    "confirm_button": "Bestätigen",
    "cancel_button": "Abbrechen",
    "game_mode_label": "**Spielmodus**",
    "toggle_help": "Aktiviert/deaktiviert die interaktiven Minispiele.",
    "progress_header": "🏆 Ihr Fortschritt",
    "reset_progress_button": "Fortschritt zurücksetzen",
    "points_metric_label": "Punkte",
    "games_metric_label": "Spiele",
    "history_expander_label": "Spielverlauf ansehen",
    "history_empty": "Sie haben noch nicht gespielt. Legen Sie los!",
    "history_item_text": "{icon} **{game_title}**: *+{points_earned} Pkt.*",
    "round": "Runde",
    "detailed_analysis_revealed": "Detaillierte Analyse:",
    "feedback_victory": "Sieg! Sie haben die Herausforderung mit **{total_score}** Punkten gemeistert.",
    "feedback_defeat": "Fast geschafft! Sie haben **{total_score}** Punkte erreicht. Versuchen Sie es erneut!",
    "feedback_game_over_text": "Sie haben insgesamt **{total_score}** Punkte erzielt.",
    "see_round_summary": "Detaillierte Rundenübersicht ansehen",
    "submit_button_label": "Prüfen!",
    "please_pick_an_action": "Bitte führen Sie eine Aktion aus, bevor Sie prüfen.",
    "SimpleQuestionMinigame": {
      "minigame_prefix": "Minispiel:",
      "choose_your_answer": "Wählen Sie Ihre Antwort:"
    },
    "DataDuelMinigame": {
      "data_duel_title": "Datenduell",
      "duel_question": "Welches hat den höheren Wert?"
    },
    "ClassifierMinigame": {
      "classifier_title": "Der Klassifikator",
      "classifier_drag_info": "💡 Ziehen Sie die Elemente, um sie von oben (größter Wert) nach unten (kleinster Wert) zu sortieren."
    },
    "OracleMinigame": {
      "oracle_title": "Das Orakel",
      "oracle_question": "Beobachten Sie die Entwicklung und sagen Sie den Trend voraus."
    },
    "EstimatorMinigame": {
      "estimator_title": "Der Schätzer",
      "estimator_instructions": "Nutzen Sie den Schieberegler, um den Wert zu schätzen. Je näher Sie dran sind, desto mehr Punkte gibt es!",
      "estimator_question": "Wie lautet der Wert für **{item_name}**?",
      "_your_estimation": "Ihre Schätzung",
      "estimator_result_shower": "**Ergebnis für '{item_name}' (Runde {round_num})**",
      "_real_value": "Realer Wert",
      "estimator_claim_victory": "Ausgezeichnete Schätzung! Sie haben **{score}** Punkte erhalten.",
      "estimator_good_try": "Guter Versuch! Sie haben **{score}** Punkte erhalten."
    },
    "GeoGuesserMinigame": {
      "geoguesser_title": "GeoGuesser",
      "geoguesser_instructions": "Wählen Sie die korrekte Provinz für die folgende Einrichtung.",
      "_where_is_it": "Wo befindet es sich?"
    },
    "ImpostorMinigame": {
      "impostor_title": "Finde den Eindringling",
      "impostor_instructions": "Drei dieser Elemente gehören zur selben Gruppe. Welches ist der Eindringling?"
    }
  },
  "introduction_header": "🎯 Willkommen im Herzen der kubanischen Hochschulbildung",
  "introduction_markdown_1": "Eine Universität ist nicht nur ein Gebäude; sie ist ein Schmelztiegel der Träume, ein Motor des Fortschritts und ein Spiegel der Bestrebungen einer Gesellschaft. In diesem Bereich begeben wir uns auf eine analytische Reise und erkunden die Strömungen, die die universitären Einschreibungen in Kuba formen.\n\nVon allgemeinen Trends bis hin zu den Details jedes Studiengangs und jeder Universität werden wir die verborgenen Geschichten hinter den verschiedenen Universitäten des Landes aufdecken. Das Ziel? Einen evidenzbasierten Kompass für strategische Entscheidungen bereitzustellen, um ein stärkeres, gerechteres und zukunftsorientiertes Hochschulsystem zu fördern.",
  "intro_choose_your_path_header": "🛣️ Wählen Sie Ihren Weg: Wie möchten Sie erkunden?",
  "intro_choose_your_path_text": "Diese Reise durch die Daten kann zwei Wege nehmen. Wählen Sie den, der am besten zu Ihrem Stil passt.",
  "intro_analyst_path_title": "👨‍🏫 Der Weg des Analysten",
  "intro_analyst_path_desc": "Ideal, wenn Sie direkt zur Sache kommen möchten. Greifen Sie ohne Unterbrechungen direkt auf alle Diagramme und Analysen zu. Perfekt für eine schnelle und fokussierte Erkundung.",
  "intro_analyst_path_button": "Analysemodus aktivieren",
  "intro_explorer_path_title": "🎮 Der Pfad des Entdeckers",
  "intro_explorer_path_desc": "Verwandeln Sie die Analyse in eine Herausforderung. In jeder Sektion erwarten Sie Minispiele, um Ihre Intuition über die Daten zu testen, bevor Sie sie sehen. Sammeln Sie Punkte und treten Sie an!",
  "intro_explorer_path_button": "Spielmodus aktivieren",
  "intro_game_mode_active_info": "🕹️ **Spielmodus aktiviert!** Machen Sie sich bereit für die Herausforderungen. Sie können Ihren Fortschritt sehen, indem Sie auf die Schaltfläche '🏆' in der unteren rechten Ecke klicken.",
  "intro_analysis_mode_active_info": "📊 **Analysemodus aktiviert.** Sie sind bereit für eine direkte Erkundung der Daten. Sie können den Modus jederzeit in der Seitenleiste wechseln.",
  "introduction_sucess": "Ihre Reise beginnt hier! Wählen Sie eine Sektion im Seitenmenü oder verwenden Sie die Schaltfläche 'Weiter'.",
  "A1_header": "🌍 Der nationale Puls: Wie schlägt die universitäre Einschreibung?",
  "A1_markdown_1": "Stellen Sie sich vor, wir könnten den Puls des gesamten kubanischen Universitätssystems über ein Jahrzehnt messen. Wie war sein Rhythmus? Hat es Momente kräftigen Wachstums, Perioden der Stabilität oder vielleicht Phasen erlebt, in denen der Herzschlag langsamer wurde?\n\nDieser erste Abschnitt bietet uns einen Panoramablick auf die Gesamteinschreibungen auf nationaler Ebene und ermöglicht es uns, die großen Trends zu identifizieren, die das Hochschulsystem in den letzten Jahren geprägt haben. Es ist unser Ausgangspunkt, um den allgemeinen Kontext zu verstehen, bevor wir uns in spezifischere Analysen vertiefen.",
  "A1_spinner_1": "Erstelle Diagramm A1, bitte warten...",
  "A1_chart_title_historical": "Nationale Einschreibungen: Historische Entwicklung",
  "A1_fig_1_subheader": "Entschlüsselung des Rhythmus des Jahrzehnts (2015-2025):",
  "A1_fig_1_markdown_1": "Bei der Betrachtung der Entwicklung der nationalen Gesamteinschreibungen im obigen Diagramm können wir mehrere Schlüsselphasen identifizieren:\n\n*   **Anfänglicher Impuls (2015-16 bis 2016-17):** Die Reise beginnt im akademischen Jahr 2015-2016 mit einer Zahl von rund **165.000 Studierenden**. Das folgende Jahr zeigt einen leichten Anstieg und schafft eine solide Grundlage für das kommende Wachstum.\n\n*   **Anhaltendes Wachstum bis zum Höhepunkt (2017-18 bis 2020-21):** Ab dem akademischen Jahr 2017-18 und trotz fehlender Daten für 2018-19 wird der Aufwärtstrend mit Nachdruck wieder aufgenommen, bis er im akademischen Jahr 2020-2021 seinen **Höhepunkt mit über 285.000 Studierenden** erreicht. Dieser Zeitraum stellt die Phase der größten Expansion der Einschreibungen im Jahrzehnt dar.\n\n*   **Plateau und Beginn des Rückgangs (2021-22 bis 2022-23):** Das akademische Jahr 2021-2022 zeigt einen leichten Rückgang gegenüber dem Höhepunkt und markiert den Beginn einer neuen Phase. Die Einschreibungen bleiben hoch, wachsen aber nicht mehr, und bis 2022-23 wird der Rückgang deutlicher.\n\n*   **Jüngste Anpassung (2023-24 bis 2024-25):** Die letzten beiden erfassten akademischen Jahre zeigen eine **Fortsetzung des Abwärtstrends**, wobei sich die Gesamteinschreibungen im jüngsten Zeitraum auf rund **205.000 Studierende** belaufen. Dies deutet auf eine Neuausrichtung des Systems nach dem Expansionshöhepunkt hin.",
  "A1_ai_context": "Die aktuelle Analyse befasst sich mit der Entwicklung der nationalen Gesamteinschreibungen von Männern und Frauen in Kuba von 2015 bis 2025. Die im Diagramm dargestellten Daten zeigen einen signifikanten Höhepunkt um 2020-2021, gefolgt von einem Rückgang.",
  "A1_peak_enrollment_label": "Nationale Einschreibungen im Spitzenjahr ({curso})",
  "A1_game_subheader": "Auf die Probe gestellt: Die Größe des Gipfels",
  "A1_game_intro": "Das kubanische Universitätssystem erreichte zu einem Zeitpunkt im letzten Jahrzehnt eine maximale Studierendenzahl. Bevor Sie das Diagramm sehen, wie gut ist Ihre Intuition? Versuchen Sie zu schätzen, wie hoch diese maximale Zahl war.",
  "A1_game_title": "Der nationale Gipfelschätzer",
  "A1_estimator_question": "Wie viele Studierende gab es Ihrer Meinung nach im ganzen Land während des akademischen Jahres mit den meisten Einschreibungen ({curso})?",
  "A2_header": "📚 Ein Mosaik des Wissens: Wohin tendieren die zukünftigen Fachkräfte?",
  "A2_markdown_1": "Die Universität ist ein riesiger Garten, in dem verschiedene Disziplinen gedeihen. Jeder Wissenszweig, von den medizinischen Wissenschaften oder der Mathematik bis zu den Künsten, stellt einen einzigartigen Weg der Ausbildung und des Beitrags zur Gesellschaft dar. In diesem Abschnitt unterteilen wir die Gesamteinschreibungen, um zu sehen, wie sich die Studierenden auf diese großen Bereiche verteilen, mit dem Ziel, Fragen zu beantworten wie:\n- Gibt es klare Protagonisten?\n- Wie hat sich das Interesse der Studierenden im letzten Jahrzehnt entwickelt?",
  "A2_fig_a2_abs_subheader": "Die Stärke jedes Zweiges: Historische Entwicklung der Einschreibungen",
  "A2_spinner_1": "Analysiere die Entwicklung der Wissenschaftszweige...",
  "A2_chart_title_evolution": "Historische Entwicklung nach Zweig",
  "A2_yaxis_title_enrollment_branch": "Einschreibungen im Wissenschaftszweig",
  "A2_legend_title_branch": "Wissenschaftszweig",
  "A2_fig_a2_abs_markdown_1": "**Jede Linie, ein Strom des Wissens:**\nDieses Diagramm zeichnet die Reise der absoluten Einschreibungen (Gesamtzahl der Studierenden) für jeden Wissenschaftszweig im Laufe der Jahre nach.\n\n*   **Herausragende Führung:** Die **Medizinischen Wissenschaften** (türkise Linie) erweisen sich als der Zweig mit den durchweg größten Einschreibungszahlen über den gesamten Zeitraum. Beginnend mit etwa 70.000 Studierenden im Jahr 2015-16 erreichen sie einen beeindruckenden Höhepunkt von fast **95.000 Studierenden im Jahr 2020-2021**. Obwohl sie danach einen Rückgang verzeichnen, bleiben sie die treibende Kraft und schließen 2024-2025 mit über 70.000 Studierenden ab.\n\n*   **Verfolgung und Dynamik:** Die **Pädagogischen Wissenschaften** (orangefarbene Linie) zeigen eine sehr dynamische Entwicklung. Sie beginnen mit einer signifikanten Einschreibungszahl (ca. 30.000) und erleben ein bemerkenswertes Wachstum auf über **65.000 Studierende in den Jahren 2020-2021 und 2021-2022**, wodurch sie in diesen Jahren zum zweitgrößten Zweig werden. In den letzten Jahren erleiden sie jedoch einen starken Rückgang und enden bei fast 40.000 Studierenden.\n\n*   **Konsistenter Mittelblock:** Eine Gruppe von Zweigen hält eine stabile Präsenz, wenn auch mit Schwankungen:\n    *   Die **Technischen Wissenschaften** (rosa Linie) und die **Sozial- und Geisteswissenschaften** (hellblaue Linie) zeigen parallele Verläufe. Sie wachsen von etwa 20.000 Studierenden auf einen Höhepunkt von **30.000-32.000** zwischen 2020-21 und 2021-22, um dann auf etwa 23.000-25.000 Studierende am Ende des Zeitraums zu sinken.\n    *   Die **Wirtschaftswissenschaften** (rote Linie) zeigen ein moderateres, aber konstantes Wachstum bis 2021-22 (ca. 24.000 Studierende), gefolgt von einem ähnlichen Rückgang wie andere Zweige, der bei fast 15.000 endet.\n    *   Die **Agrarwissenschaften** (dunkelblaue Linie) und die **Sportwissenschaften** (dunkelgrüne/braune Linie) bleiben in einem niedrigeren Bereich, typischerweise zwischen 5.000 und 15.000 Studierenden, mit Höhepunkten um 2020-2021 und anschließenden Rückgängen.\n\n*   **Spezialisierte Nische:** Die **Natur- und Mathematikwissenschaften** (lila Linie) und die **Künste** (violette Linie) stellen die Zweige mit dem geringsten Einschreibungsvolumen dar und bleiben über das gesamte Jahrzehnt konstant unter 5.000 Studierenden. Dies deutet auf eine hohe Spezialisierung oder eine begrenztere Nachfrage hin.",
  "A2_fig_a2_pct_subheader": "Die Aufteilung des akademischen Kuchens: Historische prozentuale Verteilung",
  "A2_chart_title_distribution": "Historische prozentuale Verteilung der Einschreibungen nach Wissenschaftszweig",
  "A2_yaxis_label_percentage": "% Einschreibungen",
  "A2_fig_a2_pct_markdown_1": "**Proportionen auf der universitären Leinwand:**\nDieses gestapelte Flächendiagramm zeigt uns, welchen \"Anteil am Kuchen\" jeder Wissenschaftszweig an den gesamten universitären Einschreibungen in jedem akademischen Jahr hatte.\n\n*   **Anhaltende Dominanz der Medizinischen Wissenschaften:** Das breite türkisfarbene Band an der Spitze bestätigt, dass die Medizinischen Wissenschaften durchweg den größten Anteil an Studierenden ausmachten und zu ihrem Höhepunkt (um 2016-17 und erneut gegen 2024-2025, nach einer leichten prozentualen Reduzierung in der Mitte des Zeitraums) fast **40-50% der Gesamtzahl** einnahmen.\n\n*   **Aufstieg und Fall der Pädagogischen Wissenschaften:** Das orangefarbene Band der Pädagogischen Wissenschaften zeigt eine interessante Veränderung ihres relativen Gewichts. Es beginnt als wichtiger Anteil, expandiert erheblich, um den zweitgrößten Anteil darzustellen (fast **25-30%** des Gesamtvolumens um 2019-2021), reduziert dann aber seinen prozentualen Anteil in den letzten Jahren.\n\n*   **Relative Stabilität in der Mitte:** Die Technischen Wissenschaften (braunes/ockerfarbenes Band), die Sozial- und Geisteswissenschaften (hellblaues Band) und die Wirtschaftswissenschaften (dunkelblaues Band) behalten im Laufe der Zeit stabilere Proportionen, wenn auch mit leichten Schwankungen. Zusammen machen sie in der Regel einen erheblichen Teil der Studierendenschaft aus. Zum Beispiel scheinen die Sozial- und Geisteswissenschaften durchweg etwa 10-15% auszumachen.\n\n*   **Geringerer prozentualer Anteil:** Die anderen Zweige (Agrarwissenschaften, Sportwissenschaft, Natur- und Mathematikwissenschaften, Künste) machen einzeln geringere Prozentsätze der Gesamteinschreibungen aus, was mit ihrem geringeren absoluten Studierendenvolumen übereinstimmt.\n\nDiese prozentuale Analyse ist entscheidend, da sie uns nicht nur ermöglicht zu verstehen, wie viele Studierende es in jedem Zweig gibt, sondern auch, wie das Interesse oder die Aufnahmekapazität im Verhältnis zum gesamten Universitätssystem verteilt ist.",
  "A2_subhead_popularity": "Popularitätsranking: Welche Wissensgebiete führen?",
  "A2_intro_game1": "Bevor wir uns die Diagramme ansehen, testen wir Ihre Wahrnehmung. In ganz Kuba wählen jedes Jahr Tausende von Studierenden ihren beruflichen Weg. Welche Wissensgebiete ziehen Ihrer Meinung nach die meisten Studierenden an? Können Sie die Hauptbereiche nach ihrer Popularität ordnen?",
  "A2_game_title": "Der Wissens-Klassifikator",
  "A2_subheader_2": "🔗 Verknüpfungen im Wachstum: Wie hängen die Zweige zusammen?",
  "A2_markdown_2": "Nicht alle Wissenschaftszweige wachsen oder schrumpfen isoliert. Einige können im Laufe der Zeit ähnliche Einschreibungstrends aufweisen, während andere unabhängigere Dynamiken haben können. Die folgende Heatmap visualisiert die **Korrelation der jährlichen prozentualen Veränderung der Einschreibungen** zwischen den verschiedenen Wissenschaftszweigen.\n\n*   Ein **Wert nahe 1 (dunkelblau/tiefviolett)** zeigt eine starke positive Korrelation: Wenn ein Zweig wächst, neigt der andere dazu, im selben Zeitraum ebenfalls zu wachsen.\n*   Ein **Wert nahe -1 (in diesem Beispiel nicht sichtbar, wäre das andere Ende der Farbskala)** würde eine starke negative Korrelation anzeigen: Wenn einer wächst, neigt der andere dazu, zu schrumpfen.\n*   Ein **Wert nahe 0 (hellere/neutrale Farben)** deutet auf wenig oder keine lineare Beziehung in ihren jährlichen Wachstumsmustern hin.",
  "A2_corr_title": "Korrelationsmatrix des jährlichen Wachstums zwischen den Wissenschaftszweigen",
  "A2_corr_legend": "Korrelationskoeffizient",
  "A2_fig_corr_expander": "🔍 Detaillierte Analyse der beobachteten Korrelationen",
  "A2_fig_corr_markdown_1": "**Schlüsselbeobachtungen aus der Korrelationskarte:**\n\n*   **Starke Synchronisation:** Es wird eine **hohe positive Korrelation (Werte > 0.9)** in den jährlichen Wachstumstrends zwischen folgenden Bereichen beobachtet:\n    *   **Agrarwissenschaften und Wirtschaftswissenschaften** (ca. 0.98)\n    *   **Agrarwissenschaften und Pädagogische Wissenschaften** (ca. 0.98)\n    *   **Agrarwissenschaften und Sportwissenschaften** (ca. 0.96)\n    *   Sowie zwischen **Wirtschafts-, Pädagogischen und Sportwissenschaften**, die alle sehr hohe Koeffizienten untereinander aufweisen.\n    Dies deutet darauf hin, dass diese Zweige oft sehr ähnliche und gleichzeitige Wachstums- (oder Schrumpfungs-) Impulse erfahren, möglicherweise aufgrund von makroökonomischen Faktoren, umfassenden Bildungspolitiken oder Zyklen der studentischen Nachfrage, die sie gemeinsam betreffen.\n\n*   **Moderate positive Korrelationen:**\n    *   Die **Medizinischen Wissenschaften** zeigen eine moderate positive Korrelation (in der Regel zwischen 0.5 und 0.7) mit mehreren anderen Zweigen wie den Wirtschafts-, Sozial- und Geisteswissenschaften sowie den Technischen Wissenschaften. Dies könnte darauf hindeuten, dass der medizinische Sektor, obwohl er seine eigenen Dynamiken hat, auch von breiteren expansionistischen Trends im Hochschulwesen profitiert oder daran teilnimmt.\n    *   Die **Technischen Wissenschaften** korrelieren ebenfalls mäßig mit den meisten anderen Zweigen, was auf eine Verbindung mit dem allgemeinen Zyklus des Systems hindeutet.\n\n*   **Bemerkenswerte relative Unabhängigkeit:**\n    *   Die **Natur- und Mathematikwissenschaften** zeichnen sich durch die **niedrigsten Korrelationen** mit fast allen anderen Zweigen aus (Koeffizienten oft zwischen 0.2 und 0.4). Dies deutet darauf hin, dass ihr Einschreibungswachstumsmuster ziemlich unabhängig von den Schwankungen ist, die andere große Wissensbereiche betreffen. Dieser Zweig könnte von sehr spezifischen Faktoren beeinflusst werden, wie z.B. besonderen wissenschaftlichen Förderprogrammen oder einer spezialisierteren und weniger auf allgemeine Trends ansprechenden Nachfrage.\n    *   Die **Künste** zeigen auch schwächere Korrelationen mit einigen der größeren Zweige wie den Pädagogischen Wissenschaften, obwohl sie eine interessante moderate Korrelation mit den Medizinischen Wissenschaften aufweisen.\n\n*   **Strategische Implikationen:**\n    *   Die starke Synchronisation zwischen bestimmten Zweigen legt nahe, dass Planungs- und Ressourcenallokationsstrategien diese Verhaltens-\"Cluster\" berücksichtigen könnten.\n    *   Die Unabhängigkeit der Natur- und Mathematikwissenschaften könnte einen differenzierten Ansatz und eine differenzierte Überwachung erfordern, um ihre Vitalität und Ausrichtung auf die wissenschaftlich-technischen Entwicklungsbedürfnisse des Landes zu gewährleisten.\n    *   Das Fehlen stark negativer Korrelationen (in diesem Diagramm) deutet darauf hin, dass es auf aggregierter Ebene der jährlichen Veränderung keine offensichtliche \"Kannibalisierung\" gibt, bei der das Wachstum eines Zweiges direkt auf Kosten eines anderen geht, obwohl wettbewerbsfähige Dynamiken auf spezifischeren Ebenen nicht ausgeschlossen sind.",
  "A2_corr_warn_1": "Die Korrelationskarte zwischen den Zweigen konnte nicht erstellt werden.",
  "A2_subhead_correlation": "Versteckte Synergien: Welche Zweige wachsen gemeinsam?",
  "A2_intro_game2": "Die Wissenszweige sind keine Inseln. Ihre Wachstumstrends sind oft miteinander verbunden. Einige bewegen sich in perfekter Synchronität, während andere ihren eigenen Rhythmus tanzen. Wenn das Interesse an den Pädagogischen Wissenschaften wächst, welcher andere Bereich profitiert Ihrer Meinung nach von einem ähnlichen Schub? Nehmen Sie das Duell an und finden Sie es heraus!",
  "A2_game_title_corr": "Synergie-Duell",
  "A2_duel_question_corr": "Das Wachstum der **Pädagogischen Wissenschaften** ist AM ÄHNLICHSTEN dem von:",
  "A3_header": "🔍 Studiengänge unter der Lupe: Popularität, Trends und Dynamik",
  "A3_markdown_1": "Nachdem wir die großen Wissenszweige erkundet haben, ist es an der Zeit, unsere Lupe auf die grundlegenden Einheiten zu richten: die universitären Studiengänge. Welche ziehen das größte studentische Interesse auf sich? Wie war ihre individuelle Entwicklung? Und, sehr wichtig, welche zeigen ein beschleunigtes Wachstum und welche scheinen an Fahrt zu verlieren?",
  "A3_subheader_2": "🏆 Das Podium der Studiengänge: Welche führen die aktuellen Einschreibungen an?",
  "A3_spinner_1": "Analysiere das Ranking und die Entwicklung der Top-Studiengänge...",
  "A3_warning_analysis_failed": "Die Popularitätsanalyse der Studiengänge konnte nicht durchgeführt werden. Status: {status}",
  "A3_markdown_2": "Links sehen wir das Ranking aller Studiengänge nach ihrer Gesamteinschreibung im letzten akademischen Jahr ({year_range}). Rechts sehen wir die historische Entwicklung der Einschreibungen für die {top_n} Studiengänge, die sich derzeit an der Spitze dieses Rankings befinden.",
  "A3_chart_title_evolution": "Historische Entwicklung (Top {n} aktuelle Studiengänge)",
  "A3_chart_yaxis_enrollment": "Gesamteinschreibungen im Studiengang",
  "A3_col_evo_top_info": "Für die aktuellen Top-Studiengänge wurde kein Entwicklungsdiagramm erstellt.",
  "A3_markdown_3": "**Schlüsselpunkte des Podiums:**\n*   **Unbestrittene Führung:** **Medizin** ist fest als der Studiengang mit den meisten Einschreibungen (35.889 Studierende) positioniert, eine Konstante, die wir bereits bei der Analyse der Wissenszweige erahnt hatten.\n*   **Bedeutende Kräfte:** Es folgen **Sportwissenschaft** (14.695) und **Grundschulbildung** (12.867), die eine erhebliche Nachfrage in diesen Bereichen aufweisen.\n*   **Robuste Top 5:** **Krankenpflege** (9.999) und **Rechnungswesen und Finanzen** (9.883) vervollständigen die Top 5, beide mit einer Einschreibungszahl sehr nahe an 10.000 Studierenden.\n*   **Entwicklung der Führenden:** Das Diagramm rechts ermöglicht es uns zu sehen, wie diese Studiengänge (und andere aus den Top 10) ihre aktuelle Position erreicht haben. Beachten Sie, wie einige ein nachhaltigeres Wachstum hatten, während andere ausgeprägtere Höhen und Tiefen aufweisen.",
  "A3_game1_subheader": "Auf die Probe gestellt: Das Popularitätsranking",
  "A3_game1_intro": "Bevor Sie das vollständige Ranking sehen, wie gut ist Ihre Intuition bezüglich der studentischen Nachfrage? Wir präsentieren Ihnen eine Auswahl an Studiengängen. Ordnen Sie sie vom beliebtesten zum am wenigsten beliebten gemäß den Einschreibungen des letzten Jahres!",
  "A3_game1_title": "Der Studiengang-Klassifikator",
  "A3_subheader_4": "🚀 Das Tempo des Wandels: Welche Studiengänge starten durch oder verlieren an Höhe?",
  "A3_markdown_4": "Die **durchschnittliche jährliche Wachstumsrate (CAGR)** bietet uns eine Perspektive auf die Dynamik. Sie berechnet das durchschnittliche jährliche prozentuale Wachstum (oder den Rückgang) der Einschreibungen eines Studiengangs über den gesamten analysierten Zeitraum. Ein hoher CAGR deutet auf eine schnelle Expansion hin.",
  "A3_spinner_4": "Berechne die Dynamik der Studiengänge (CAGR)...",
  "A3_warning_cagr_failed": "Die Wachstumsanalyse (CAGR) konnte nicht durchgeführt werden. Status: {status}",
  "A3_chart_title_cagr_top": "Top 15 mit dem höchsten durchschnittlichen jährlichen Wachstum {periodo}",
  "A3_chart_title_cagr_bottom": "Top 15 mit dem höchsten durchschnittlichen jährlichen Rückgang {periodo}",
  "A3_cagr_top_title": "📈 Top 15 mit dem größten Wachstum",
  "A3_col_cagr_top_markdown_2": "Diese Studiengänge haben die bemerkenswerteste Expansion ihrer durchschnittlichen jährlichen Einschreibungen erfahren.\n*   **Überraschender Start:** **Zahnmedizinische Dienstleistungen** führt mit einem CAGR von über 100%, was auf eine Verdopplung (oder mehr) der durchschnittlichen Einschreibungen von Jahr zu Jahr hindeutet.\n*   **Boomende Ingenieurwissenschaften:** Mehrere Ingenieurstudiengänge wie **Künstlerische Gestaltung**, **Agrarindustrielle Prozesse** und **Informatik** zeigen ein sehr gesundes Wachstum.\n*   **Bildung mit Schwung:** Bildungsbereiche wie **Vorschulbildung**, **Agrarwirtschaft** und **Grundschulbildung** weisen ebenfalls einen positiven und signifikanten CAGR auf.",
  "A3_cagr_bottom_title": "📉 Top 15 mit dem größten Rückgang",
  "A3_col_cagr_bottom_markdown_2": "Am anderen Ende haben diese Studiengänge einen Rückgang oder ein viel langsameres Wachstum ihrer durchschnittlichen jährlichen Einschreibungen verzeichnet.\n*   **Bemerkenswerte Anpassungen:** **Soziokulturelle Studien** und **Stomatologie** (nicht zu verwechseln mit Zahnmedizinischen Dienstleistungen) weisen die größten durchschnittlichen Rückgänge auf.\n*   **Vielfältige Herausforderungen:** Studiengänge wie **Agrartechnik**, **Bildende Kunst**, **Mathematik**, **Musik** und verschiedene **Ingenieurwissenschaften** (Hydraulik, Bauingenieurwesen, Telekommunikation, Wirtschaftsingenieurwesen) erscheinen ebenfalls in dieser Liste, was eine Überprüfung ihrer Trends nahelegt.",
  "A3_markdown_5": "**Strategische Überlegungen aus diesen Rhythmen:**\n*   Ein **hoher CAGR** bedeutet nicht immer eine massive Gesamteinschreibung (es könnte sich um einen kleinen, schnell wachsenden Studiengang handeln), aber es deutet auf einen **starken positiven Trend** hin, der Aufmerksamkeit verdient, sei es zur Förderung oder zur Sicherung von Ressourcen.\n*   Ein **niedriger oder negativer CAGR** in wichtigen Studiengängen könnte ein Signal sein, die Ursachen zu untersuchen: Veränderungen auf dem Arbeitsmarkt, studentische Präferenzen, akademisches Angebot?\n*   Es ist entscheidend, diese CAGR-Informationen mit den absoluten Einschreibungen (aus dem Ranking) zu vergleichen, um ein vollständiges Bild zu erhalten.",
  "A3_game2_subheader": "Wachstumsduell",
  "A3_game2_intro": "Einige Studiengänge wachsen rasant, während andere schrumpfen. Können Sie erkennen, welche der beiden Optionen eine höhere durchschnittliche jährliche Wachstumsrate hatte? Nehmen Sie das Duell an!",
  "A3_game2_title": "Wachstumsduell",
  "A3_duel_question": "Dieser Studiengang hatte ein **HÖHERES** durchschnittliches Wachstum als der andere.",
  "A4_header": "♀️♂️ Die Waage ausbalancieren: Ein Blick auf die Geschlechterperspektive",
  "A4_markdown_1": "Die Universität bildet nicht nur Fachkräfte aus, sondern formt auch eine gerechtere und gleichberechtigtere Gesellschaft. In diesem Abschnitt befassen wir uns mit der Geschlechterzusammensetzung der universitären Einschreibungen. Gibt es ein Gleichgewicht zwischen Männern und Frauen in den Hörsälen? Gibt es Wissensbereiche, die traditionell mit einem Geschlecht verbunden sind und diese Muster beibehalten, oder erleben wir eine Transformation hin zu mehr Parität? Begleiten Sie uns, um es herauszufinden.",
  "A4_spinner_1": "Analysiere die Geschlechterperspektive...",
  "A4_warning_analysis_failed": "Die Geschlechteranalyse konnte nicht durchgeführt werden. Status: {status}",
  "A4_fig_ramas_subheader": "Frauenanteil nach Wissenschaftszweig ({curso})",
  "A4_chart_title_branches": "Prozentsatz der Frauen nach Wissenschaftszweig ({curso})",
  "A4_chart_yaxis_women_pct": "% Frauen",
  "A4_fig_ramas_markdown_1": "**Das Gesamtbild nach Wissensbereichen:**\nDieses Balkendiagramm zeigt uns den Prozentsatz der Frauen, die in jedem großen Wissenschaftszweig eingeschrieben sind. Die gestrichelte rote Linie bei 50% stellt die perfekte Parität dar.\n\n*   **Ausgeprägte weibliche Führung:** Die **Pädagogischen Wissenschaften** stechen mit über **80%** weiblichen Einschreibungen hervor, dicht gefolgt von den **Sozial- und Geisteswissenschaften** und den **Medizinischen Wissenschaften**, die beide **70%** überschreiten. Dies deutet auf eine starke weibliche Präsenz und Präferenz in diesen wichtigen Bereichen hin.\n*   **Anhaltende weibliche Mehrheit:** Die **Wirtschaftswissenschaften**, **Künste** und **Natur- und Mathematikwissenschaften** zeigen ebenfalls eine Mehrheit von Frauen mit Prozentsätzen zwischen **55% und 65%**, die über der Paritätslinie liegen.\n*   **Nahe an der Parität oder leichte männliche Mehrheit:** Die **Agrarwissenschaften** sind näher am Gleichgewicht, wenn auch immer noch mit einer leichten weiblichen Mehrheit (fast 50%).\n*   **Herausforderungen in technischen und sportlichen Bereichen:** Im Gegensatz dazu sind die **Technischen Wissenschaften** (ca. 35% Frauen) und, noch deutlicher, die **Sportwissenschaften** (ca. 32% Frauen) die Zweige mit der geringsten weiblichen Vertretung, was auf eine anhaltende Geschlechterkluft in diesen Feldern hinweist.",
  "A4_info_no_branch_data": "Keine Geschlechterdaten nach Zweigen verfügbar.",
  "A4_fig_carreras_subheader": "Zoom auf Studiengänge: Extreme des Geschlechterspektrums ({curso}, Einschreibungen >= 30)",
  "A4_legend_major_women": "Mehrheit Frauen",
  "A4_legend_minor_women": "Minderheit Frauen",
  "A4_chart_title_careers_gender": "Geschlechterungleichgewicht in Studiengängen ({curso}, Einschreibungen >= 30)",
  "A4_subplot_title_top_women": "Top 10 Studiengänge mit dem höchsten Frauenanteil",
  "A4_subplot_title_low_women": "Top 10 Studiengänge mit dem niedrigsten Frauenanteil",
  "A4_fig_carreras_markdown_1": "**Herausragende Fälle von weiblicher Mehrheit und Minderheit:**\nDiese Diagramme führen uns ins Detail der Studiengänge und zeigen die 10 mit dem höchsten Frauenanteil und die 10 mit dem niedrigsten Anteil (d.h. höchster Männeranteil), sofern sie mindestens 30 eingeschriebene Studierende haben, um die Repräsentativität zu gewährleisten.\n\n*   **Extreme Feminisierung in einigen Bereichen:** Studiengänge wie **Vorschulbildung** nähern sich 100% weiblichen Einschreibungen. Andere, wie **Höherer Techniker in Logopädie und Audiologie**, **Logopädie-Bildung** und **Spanisch-Literatur-Bildung**, zeigen ebenfalls eine überwältigende Mehrheit von Frauen von über 90%. Dies steht im Einklang mit der hohen Feminisierung der Pädagogischen Wissenschaften. **Zahnmedizinische Dienstleistungen** und **Soziokulturelle Studien** stechen in dieser Gruppe ebenfalls hervor.\n\n*   **Männliche Dominanz in Ingenieurwesen und technischen Bereichen:** Am anderen Ende weisen Studiengänge wie **Informatik**, **Automatisierungstechnik**, **Computerwissenschaften**, **Investitionsprozessmanagement** und verschiedene **Maschinenbau-, Elektrotechnik- und Höhere Techniker in Sporttraining** sehr niedrige Frauenanteile auf, einige unter 10% und die meisten unter 25%. Dies spiegelt die auf Zweigebene beobachtete Lücke in den Technischen und Sportwissenschaften wider.\n\n*   **Wichtige Nuancen:** Es ist entscheidend zu beachten, dass selbst innerhalb der \"Top 10 mit dem niedrigsten Frauenanteil\" die Prozentsätze variieren. Während einige Ingenieurstudiengänge kaum 5-10% weibliche Präsenz überschreiten, können andere näher bei 20-25% liegen.",
  "A4_info_no_career_data": "Nicht genügend Studiengangdaten, um die Analyse der Geschlechterextreme anzuzeigen.",
  "A4_markdown_2": "---\n**Überlegungen zum Handeln:**\n*   Die hohe Feminisierung in bestimmten Zweigen und Studiengängen ist ein gefestigtes Phänomen. Obwohl es Berufungen widerspiegelt, ist es auch wichtig sicherzustellen, dass es keine impliziten Barrieren oder Abschreckungen für die männliche Teilnahme gibt.\n*   Die größte Herausforderung für die Geschlechtergerechtigkeit liegt eindeutig in den **Technischen Wissenschaften** und in mehreren spezifischen Ingenieurstudiengängen sowie in den **Sportwissenschaften**. Es sind kontinuierliche und wirksame Strategien erforderlich, um mehr Frauen für diese für die technologische und soziale Entwicklung entscheidenden Bereiche zu gewinnen und zu halten.\n*   Diese Daten sind eine Einladung, tiefer zu graben: Was sind die Ursachen für diese Ungleichgewichte? Wie können wir neue Generationen inspirieren, alle Wissensbereiche ohne geschlechtsspezifische Vorurteile zu erkunden?",
  "A4_game1_subheader": "Geschlechterduell nach Zweig",
  "A4_game1_intro": "Einige Wissensbereiche ziehen mehr Frauen an als andere. Können Sie sagen, in welchem der folgenden Zweige der prozentuale Anteil weiblicher Einschreibungen höher ist?",
  "A4_game1_title": "Duell der Zweige",
  "A4_duel_question": "Welcher Zweig hat einen HÖHEREN Frauenanteil?",
  "A4_game2_subheader": "Moment! Es gibt einen Eindringling unter den Studiengängen!",
  "A4_game2_intro": "Drei der folgenden Studiengänge haben eine überwältigende Mehrheit von Frauen in ihren Hörsälen. Einer davon ist jedoch ein überwiegend männliches Feld. Identifizieren Sie den Eindringling!",
  "A4_game2_title": "Der Geschlechter-Eindringling",
  "A5_header": "🏛️ Universitäten im Blick: Stärken und Spezialisierungsbereiche entdecken",
  "A5_markdown_1": "Jede Universität ist ein einzigartiges Ökosystem mit eigener Geschichte, Berufung und Exzellenzbereichen. In diesem Abschnitt wechseln wir unsere Perspektive, um zu analysieren, wie sich das studentische Talent auf institutioneller Ebene verteilt. Welche Universitäten konzentrieren die meisten Studierenden? Gibt es hochspezialisierte Zentren in bestimmten Zweigen oder Studiengängen? Und welche Studiengänge sind seltene Juwelen, die nur von wenigen Institutionen angeboten werden?",
  "A5_spinner_1": "Analysiere die institutionelle Verteilung der Einschreibungen...",
  "A5_warning_analysis_failed": "Die institutionelle Analyse konnte nicht durchgeführt werden. Status: {status}",
  "A5_fig_treemap_subheader": "Interaktive Karte der universitären Einschreibungen ({curso})",
  "A5_treemap_root_label": "Alle Universitäten",
  "A5_treemap_title": "Verteilung der Einschreibungen ({curso})",
  "A5_fig_treemap_markdown_1": "**Navigation im institutionellen Universum:**\nDiese \"Treemap\" ist eine visuelle Darstellung der Gesamteinschreibungen.\n*   **Die Größe zählt:** Die Fläche jedes Rechtecks ist proportional zur Anzahl der Studierenden. Es beginnt mit \"Alle Universitäten\"; klicken Sie auf eine Universität (z.B. `UCLV`, `UH`, `CUJAE`), um zu sehen, wie sich ihre Einschreibungen nach Wissenschaftszweigen aufteilen. Ein weiterer Klick auf einen Zweig zeigt Ihnen die Studiengänge darin und ihr Gewicht an dieser Institution.\n*   **Identifizieren Sie die Giganten:** Auf einen Blick können Sie die Universitäten mit dem größten Studierendenvolumen identifizieren. Zum Beispiel zeigen die **UO (Universität des Ostens)**, **UH (Universität von Havanna)** und **UCMLH (Medizinische Universität von Havanna)** unter anderem beträchtlich große Rechtecke, was auf eine bedeutende Einschreibungszahl hindeutet.\n*   **Spezialisierungsbereiche:** Beachten Sie, wie einige Universitäten fast ihre gesamte \"Fläche\" auf ein oder zwei Zweige konzentrieren (z.B. die Medizinischen Universitäten vorwiegend in \"Medizinische Wissenschaften\"), während andere eine größere Diversifizierung aufweisen. Wie man sieht, stechen die Medizinischen Wissenschaften an allen Universitäten hervor, die sie anbieten.",
  "A5_info_no_treemap_data": "Keine Daten zur Erstellung der interaktiven Karte verfügbar.",
  "A5_df_carreras_unicas_subheader": "Akademische Juwelen: Studiengänge nach Exklusivitätsgrad",
  "A5_df_carreras_unicas_markdown_new": "Dieses Diagramm gruppiert die Studiengänge nach der Anzahl der Universitäten, die sie im akademischen Jahr {curso} anbieten. Jeder Punkt repräsentiert einen Studiengang. Fahren Sie mit der Maus über einen Punkt, um seinen Namen zu sehen. Die Anmerkungen oben geben an, wie viele Studiengänge in jeder Exklusivitätsgruppe existieren.",
  "A5_chart_title_grouped_offer": "Verteilung der Studiengänge nach Exklusivität des Angebots",
  "A5_chart_yaxis_num_unis": "Anzahl der anbietenden Universitäten",
  "_carrers": "Studiengänge",
  "A5_expander_show_all_data": "Die vollständige Tabelle mit allen Studiengängen anzeigen",
  "A5_info_no_limited_offer_data": "Keine Daten zu Studiengängen mit begrenztem Angebot gefunden.",
  "A5_game1_subheader": "Universitäts-GeoGuesser",
  "A5_game1_intro": "Bevor Sie die Universitäten im Detail analysieren, kennen Sie deren Standort? Beweisen Sie es!",
  "A5_game1_title": "Errate die Provinz",
  "A5_game2_subheader": "Errate die Exklusivität",
  "A5_game2_intro": "Einige Studiengänge werden im ganzen Land unterrichtet, während andere wahre Raritäten sind. Wie exklusiv schätzen Sie den folgenden Studiengang ein?",
  "A5_game2_title": "Der Exklusivitäts-Schätzer",
  "A5_subheader_2": "Fokus auf Schlüsselstudiengänge: Wer ist wer in der spezifischen Ausbildung?",
  "A5_markdown_2": "Wählen Sie bis zu 3 Studiengänge Ihres Interesses aus. Das Diagramm zeigt die historische Entwicklung der Einschreibungen für diese Studiengänge, aufgeschlüsselt nach jeder anbietenden Universität. Dies ermöglicht es uns, das Gewicht und die Entwicklung verschiedener Institutionen bei der Ausbildung von Fachkräften in spezifischen Bereichen zu vergleichen.\n\n*Wenn das Diagramm zu dicht erscheint, versuchen Sie, weniger Studiengänge auszuwählen oder konzentrieren Sie sich auf die allgemeinen Trends der größten Universitäten für jeden Studiengang.*",
  "A5_multiselect_carreras": "Studiengänge zum Vergleich der Entwicklungen nach Universität:",
  "A5_spinner_2": "Erstelle Vergleichsdiagramm nach Universität...",
  "A5_chart_title_uni_comparison": "Entwicklung nach Universität für: {careers}",
  "A5_chart_yaxis_enrollment": "Gesamteinschreibungen",
  "A5_warning_comparison_failed": "Das Vergleichsdiagramm konnte nicht erstellt werden. Ursache: {status}",
  "A5_no_carreras_selected": "Bitte wählen Sie mindestens einen Studiengang aus, um den Vergleich zu sehen.",
  "A5_markdown_3": "---\n**Strategische Visionen für das Universitätsnetzwerk:**\n*   **Exzellenz fördern:** Die Identifizierung führender Universitäten in Schlüsselstudiengängen kann Investitionen lenken, um sie zu nationalen oder internationalen Referenzzentren zu machen.\n*   **Ressourcen optimieren:** Die Treemap und die Analyse einzigartiger Angebote können unnötige Doppelungen oder im Gegenteil die Notwendigkeit aufdecken, das Angebot bestimmter Studiengänge in mehr Regionen auszuweiten.\n*   **Interinstitutionelle Zusammenarbeit:** Das Wissen um die Stärken jeder einzelnen kann Synergien, gemeinsame Programme und die Mobilität von Studierenden und Lehrenden fördern.",
  "A6_header_1": "🔭 Blick in die Zukunft: Was können wir erwarten? (Zukunftsprognosen)",
  "A6_markdown_1": "Die Zukunft vorauszusagen ist eine Herausforderung, aber die Analyse jüngster Trends ermöglicht es uns, mögliche Szenarien zu entwerfen. In diesem Abschnitt werden wir unsere wichtigsten Einschreibungsindikatoren erneut untersuchen, diesmal jedoch unseren Blick durch Prognosen um zwei akademische Jahre nach vorne erweitern.\n\n⚠️ **Ein Kompass, kein Orakel:** Es ist entscheidend, sich daran zu erinnern, dass dies **Prognosen** und keine unfehlbaren Vorhersagen sind. Sie basieren auf einfachen **linearen Regressionsmodellen, die auf die letzten 6 Jahre historischer Daten** (oder weniger, wenn die Daten für einen bestimmten Zweig oder Studiengang unzureichend sind) angewendet werden. Mehrere in diesen Modellen nicht berücksichtigte Faktoren (Politikänderungen, Wirtschaftskrisen, neue gesellschaftliche Anforderungen usw.) könnten diese Verläufe erheblich verändern. Nutzen wir sie als Werkzeug für strategische Überlegungen und proaktive Planung, nicht als in Stein gemeißeltes Schicksal.",
  "A6_chart_title_projection": "Entwicklung und Prognose (Lin. Reg. letzte {n_years} Jahre)",
  "A6_chart_title_branches_projection": "Entwicklung und Prognose nach Zweig (Lin. Reg. letzte {n_years} Jahre oder weniger)",
  "A6_subheader_1": "Nationaler Horizont: Prognose der Gesamteinschreibungen",
  "A6_spinner_1": "Berechne die nationale Einschreibungsprognose...",
  "A6_info_1": "Die gestrichelten Linien und die rautenförmigen Punkte über das akademische Jahr 2024-2025 hinaus stellen die Prognosen dar.",
  "A6_markdown_national_explanation": "**Interpretation des prognostizierten nationalen Trends:**\n\nDas obige Diagramm kombiniert die historische Entwicklung der Einschreibungen (Balken und durchgezogene Linie bis zum akademischen Jahr 2024-25) mit einer Prognose für die nächsten beiden akademischen Jahre (gestrichelte Linie mit Rauten).\n\n*   **Ausgangspunkt:** Die Prognose beginnt mit den letzten erfassten historischen Daten, die eine nationale Einschreibungszahl von etwa **205.000 Studierenden** zeigen.\n*   **Prognostizierter Verlauf:** Das lineare Regressionsmodell, basierend auf dem Trend der letzten Jahre, deutet auf eine **Fortsetzung der Anpassungs- oder moderaten Rückgangsphase** hin, die im jüngsten Zeitraum beobachtet wurde.\n*   **Zukünftige Schätzungen:**\n    *   Für das akademische Jahr **2025-2026** schätzt das Modell eine Einschreibungszahl im Bereich von **195.000 bis 215.000 Studierenden**.\n    *   Bis **2026-2027** könnte diese Zahl auf etwa **185.000 bis 190.000 Studierende** sinken.\n*   **Strategische Implikation:** Wenn sich dieser Trend bewahrheitet, wirft er wichtige Fragen für die Planung auf: Wie würde dies die installierte Kapazität an den Universitäten beeinflussen? Würde es eine Neubewertung der Ressourcenzuweisung oder neue Strategien zur Gewinnung und Bindung von Studierenden auf nationaler Ebene erfordern?",
  "A6_warning_national_proj_failed": "Die nationale Prognose konnte nicht erstellt werden. Status: {status}",
  "A6_fig_A2_subheader": "Wissen von Morgen: Prognose nach Wissenschaftszweig",
  "A6_fig_A2_spinner": "Berechne die Prognose nach Wissenschaftszweig...",
  "A6_warning_branches_proj_failed": "Die Prognose nach Zweigen konnte nicht erstellt werden.",
  "A6_fig_A7_subheader_1": "Schlüsselstudiengänge am Horizont: Interaktive Prognose",
  "A6_fig_A7_markdown_1": "Wählen Sie bis zu 3 Studiengänge Ihres Interesses aus, um deren individuelle Einschreibungsprognose zu visualisieren.",
  "A6_fig_A7_multiselect_1": "Wählen Sie Studiengänge zur Prognose aus:",
  "A6_fig_A7_spinner_1": "Berechne die Prognose für die ausgewählten Studiengänge...",
  "A6_game_subheader": "🔮 Das Einschreibungs-Orakel",
  "A6_game_intro": "Bevor wir die Prognosen des Modells enthüllen, testen wir Ihre Intuition als Analyst. Beobachten Sie die historische Entwicklung der nationalen Einschreibungen. Basierend auf diesem Trend, was glauben Sie, geschah im letzten erfassten Jahr? Setzte sich der Trend fort, stabilisierte er sich oder kehrte er sich um?",
  "A6_game_item_name": "Nationale Einschreibungen",
  "A6_game_title": "Sagen Sie den nationalen Trend voraus",
  "A7_header_1": "💡 Aufmerksamkeitsbereiche: Spezifische Herausforderungen und Chancen",
  "A7_markdown_1": "Über die großen Trends hinaus gibt es besondere Situationen in Studiengängen und Universitäten, die einen besonderen Blick verdienen. Einige Studiengänge könnten stark aufkommen, andere könnten ihren Angebotszyklus abgeschlossen haben, und eine dritte Gruppe kämpft vielleicht darum, eine ausreichende Anzahl von Studierenden zu gewinnen. Das Erkennen dieser Fälle bedeutet nicht, Probleme aufzuzeigen, sondern Möglichkeiten für eine präzisere, agilere und an die sich ändernden Realitäten angepasste akademische Verwaltung zu entdecken.",
  "A7_spinner_1": "Identifiziere spezifische Aufmerksamkeitsbereiche...",
  "A7_error_a8_analysis": "Die Analyse der Aufmerksamkeitsbereiche konnte nicht abgeschlossen werden.",
  "A7_a8_subheader_1": "🌱 Die Zukunft säen: Mögliche neue Angebote oder Reaktivierungen",
  "A7_a8_markdown_1": "Das folgende Diagramm zeigt, wie viele neue oder reaktivierte Studiengänge jedes Jahr entdeckt wurden. Dies zeigt die Perioden der größten Expansion oder Erneuerung des akademischen Angebots.",
  "A7_chart_title_new_offers": "Neue oder reaktivierte Angebote pro Jahr",
  "A7_chart_xaxis_year_new_offers": "Jahr der Entdeckung/Reaktivierung",
  "A7_expander_new_offers": "Die vollständige Liste der {count} neu entdeckten Angebote anzeigen",
  "A7_col_detected_start_year": "Entdecktes Startjahr",
  "A7_col_current_enrollment": "Aktuelle Einschreibungen",
  "A7_info_no_new_offers": "Es wurden keine Studiengänge identifiziert, die eindeutig dem Kriterium eines neuen Angebots oder einer Reaktivierung entsprechen.",
  "A7_a8_subheader_2": "🍂 Zyklen, die enden: Mögliche Einstelllungen von Angeboten",
  "A7_a8_markdown_2_revised": "Dieses Diagramm fasst zusammen, wie viele Studiengänge pro Jahr keine Einschreibungen mehr hatten, was uns eine Vorstellung von den Perioden mit den größten Anpassungen oder Einstellungen im akademischen Angebot gibt.",
  "A7_chart_title_ceased_offers": "Mögliche Angebotseinstellungen nach letztem Jahr mit Einschreibung",
  "A7_chart_xaxis_last_year": "Letztes Jahr mit Einschreibung",
  "A7_expander_ceased_offers": "Die vollständige Liste der {count} möglicherweise eingestellten Angebote anzeigen",
  "A7_col_last_enrollment_year": "Letztes Jahr mit Einschreibung",
  "A7_info_no_ceased_offers": "Es wurden keine Studiengänge identifiziert, die eindeutig dem Kriterium der Angebotseinstellung entsprechen.",
  "A7_a8_subheader_3": "📉 Fokusbereiche: Geringe Einschreibungen (unter {umbral})",
  "A7_a8_markdown_3_revised": "Das folgende Diagramm gruppiert die Studiengänge nach ihrer Einschreibungszahl im akademischen Jahr {curso}. Jeder Punkt repräsentiert einen Studiengang an einer bestimmten Universität. Fahren Sie mit der Maus über einen Punkt, um die Details zu sehen. Dies hilft uns zu sehen, wo sich die Fälle mit den kritischsten Einschreibungszahlen konzentrieren (z.B. 1 oder 2 Studierende).",
  "A7_chart_title_low_enrollment": "Angebote mit geringer Einschreibung (Akademisches Jahr {curso}, < {umbral} Studierende)",
  "A7_chart_yaxis_low_enrollment": "Anzahl der Studierenden",
  "A7_expander_low_enrollment": "Die vollständige Liste der {count} Studiengänge mit geringer Einschreibung anzeigen",
  "A7_col_enrollment_last_year": "Einschreibungen ({curso})",
  "A7_info_no_low_enrollment": "Im letzten Jahr wurden keine Studiengänge mit Einschreibungen unter {umbral} (und >0) identifiziert.",
  "A7_conclusion_markdown_1": "---\n**Informierte Entscheidungen für proaktives Management:**\nDie in diesem Abschnitt präsentierten Informationen sind ein Aufruf zu spezifischen Maßnahmen:\n*   **Neue Angebote / Reaktivierungen:**\n    *   **Überprüfen:** Entsprechen sie geplanten Einführungen oder Reaktivierungen?\n    *   **Überwachen:** Ihre anfängliche Entwicklung, Ressourcenbedarf und Konsolidierungsstrategien bewerten.\n    *   **Lernen:** Reagieren sie auf eine aufkommende soziale oder berufliche Nachfrage, die repliziert werden könnte?\n*   **Mögliche Angebotseinstellungen:**\n    *   **Bestätigen:** Ist die Einstellung offiziell und endgültig? Bei Bedarf die Aufzeichnungen aktualisieren.\n    *   **Auswirkungen bewerten:** Wenn die Einstellung nicht geplant war oder negative Auswirkungen hat (z.B. einziges Angebot in einer Region), die Ursachen untersuchen.\n*   **Geringe Einschreibungen:**\n    *   **Ursachenanalyse:** Handelt es sich um hochspezialisierte Studiengänge mit naturgemäß begrenzter Nachfrage? Rekrutierungsprobleme? Veralteter Lehrplan? Mangelnde berufliche Relevanz?\n    *   **Differenzierte Strategien:** Je nach Diagnose könnten die Maßnahmen von gezielter Förderung, Neugestaltung des Lehrplans bis hin zur Prüfung einer Fusion mit anderen Studiengängen oder letztendlich einer geplanten Einstellung reichen, wenn ihre Aufrechterhaltung nicht gerechtfertigt ist.\n\nEine aufmerksame Verwaltung dieser Details ermöglicht die Optimierung von Ressourcen, eine bessere Reaktion auf die Bedürfnisse des Landes und die Gewährleistung der Vitalität und Relevanz des akademischen Angebots der Universität.",
  "A7_game_subheader": "🕵️‍♂️ Finden Sie den Fokusbereich",
  "A7_game_intro": "Unter den vielfältigen akademischen Angeboten der Universitäten gedeihen einige mit Hunderten von Studierenden, während andere darum kämpfen, über Wasser zu bleiben. Im Folgenden präsentieren wir vier universitäre Angebote. Drei davon haben gesunde Einschreibungszahlen, aber eines ist ein \"Fokusbereich\" mit kritisch niedrigen Einschreibungen. Können Sie den Eindringling identifizieren?",
  "A7_game_title": "Der Eindringling mit geringer Einschreibung",
  "A7_chart_yaxis_enrollment": "Gesamteinschreibungen",
  "A7_chart_title_projection": "Einschreibungsprognose für ausgewählte Studiengänge",
  "a7_proy_warning": "Für {careers} konnten keine Prognosedaten erstellt werden.",
  "a7_void_info": "Wählen Sie mindestens einen Studiengang aus, um dessen Prognose zu sehen.",
  "a7_end_markdown": "---\n**Planung mit Zukunftsvision:**\nDiese Prognosen sind mit all ihren Einschränkungen ein wertvoller Beitrag für:\n*   Die Antizipation des Bedarfs an **Infrastruktur und Lehrpersonal**.\n*   Die Debatte über die **Zuweisung von Plätzen und Ressourcen** zwischen verschiedenen Bereichen und Studiengängen.\n*   Die Identifizierung von Bereichen, die möglicherweise **proaktive Strategien** erfordern, um negative Trends umzukehren oder ein nachhaltiges Wachstum zu steuern.\n*   Die Förderung eines informierten Dialogs über die **Zukunft des akademischen Angebots** in Kuba.",
  "B1_header_1": "🔬 Spielplatz: Detailliertes Studiengangprofil",
  "B1_markdown_1": "Tauchen Sie ein in die Details des von Ihnen gewählten Studiengangs. Entdecken Sie seine historische Entwicklung, seine Wachstumsrate und einen jährlichen Überblick über Universitäten und Geschlechterzusammensetzung.",
  "B1_selectbox_label_1": "Wählen Sie einen Studiengang aus, um sein Profil zu analysieren:",
  "b1_info_select_career": "Bitte wählen Sie einen Studiengang aus, um fortzufahren.",
  "B1_spinner_1_hist": "Erstelle historisches Profil für {career}...",
  "B1_subheader_1_hist": "Entwicklung und Wachstum von: {career}",
  "B1_markdown_1_rama": "Wissenschaftszweig",
  "B1_chart_title_evolution_stacked": "Entwicklung und Zusammensetzung der Einschreibungen: {career}",
  "B1_info_no_evolution_data": "Für diesen Studiengang sind keine Entwicklungsdaten verfügbar.",
  "B1_slider_label_cagr": "Wählen Sie den Jahresbereich für die CAGR-Berechnung:",
  "B1_subheader_2_snapshot": "Detaillierte jährliche Analyse",
  "B1_slider_label_snapshot": "Wählen Sie ein Jahr aus, um die Details anzuzeigen:",
  "B1_spinner_2_snapshot": "Lade Daten für das Jahr {year}...",
  "B1_pie_title_genero_yearly": "Geschlechterverteilung ({curso})",
  "B1_info_no_gender_data_pie": "Keine Geschlechterdaten für dieses Jahr.",
  "b1_bar_chart_title": "Einschreibungen nach Universität",
  "b1_info_no_universities_data_year": "In diesem Jahr hat keine Universität Einschreibungen registriert.",
  "b1_warning_no_data_for_year": "Für den Studiengang '{career}' im Jahr {year} wurden keine Daten gefunden.",
  "b2_header": "🗺️ Leitfaden der Institutionen: Erkunden Sie das akademische Angebot nach Standort",
  "b2_intro": "Entdecken Sie die Hochschuleinrichtungen in Kuba, filtern Sie nach Provinz und Gemeinde. Für jede Universität finden Sie allgemeine Informationen und das akademische Angebot nach Zweigen und Studiengängen für das von Ihnen ausgewählte Jahr.",
  "b2_error_no_institutions_data": "Die Daten der Institutionen sind nicht verfügbar. Dieser Abschnitt kann nicht angezeigt werden.",
  "b2_error_no_enrollment_data": "Die Einschreibungsdaten sind nicht verfügbar. Die Informationen zum Angebot werden begrenzt sein.",
  "b2_subheader_filters": "Suchfilter:",
  "b2_label_province": "Provinz:",
  "b2_label_municipality": "Gemeinde:",
  "b2_label_search_pattern": "Suche nach Name oder Kürzel der Institution (visueller Filter):",
  "b2_spinner_loading": "Lade Leitfaden der Institutionen...",
  "b2_warning_basic_analysis_failed": "Die Basisliste der Institutionen konnte nicht geladen werden. Status: {status}",
  "b2_info_showing_unis": "Zeige {shown} von {total} Institution(en) ({last_year}).",
  "b2_warning_no_years_for_detail": "Keine Einschreibungsjahre für Detailansicht verfügbar.",
  "b2_slider_year_detail": "Wählen Sie das Jahr aus, um das detaillierte akademische Angebot anzuzeigen:",
  "b2_info_no_unis_matched_filters": "Keine Institutionen gefunden, die den angewendeten Filtern entsprechen.",
  "b2_pie_title_gender_total": "Gesamtgeschlecht ({curso})",
  "b2_caption_no_gender_data_for_year": "Keine Geschlechterdaten für {curso} verfügbar.",
  "b2_markdown_academic_offering": "**Akademisches Angebot ({curso}, Zweige und Studiengänge mit Einschreibungen):**",
  "b2_info_no_branches_for_year": "Diese Institution hat keine aktiven Wissenschaftszweige oder Studiengänge mit gemeldeten Einschreibungen für {curso}.",
  "conclusion_header": "🏁 Schlussfolgerungen und Zukunftshorizonte: Die Universität von morgen gestalten",
  "conclusion_intro": "Wir sind durch ein Jahrzehnt von Daten gereist und haben das komplexe Ökosystem der Hochschulbildung in Kuba erkundet. Ob als Analyst oder als Entdecker, jedes freigeschaltete Diagramm und jede gemeisterte Herausforderung war ein Teil eines größeren Puzzles: die Geschichte von Tausenden von Bestrebungen, institutionellen Anstrengungen und der unermüdlichen Suche nach Wissen, die unsere Nation definiert.\n\nDiese Analyse ist kein Endpunkt, sondern ein Leuchtfeuer, das den zurückgelegten Weg erhellt und uns hilft, die vor uns liegenden Pfade zu erkennen.",
  "conclusion_success_message": "**Information ist Macht, und die Macht dieser Daten liegt in unserer Fähigkeit, sie in weises Handeln und strategische Vision umzuwandeln.**",
  "conclusion_findings_subheader": "🌟 Glanzlichter der Reise: Wichtigste Erkenntnisse",
  "conclusion_findings_text": "Wenn wir auf unsere Analyse zurückblicken, tauchen mehrere Leuchtfeuer auf, die unser Verständnis leiten:\n\n1.  **Der dynamische Puls der Nation:** Die nationalen universitären Einschreibungen haben eine bemerkenswerte Expansionsfähigkeit gezeigt und Anfang der 2020er Jahre signifikante Spitzen erreicht, gefolgt von einer jüngeren Anpassungsphase. Diese Schwankung erinnert uns an die Sensibilität des Systems gegenüber kontextuellen Faktoren und die Notwendigkeit einer flexiblen Planung. *(Ref. Sektion 1)*\n\n2.  **Das medizinische Herz und die pädagogische Seele:** Die **Medizinischen Wissenschaften** festigen sich als Rückgrat in Bezug auf das Studierendenvolumen, ein Zeugnis ihrer strategischen Bedeutung. Die **Pädagogischen Wissenschaften** ihrerseits haben eine außergewöhnliche Dynamik gezeigt, mit massivem Wachstum gefolgt von einer Kontraktion, was mögliche Veränderungen in der Nachfrage oder in der Lehrerausbildungspolitik widerspiegelt. *(Ref. Sektion 2)*\n\n3.  **Der Aufstieg neuer Berufungen:** Die Wachstumsanalyse (CAGR) hat den beeindruckenden Aufstieg von Studiengängen wie **Zahnmedizinische Dienstleistungen** und die Stärke mehrerer **Ingenieurwissenschaften** (Künstlerische Gestaltung, Agrarindustrielle Prozesse, Informatik) offenbart, was auf mögliche neue Grenzen von Interesse und Arbeitsmarktnachfrage hindeutet. *(Ref. Sektion 3)*\n\n4.  **Fortschritte und Herausforderungen bei der Geschlechtergerechtigkeit:** Obwohl Kuba eine hohe weibliche Beteiligung an der Hochschulbildung aufweist, mit vielen Zweigen und Studiengängen, die eine Mehrheit von Frauen zeigen, bleiben erhebliche Herausforderungen bestehen. Die Unterrepräsentation von Frauen in den **Technischen Wissenschaften** und **spezifischen Ingenieurstudiengängen** sowie in den **Sportwissenschaften** fordert uns auf, unsere Anstrengungen zu verdoppeln, um eine wirklich gerechte Landschaft zu schaffen. *(Ref. Sektion 4)*\n\n5.  **Der Reichtum der institutionellen Vielfalt:** Jede Universität bringt ihre einzigartige Nuance in das System ein. Wir haben von großen multidisziplinären Zentren bis hin zu Institutionen mit ausgeprägter Spezialisierung (wie den Medizinischen Universitäten) alles gesehen. Die Identifizierung von Studiengängen mit begrenztem Angebot unterstreicht die Bedeutung eines koordinierten und strategisch verteilten Universitätsnetzwerks. *(Ref. Sektion 5)*\n\n6.  **Ein vorsichtiger Blick in die Zukunft:** Die Prognosen, obwohl der der Zukunft innewohnenden Unsicherheit unterworfen, deuten auf eine mögliche Fortsetzung der Anpassungsphase bei den allgemeinen Einschreibungen und in mehreren Schlüsselzweigen und -studiengängen hin. Dies ist kein Omen, sondern eine Einladung zur Vorbereitung und proaktiven Handlung. *(Ref. Sektion 6)*\n\n7.  **Die Bedeutung der Details:** Die Analyse der \"Aufmerksamkeitsbereiche\" hat uns daran erinnert, dass die Gesundheit des Systems auch in der Vitalität jeder seiner Komponenten liegt, einschließlich aufstrebender Studiengänge, solcher mit geringer Einschreibung oder solcher, die ihren Zyklus möglicherweise abschließen. *(Ref. Sektion 7)*",
  "conclusion_player_summary_header": "🏆 Zusammenfassung Ihres Abenteuers als Entdecker",
  "metric_total_score": "Endpunktzahl",
  "metric_games_played": "Abgeschlossene Spiele",
  "metric_analyst_profile": "Analystenprofil",
  "profile_strategist": "Der Stratege",
  "profile_strategist_desc": "Ihre Stärke liegt im Klassifizieren und Ordnen. Sie sehen das große Ganze und setzen jedes Teil an seinen Platz.",
  "profile_competitor": "Der Wettkämpfer",
  "profile_competitor_desc": "Sie lieben Duelle. Vergleichen und den Gewinner wählen ist Ihre Spezialität.",
  "profile_visionary": "Der Visionär",
  "profile_visionary_desc": "Sie haben ein Talent dafür, Zahlen und Größenordnungen präzise zu schätzen.",
  "profile_prophet": "Der Prophet",
  "profile_prophet_desc": "Sie ahnen zukünftige Trends wie kein anderer. Ihre Kristallkugel funktioniert!",
  "profile_cartographer": "Der Kartograph",
  "profile_cartographer_desc": "Sie kennen das Gelände. Jede Institution auf der Karte zu verorten ist Ihr natürliches Talent.",
  "profile_detective": "Der Detektiv",
  "profile_detective_desc": "Niemand kann Sie täuschen. Sie sind ein Experte darin, das Element zu finden, das nicht passt.",
  "profile_scholar": "Der Gelehrte",
  "profile_scholar_desc": "Sie beantworten direkte Fragen mit Wissen und Sicherheit.",
  "profile_explorer": "Der Entdecker",
  "profile_explorer_desc": "Sie genießen die Reise und lernen aus jeder Herausforderung, indem Sie alle Bereiche abdecken.",
  "leaderboard_header": "Globale Entdecker-Rangliste",
  "leaderboard_intro": "Messen Sie sich mit anderen Analysten und hinterlassen Sie Ihre Spuren in der Rangliste. Werden Sie zu den Besten gehören?",
  "player_name_label": "Ihr Name für die Rangliste:",
  "submit_score_button": "🚀 Meine Punktzahl einreichen!",
  "enter_name_warning": "Bitte geben Sie einen Namen ein.",
  "score_submitted_info": "Ihre Punktzahl wurde bereits eingereicht! Vielen Dank für Ihre Teilnahme.",
  "loading_leaderboard_spinner": "Lade die Rangliste...",
  "leaderboard_col_timestamp": "Datum",
  "leaderboard_col_playername": "Spieler",
  "leaderboard_col_score": "Punktzahl",
  "leaderboard_empty_caption": "Die Rangliste ist leer. Seien Sie der Erste, der erscheint!",
  "leaderboard_connection_warning": "Verbindung zum Ranglistendienst konnte nicht hergestellt werden. Die Funktion ist derzeit nicht verfügbar.",
  "conclusion_recommendations_subheader": "🧭 Den Kurs festlegen: Strategische Empfehlungen",
  "conclusion_recommendations_text": "Mit diesen Erkenntnissen als Kompass schlagen wir folgende Handlungslinien für die Zentrale und alle Beteiligten der kubanischen Hochschulbildung vor:\n\n*   **Stärkung des Observatoriums für Hochschulbildung:**\n    *   **Maßnahme:** Dieses Datenanalysesystem als permanentes Werkzeug zur Überwachung von Trends, zur Evaluierung von Politiken und zur fundierten Entscheidungsfindung beibehalten und bereichern.\n    *   **Erwartete Auswirkung:** Größere Agilität und Reaktionsfähigkeit des Systems auf sich ändernde Dynamiken.\n\n*   **Förderung von Relevanz und Qualität mit Zukunftsvision:**\n    *   **Maßnahme:** Kontinuierliche prospektive Studien über die Bedürfnisse der sozioökonomischen Entwicklung des Landes und die Anforderungen des Arbeitsmarktes durchführen, um das akademische Angebot auszurichten. Die Lehrpläne von Studiengängen mit geringer Nachfrage oder rückläufigen Zahlen evaluieren und aktualisieren und in solche mit Wachstumspotenzial und strategischer Relevanz investieren.\n    *   **Erwartete Auswirkung:** Absolventen, die besser auf die Herausforderungen der Zukunft vorbereitet sind, und ein größerer Beitrag der Universität zur nationalen Entwicklung.\n\n*   **Förderung der Geschlechtergerechtigkeit in allen Disziplinen:**\n    *   **Maßnahme:** Spezifische und nachhaltige Programme zur Förderung der weiblichen Beteiligung an MINT-Studiengängen und anderen unterrepräsentierten Bereichen und umgekehrt entwerfen und umsetzen, indem Stereotypen bereits in frühen Bildungsphasen angegangen werden.\n    *   **Erwartete Auswirkung:** Ein inklusiveres Universitätssystem, das das Talent der gesamten Bevölkerung ohne geschlechtsspezifische Vorurteile nutzt.\n\n*   **Optimierung des Universitätsnetzwerks und Förderung der Zusammenarbeit:**\n    *   **Maßnahme:** Die Analysen zur Spezialisierung und Verteilung nutzen, um Entscheidungen über die Eröffnung, Fusion oder Schließung von Studiengängen an verschiedenen Institutionen zu treffen, wobei Effizienz, Qualität und eine gerechte territoriale Abdeckung angestrebt werden. Die Schaffung von Wissensnetzwerken und interuniversitären Programmen fördern.\n    *   **Erwartete Auswirkung:** Ein kohärenteres System mit gestärkten Exzellenzzentren und einer besseren Nutzung der verfügbaren Ressourcen.\n\n*   **Integration der Stimmen der Akteure:**\n    *   **Maßnahme:** Quantitative Analysen durch qualitative Forschung ergänzen, die die Wahrnehmungen und Erfahrungen von Studierenden, Lehrenden, Absolventen und Arbeitgebern erfasst.\n    *   **Erwartete Auswirkung:** Ganzheitlichere Entscheidungen und Politiken, die besser an die Realitäten und Erwartungen der universitären Gemeinschaft und der Gesellschaft angepasst sind.",
  "conclusion_final_header": "✨ Ein fortwährendes Erbe, eine strahlende Zukunft",
  "conclusion_final_paragraph": "Die Analyse dieser Daten ist nicht nur eine akademische Übung; sie ist ein Akt der Verantwortung und ein Bekenntnis zur Zukunft. Die kubanischen Universitäten, jede mit ihrer reichen Geschichte und ihrer transzendentalen Rolle in der Gesellschaft, stehen vor der Herausforderung und der Chance, sich weiterzuentwickeln, anzupassen und zu erneuern.\n\nWir hoffen, dass diese Daten alle dazu inspirieren, gemeinsam für eine Hochschulbildung zu arbeiten, die nicht nur auf die Bedürfnisse der Gegenwart reagiert, sondern aktiv eine wohlhabendere, gerechtere und wissensreichere Zukunft für alle jungen Kubaner gestaltet."
}