{
  "settings_title": "Settings",
  "save": "Save",
  "load_df_error": "Critical Error: Could not load data ('db.parquet'). The application cannot continue.",
  "load_screen_title": "🎓 Strategic Analysis of University Enrollment in Cuba",
  "main_image_caption": "University of Havana. A symbol of higher education in Cuba.",
  "main_markdown_1": "A journey to illuminate the path of Higher Education.",
  "sidebar_title": "🧭 Section Explorer",
  "sidebar_radio_title_main": "Choose a section:",
  "sidebar_radio_title_sub_prefix": "Subsection: ",
  "sidebar_info": "Analysis based on enrollment data from the 2015-16 to 2024-25 period.\n\n -- ⚠️ Does not include the 2018-2019 academic year due to a lack of data; analyses are performed omitting this year.",
  "subseccion_not_valid_in": "Invalid subsection in ",
  "back": "Previous: ",
  "next": "Next: ",
  "authors": "Authors:",
  "author_reynier": "Reynier Ramos González",
  "author_ernesto": "Ernesto Herrera García",
  "lang_select_label": "Language / Idioma",
  "lang_select_help": "Select your preferred language for the application.",
  "_women": "Women",
  "_men": "Men",
  "_total_enrollment": "Total Enrollment",
  "_total_enrollment_projected": "Total Enrollment (Projected)",
  "_total_enrollment_historical": "Total Enrollment (Historical)",
  "_projection_start": "Projection Start",
  "_academic_year": "Academic Year",
  "_enrollment": "Enrollment",
  "_legend": "Legend",
  "_projected_short": "Proj.",
  "_50_parity": "50% Parity",
  "_university": "University",
  "_date": "Data",
  "_career": "Career",
  "_offers": "offers",
  "_elements": "elements",
  "_number_of_students": "Number of Students",
  "_all_provinces": "ALL PROVINCES",
  "_all_municipalities": "ALL MUNICIPALITIES",
  "_founded_in": "Founded in",
  "_organism": "Organism",
  "_address": "Address",
  "_main_modality": "Main Modality",
  "generic_warn_figs": "Could not generate the national overview chart (A1).",
  "ask_ai_component": {
    "ai_initial_response_text": "🤖 Questions about this analysis? Ask the AI Assistant!",
    "restart_conversation": "Restart this conversation",
    "your_question_here": "Type your question here...",
    "thinking": "Processing your request...",
    "code_download": "📥 Download Code",
    "generated_image": "Generated Image",
    "error_parsing_table": "Error parsing table"
  },
  "gamification_controller": {
    "confirm_deactivation_title": "Confirm Deactivation",
    "confirm_deactivation_warning": "Are you sure you want to deactivate Game Mode?",
    "confirm_deactivation_text": "You will stop seeing the interactive minigames and will lose your current progress.",
    "confirm_button": "Confirm",
    "cancel_button": "Cancel",
    "game_mode_label": "**Game Mode**",
    "toggle_help": "Activates/deactivates the interactive minigames.",
    "progress_header": "🏆 Your Progress",
    "reset_progress_button": "Reset Progress",
    "points_metric_label": "Points",
    "games_metric_label": "Games",
    "history_expander_label": "View Game History",
    "history_empty": "You haven't played yet. Go for it!",
    "history_item_text": "{icon} **{game_title}**: *+{points_earned} pts*",
    "round": "Round",
    "detailed_analysis_revealed": "Detailed Analysis:",
    "feedback_victory": "Victory! You've passed the challenge with **{total_score}** points.",
    "feedback_defeat": "Almost! You got **{total_score}** points. Try again!",
    "feedback_game_over_text": "You have earned a total of **{total_score}** points.",
    "see_round_summary": "See detailed round summary",
    "submit_button_label": "Check!",
    "please_pick_an_action": "Please perform an action before checking.",
    "SimpleQuestionMinigame": {
      "minigame_prefix": "Minigame:",
      "choose_your_answer": "Choose your answer:"
    },
    "DataDuelMinigame": {
      "data_duel_title": "Data Duel",
      "duel_question": "Which one has a higher value?"
    },
    "ClassifierMinigame": {
      "classifier_title": "The Classifier",
      "classifier_drag_info": "💡 Drag the items to sort them from highest to lowest."
    },
    "OracleMinigame": {
      "oracle_title": "The Oracle",
      "oracle_question": "Observe the evolution and predict the trend."
    },
    "EstimatorMinigame": {
      "estimator_title": "The Estimator",
      "estimator_instructions": "Use the slider to estimate the value. The closer, the more points!",
      "estimator_question": "What is the value for **{item_name}**?",
      "_your_estimation": "Your estimation",
      "estimator_result_shower": "**Result for '{item_name}' (Round {round_num})**",
      "_real_value": "Real Value",
      "estimator_claim_victory": "Excellent estimation! You got **{score}** points.",
      "estimator_good_try": "Good try! You got **{score}** points."
    },
    "GeoGuesserMinigame": {
      "geoguesser_title": "GeoGuesser",
      "geoguesser_instructions": "Select the correct province for the following institution.",
      "_where_is_it": "Where is it located?"
    },
    "ImpostorMinigame": {
      "impostor_title": "Find the Impostor",
      "impostor_instructions": "Three of these items belong to the same group. Which is the impostor?"
    }
  },
  "introduction_header": "🎯 Welcome to the Heart of Cuban Higher Education",
  "introduction_markdown_1": "A university is not just a building; it is a crucible of dreams, an engine of progress, and a reflection of a society's aspirations. In this space, we will embark on an analytical journey, exploring the currents that shape university enrollment in Cuba.\n\nFrom general trends to the details of each career and university, we will unravel the hidden stories behind the country's different universities. The goal? To provide an evidence-based compass for strategic decision-making, fostering a stronger, more equitable higher education system aligned with the nation's future.",
  "intro_choose_your_path_header": "🛣️ Choose Your Path: How Do You Want to Explore?",
  "intro_choose_your_path_text": "This journey through the data can take two routes. Choose the one that best suits your style.",
  "intro_analyst_path_title": "👨‍🏫 The Analyst's Route",
  "intro_analyst_path_desc": "Ideal if you're looking to get straight to the point. Access all charts and analyses directly, without interruptions. Perfect for a quick and focused exploration.",
  "intro_analyst_path_button": "Activate Analysis Mode",
  "intro_explorer_path_title": "🎮 The Explorer's Path",
  "intro_explorer_path_desc": "Turn the analysis into a challenge. In each section, you will face minigames to test your intuition about the data before seeing it. Earn points and compete!",
  "intro_explorer_path_button": "Activate Game Mode",
  "intro_game_mode_active_info": "🕹️ **Game Mode Activated!** Get ready for the challenges. You can see your progress by pressing the '🏆' button that appears in the bottom right corner.",
  "intro_analysis_mode_active_info": "📊 **Analysis Mode Activated.** You are ready for a direct exploration of the data. You can switch modes at any time in the sidebar.",
  "introduction_sucess": "Your journey begins here! Select a section from the side menu or use the 'Next' button.",
  "A1_header": "🌍 The National Pulse: How is University Enrollment Beating?",
  "A1_markdown_1": "Imagine we can take the pulse of the entire Cuban university system over a decade. What has its rhythm been like? Has it experienced moments of vigorous growth, periods of stability, or perhaps phases where the beat has become more subdued?\n\nThis first section offers us a panoramic view of the total national enrollment, allowing us to identify the major trends that have marked the higher education system in recent years. It is our starting point for understanding the general context before diving into more specific analyses.",
  "A1_spinner_1": "Building chart A1, please wait...",
  "A1_chart_title_historical": "National Enrollment: Historical Evolution",
  "A1_fig_1_subheader": "Deciphering the Rhythm of the Decade (2015-2025):",
  "A1_fig_1_markdown_1": "Observing the trajectory of the total national enrollment in the chart above, we can identify several key phases:\n\n*   **Initial Boost (2015-16 to 2016-17):** The journey begins in the 2015-2016 academic year with a figure of around **165,000 students**. The following year shows a slight increase, establishing a solid foundation for the growth to come.\n\n*   **Sustained Growth to the Peak (2017-18 to 2020-21):** Starting from the 2017-18 academic year, and despite the lack of data for 2018-19, the upward trend resumes strongly until it reaches its **highest point in the 2020-2021 academic year, exceeding 285,000 students**. This period represents the phase of greatest enrollment expansion in the decade.\n\n*   **Plateau and Start of Decline (2021-22 to 2022-23):** The 2021-2022 academic year shows a slight contraction from the peak, marking the beginning of a new phase. Enrollment remains high but no longer grows, and by 2022-23, the decline becomes more evident.\n\n*   **Recent Adjustment (2023-24 to 2024-25):** The last two recorded academic years show a **continuation of the downward trend**, with total enrollment standing at around **205,000 students** in the most recent period. This suggests a readjustment of the system after the expansion peak.",
  "A1_ai_context": "The current analysis is about the evolution of total national enrollment, male and female, in Cuba from 2015 to 2025. The data, presented in the chart, shows a significant peak around 2020-2021 followed by a decline.",
  "A1_peak_enrollment_label": "National Enrollment in the Peak Year ({curso})",
  "A1_game_subheader": "To the Test: The Magnitude of the Peak",
  "A1_game_intro": "The Cuban university system reached a maximum number of students at one point in the last decade. Before seeing the chart, how good is your intuition? Try to estimate what that maximum figure was.",
  "A1_game_title": "The National Peak Estimator",
  "A1_estimator_question": "How many students do you think there were in the entire country during the academic year with the highest enrollment ({curso})?",
  "A2_header": "📚 A Mosaic of Knowledge: Where Are Future Professionals Leaning?",
  "A2_markdown_1": "The university is a vast garden where diverse disciplines flourish. Each branch of knowledge, from Medical Sciences or Mathematics to the Arts, represents a unique path of training and contribution to society. In this section, we break down the total enrollment to see how students are distributed among these major areas, aiming to answer questions like:\n- Are there clear protagonists?\n- How has student interest danced over the last decade?",
  "A2_fig_a2_abs_subheader": "The Strength of Each Branch: Historical Evolution of Enrollment",
  "A2_spinner_1": "Analyzing the evolution of the branches of science...",
  "A2_chart_title_evolution": "Historical Evolution by Branch",
  "A2_yaxis_title_enrollment_branch": "Enrollment in Branch of Science",
  "A2_legend_title_branch": "Branch of Science",
  "A2_fig_a2_abs_markdown_1": "**Each Line, a Stream of Knowledge:**\nThis chart traces the journey of absolute enrollment (total number of students) for each branch of science over the years.\n\n*   **Outstanding Leadership:** **Medical Sciences** (teal line) stand out as the branch with the largest enrollment consistently throughout the period, starting from about 70,000 students in 2015-16, reaching an impressive peak of nearly **95,000 students in 2020-2021**, and although experiencing a subsequent decline, they remain the main force, closing in 2024-2025 with over 70,000 students.\n\n*   **Pursuit and Dynamism:** **Pedagogical Sciences** (orange line) show a very dynamic trajectory. They start with significant enrollment (around 30,000), experience remarkable growth to exceed **65,000 students in 2020-2021 and 2021-2022**, becoming the second-largest branch during those years. However, they suffer a sharp decline in recent years, finishing near 40,000 students.\n\n*   **Consistent Intermediate Block:** A group of branches maintains a stable presence, albeit with fluctuations:\n    *   **Technical Sciences** (pink line) and **Social and Humanistic Sciences** (light blue line) show parallel trajectories, growing from approximately 20,000 students to a peak of around **30,000-32,000** between 2020-21 and 2021-22, then declining to around 23,000-25,000 students at the end of the period.\n    *   **Economic Sciences** (red line) show more moderate but constant growth until 2021-22 (reaching about 24,000 students), followed by a decline similar to other branches, ending near 15,000.\n    *   **Agricultural Sciences** (dark blue line) and **Physical Culture and Sports Sciences** (dark green/brown line) remain in a lower range, generally between 5,000 and 15,000 students, with peaks around 2020-2021 and subsequent declines.\n\n*   **Specialized Niche:** **Natural and Mathematical Sciences** (purple line) and **Arts Sciences** (violet line) represent the branches with the lowest enrollment volume, consistently staying below 5,000 students throughout the decade. This suggests high specialization or a more limited demand.",
  "A2_fig_a2_pct_subheader": "The Academic Pie Chart: Historical Percentage Distribution",
  "A2_chart_title_distribution": "Historical Percentage Distribution of Enrollment by Branch of Science",
  "A2_yaxis_label_percentage": "% Enrollment",
  "A2_fig_a2_pct_markdown_1": "**Proportions on the University Canvas:**\nThis stacked area chart shows us what \"slice of the pie\" each branch of science has represented within the total university enrollment in each academic year.\n\n*   **Persistent Dominance of Medical Sciences:** The wide teal band at the top confirms that Medical Sciences have consistently represented the largest proportion of students, occupying nearly **40-50% of the total** at its peak (around 2016-17 and again towards 2024-2025, after a slight percentage reduction in the middle of the period).\n\n*   **Rise and Fall of Pedagogical Sciences:** The orange band of Pedagogical Sciences shows an interesting change in its relative weight. It starts as a significant portion, expands significantly to represent the second-largest proportion (reaching almost **25-30%** of the total around 2019-2021), but then reduces its percentage share in recent years.\n\n*   **Relative Stability in the Middle:** Technical Sciences (brown/ochre band), Social and Humanistic Sciences (light blue band), and Economic Sciences (dark blue band) maintain more stable proportions over time, though with slight variations. Together, they usually make up a significant portion of the student body. For example, Social and Humanistic Sciences seem to consistently occupy around 10-15%.\n\n*   **Lower Percentage Weight:** The other branches (Agricultural, Physical Culture, Natural and Mathematical, Arts) individually represent smaller percentages of the total enrollment, which is consistent with their lower absolute student volume.\n\nThis percentage analysis is crucial because it allows us to understand not only how many students are in each branch, but also how interest or admission capacity is distributed in relation to the entire university system.",
  "A2_subhead_popularity": "Popularity Ranking: Which fields of knowledge lead?",
  "A2_intro_game1": "Before diving into the charts, let's test your perception. Across Cuba, thousands of students choose their professional path each year. Which branches of knowledge do you think attract the most university students? Could you rank the main areas according to their popularity?",
  "A2_game_title": "The Knowledge Classifier",
  "A2_subheader_2": "🔗 Interconnections in Growth: How Do the Branches Relate?",
  "A2_markdown_2": "Not all branches of science grow or decline in isolation. Some may show similar enrollment trends over time, while others may have more independent dynamics. The following heatmap visualizes the **correlation of the annual percentage change in enrollment** between the different branches of science.\n\n*   A **value close to 1 (dark blue/deep purple)** indicates a strong positive correlation: when one branch grows, the other tends to grow as well in the same period.\n*   A **value close to -1 (not visible in this example, it would be the other end of the color scale)** would indicate a strong negative correlation: when one grows, the other tends to decline.\n*   A **value close to 0 (lighter/neutral colors)** suggests little or no linear relationship in their annual growth patterns.",
  "A2_corr_title": "Correlation Matrix of Annual Growth between Branches of Science",
  "A2_corr_legend": "Corr. Coefficient",
  "A2_fig_corr_expander": "🔍 Detailed Analysis of Observed Correlations",
  "A2_fig_corr_markdown_1": "**Key Observations from the Correlation Map:**\n\n*   **Strong Synchronization:** A **high positive correlation (values > 0.9)** is observed in the annual growth trends between:\n    *   **Agricultural Sciences and Economic Sciences** (approx. 0.98)\n    *   **Agricultural Sciences and Pedagogical Sciences** (approx. 0.98)\n    *   **Agricultural Sciences and Physical Culture and Sports Sciences** (approx. 0.96)\n    *   As well as between **Economic, Pedagogical, and Physical Culture Sciences**, all showing very high coefficients among themselves.\n    This suggests that these branches often experience growth (or contraction) boosts very similarly and simultaneously, possibly due to macroeconomic factors, comprehensive educational policies, or student demand cycles that affect them jointly.\n\n*   **Moderate Positive Correlations:**\n    *   **Medical Sciences** show a moderate positive correlation (generally between 0.5 and 0.7) with several other branches like Economic, Social and Humanistic, and Technical Sciences. This could indicate that the medical sector, while having its own dynamics, also benefits from or participates in broader expansionary trends in higher education.\n    *   **Technical Sciences** also correlate moderately with most other branches, suggesting a connection with the overall system cycle.\n\n*   **Noteworthy Relative Independence:**\n    *   **Natural and Mathematical Sciences** stand out for having the **lowest correlations** with almost all other branches (coefficients often between 0.2 and 0.4). This indicates that their enrollment growth pattern seems to be quite independent of the fluctuations affecting other large areas of knowledge. This branch could be influenced by very specific factors, such as particular scientific promotion programs or a more specialized and less sensitive demand to general trends.\n    *   **Arts Sciences** also show weaker correlations with some of the larger branches like Pedagogical Sciences, although it has an interesting moderate correlation with Medical Sciences.\n\n*   **Strategic Implications:**\n    *   The strong synchronization between certain branches suggests that planning and resource allocation strategies could consider these behavioral \"clusters\".\n    *   The independence of Natural and Mathematical Sciences might require a differentiated approach and monitoring to ensure their vitality and alignment with the country's scientific-technical development needs.\n    *   The absence of strongly negative correlations (in this chart) suggests that, at the aggregate level of annual change, there is no evident \"cannibalization\" where the growth of one branch is directly at the expense of another, although competitive dynamics at more specific levels are not ruled out.",
  "A2_corr_warn_1": "Could not generate the correlation map between branches.",
  "A2_subhead_correlation": "Hidden Synergies: Which branches grow together?",
  "A2_intro_game2": "The branches of knowledge are not islands. Their growth trends are often connected. Some move in perfect sync, while others dance to their own rhythm. When interest in Pedagogical Sciences grows, which other area do you think benefits from a similar boost? Accept the duel and find out!",
  "A2_game_title_corr": "Synergy Duel",
  "A2_duel_question_corr": "The growth of **Pedagogical Sciences** is MOST similar to:",
  "A3_header": "🔍 Careers Under the Magnifying Glass: Popularity, Trends, and Dynamism",
  "A3_markdown_1": "After exploring the major branches of knowledge, it's time to focus our lens on the fundamental units: university careers. Which ones capture the most student interest? How has their individual evolution been? And, very importantly, which ones show accelerated growth and which seem to be losing momentum?",
  "A3_subheader_2": "🏆 The Career Podium: Which Ones Lead in Current Enrollment?",
  "A3_spinner_1": "Analyzing the ranking and evolution of top careers...",
  "A3_warning_analysis_failed": "Could not perform career popularity analysis. Status: {status}",
  "A3_markdown_2": "On the left, we see the ranking of all careers according to their total enrollment in the most recent academic year ({year_range}). On the right, we see the historical evolution of enrollment for the {top_n} careers that are currently at the top of this ranking.",
  "A3_chart_title_evolution": "Historical Evolution (Top {n} Current Careers)",
  "A3_chart_yaxis_enrollment": "Total Enrollment in Career",
  "A3_col_evo_top_info": "No evolution chart was generated for the current top careers.",
  "A3_markdown_3": "**Key Points from the Podium:**\n*   **Undisputed Leadership:** **Medicine** is firmly positioned as the career with the highest enrollment (35,889 students), a constant we had already glimpsed when analyzing the branches of knowledge.\n*   **Significant Forces:** It is followed by **Physical Culture** (14,695) and **Primary Education** (12,867), demonstrating considerable demand in these areas.\n*   **Robust Top 5:** **Nursing** (9,999) and **Accounting and Finance** (9,883) complete the top 5, both with enrollment very close to 10,000 students.\n*   **Evolution of the Leaders:** The chart on the right allows us to see how these careers (and others in the top 10) have reached their current position. Notice how some have had more sustained growth, while others show more pronounced peaks and valleys.",
  "A3_game1_subheader": "To the Test: The Popularity Ranking",
  "A3_game1_intro": "Before seeing the full ranking, how good is your intuition about student demand? We present a selection of careers. Sort them from most popular to least popular according to the last year's enrollment!",
  "A3_game1_title": "The Career Classifier",
  "A3_subheader_4": "🚀 The Pace of Change: Which Careers Are Taking Off or Landing?",
  "A3_markdown_4": "The **Compound Annual Growth Rate (CAGR)** offers us a perspective on dynamism. It calculates the average annual percentage growth (or decline) of a career's enrollment, considering the entire analyzed period. A high CAGR suggests rapid expansion.",
  "A3_spinner_4": "Calculating the dynamism of careers (CAGR)...",
  "A3_warning_cagr_failed": "Could not perform growth analysis (CAGR). Status: {status}",
  "A3_chart_title_cagr_top": "Top 15 by Highest Average Annual Growth {periodo}",
  "A3_chart_title_cagr_bottom": "Top 15 by Highest Average Annual Decline {periodo}",
  "A3_cagr_top_title": "📈 Top 15 with Highest Growth",
  "A3_col_cagr_top_markdown_2": "These careers have experienced the most notable expansion in their average annual enrollment.\n*   **Surprising Takeoff:** **Dental Services** leads with a CAGR of over 100%, indicating a doubling (or more) of its average enrollment year after year.\n*   **Booming Engineering:** Several engineering fields like **Artistic**, **Agro-industrial Processes**, and **Computer Science** show very healthy growth.\n*   **Education with Momentum:** Education branches like **Preschool**, **Agricultural**, and **Primary** also feature with a positive and significant CAGR.",
  "A3_cagr_bottom_title": "📉 Top 15 with Highest Decline",
  "A3_col_cagr_bottom_markdown_2": "At the other end, these careers have seen their average annual enrollment decrease or grow at a much slower rate.\n*   **Notable Adjustments:** **Sociocultural Studies** and **Stomatology** (not to be confused with Dental Services) show the largest average declines.\n*   **Diverse Challenges:** Careers like **Agricultural Engineering**, **Visual Arts**, **Mathematics**, **Music**, and several **Engineering** fields (Hydraulic, Civil, Telecommunications, Industrial) also appear on this list, suggesting a review of their trends.",
  "A3_markdown_5": "**Strategic Reflections from these Rhythms:**\n*   A **high CAGR** does not always mean a massive total enrollment (it could be a small career growing fast), but it does indicate a **strong positive trend** that deserves attention, whether to encourage or to secure resources.\n*   A **low or negative CAGR** in important careers could be a signal to investigate the causes: changes in the labor market, student preferences, academic offerings?\n*   It is crucial to cross-reference this CAGR information with the absolute enrollment (from the ranking) to get a complete picture.",
  "A3_game2_subheader": "Growth Duel",
  "A3_game2_intro": "Some careers grow at a breakneck pace while others contract. Can you identify which of the two options has had a higher average annual growth rate? Accept the duel!",
  "A3_game2_title": "Growth Duel",
  "A3_duel_question": "This career had a **HIGHER** average growth than the other.",
  "A4_header": "♀️♂️ Balancing the Scales: A Look at the Gender Perspective",
  "A4_markdown_1": "The university not only trains professionals but also shapes a more just and equitable society. In this section, we delve into the gender composition of university enrollment. Is there a balance between men and women in the classrooms? Are there areas of knowledge traditionally associated with one gender that maintain those patterns, or are we witnessing a transformation towards greater parity? Join us to find out.",
  "A4_spinner_1": "Analyzing the gender perspective...",
  "A4_warning_analysis_failed": "Could not perform gender analysis. Status: {status}",
  "A4_fig_ramas_subheader": "Female Participation by Branch of Science ({curso})",
  "A4_chart_title_branches": "Percentage of Women by Branch of Science ({curso})",
  "A4_chart_yaxis_women_pct": "% Women",
  "A4_fig_ramas_markdown_1": "**The Big Picture by Field of Knowledge:**\nThis bar chart shows us the percentage of women enrolled in each major branch of science. The dashed red line at 50% represents perfect parity.\n\n*   **Pronounced Female Leadership:** **Pedagogical Sciences** stand out with over **80%** female enrollment, closely followed by **Social and Humanistic Sciences** and **Medical Sciences**, both exceeding **70%**. This indicates a strong female presence and preference in these important areas.\n*   **Sustained Female Majority:** **Economic Sciences**, **Arts Sciences**, and **Natural and Mathematical Sciences** also show a majority of women, with percentages ranging from **55% to 65%**, placing them above the parity line.\n*   **Near Parity or Slight Male Majority:** **Agricultural Sciences** are closer to balance, though still with a slight female majority (almost 50%).\n*   **Challenges in Technical and Sports Areas:** In contrast, **Technical Sciences** (approximately 35% women) and, more markedly, **Physical Culture and Sports Sciences** (around 32% women) are the branches with the lowest female representation, indicating a persistent gender gap in these fields.",
  "A4_info_no_branch_data": "No gender data by branch is available to display.",
  "A4_fig_carreras_subheader": "Zooming into Careers: Extremes of the Gender Spectrum ({curso}, Enrollment >= 30)",
  "A4_legend_major_women": "Majority Women",
  "A4_legend_minor_women": "Minority Women",
  "A4_chart_title_careers_gender": "Gender Imbalance in Careers ({curso}, Enrollment >= 30)",
  "A4_subplot_title_top_women": "Top 10 Careers with Highest % of Women",
  "A4_subplot_title_low_women": "Top 10 Careers with Lowest % of Women",
  "A4_fig_carreras_markdown_1": "**Prominent Cases of Female Majority and Minority:**\nThese charts take us to the career detail, showing the 10 with the highest percentage of women and the 10 with the lowest percentage (i.e., highest male presence), provided they have an enrollment of at least 30 students to ensure representativeness.\n\n*   **Extreme Feminization in Some Areas:** Careers like **Preschool Education** are close to 100% female enrollment. Others, such as **Higher Technician in Speech-Language Pathology and Audiology**, **Speech Therapy Education**, and **Spanish-Literature Education**, also show an overwhelming majority of women, exceeding 90%. This is consistent with the high feminization of Pedagogical Sciences. **Dental Services** and **Sociocultural Studies** also stand out in this group.\n\n*   **Male Dominance in Engineering and Technical Areas:** At the other extreme, careers like **Computer Engineering**, **Automation Engineering**, **Computer Science**, **Investment Process Management**, and several **Mechanical, Electrical Engineering and Higher Technicians in Sports Training** have very low percentages of women, some below 10% and most below 25%. This reflects the gap observed in Technical and Sports Sciences at the branch level.\n\n*   **Important Nuances:** It is crucial to note that even within the \"Top 10 with Lowest % of Women\", the percentages vary. While some engineering fields barely exceed 5-10% female presence, others may be closer to 20-25%.",
  "A4_info_no_career_data": "Not enough career data to show the gender extremes analysis.",
  "A4_markdown_2": "---\n**Reflections for Action:**\n*   The high feminization in certain branches and careers is a consolidated phenomenon. While it reflects vocations, it is also important to ensure that there are no implicit barriers or disincentives for male participation in them.\n*   The greatest challenge for gender equity is clearly in the **Technical Sciences** and in several specific engineering fields, as well as in **Physical Culture and Sports Sciences**. Continued and effective strategies are required to attract and retain more women in these crucial fields for technological and social development.\n*   This data is an invitation to delve deeper: What are the causes of these imbalances? How can we inspire new generations to explore all areas of knowledge without gender bias?",
  "A4_game1_subheader": "Gender Duel by Branch",
  "A4_game1_intro": "Some fields of knowledge attract more women than others. Could you tell which of the following branches has a higher percentage of female enrollment?",
  "A4_game1_title": "Branch Duel",
  "A4_duel_question": "Which branch has a HIGHER percentage of women?",
  "A4_game2_subheader": "Wait! There's an impostor among the careers!",
  "A4_game2_intro": "Three of the following careers have an overwhelming majority of women in their classrooms. One, however, is a predominantly male field. Identify the impostor!",
  "A4_game2_title": "The Gender Impostor",
  "A5_header": "🏛️ Universities in Perspective: Discovering Strengths and Areas of Specialization",
  "A5_markdown_1": "Each university is a unique ecosystem with its own history, vocation, and areas of excellence. In this section, we shift our perspective to analyze how student talent is distributed at the institutional level. Which universities concentrate the largest number of students? Are there centers highly specialized in certain branches or careers? And which careers are rare jewels, offered only by a few institutions?",
  "A5_spinner_1": "Analyzing institutional distribution of enrollment...",
  "A5_warning_analysis_failed": "Could not perform institutional analysis. Status: {status}",
  "A5_fig_treemap_subheader": "Interactive Map of University Enrollment ({curso})",
  "A5_treemap_root_label": "All Universities",
  "A5_treemap_title": "Enrollment Distribution ({curso})",
  "A5_fig_treemap_markdown_1": "**Navigating the Institutional Universe:**\nThis \"treemap\" is a visual representation of total enrollment.\n*   **Size Matters:** The area of each rectangle is proportional to the number of students. It starts with \"All Universities\"; click on a university (e.g., `UCLV`, `UH`, `CUJAE`) to see how its enrollment breaks down by branches of science. Another click on a branch will show you the careers within it and their weight in that institution.\n*   **Identify the Giants:** At a glance, you can identify the universities with the largest student volume. For example, **UO (University of Oriente)**, **UH (University of Havana)**, and **UCMLH (University of Medical Sciences of Havana)**, among others, show considerably large rectangles, indicating significant enrollment.\n*   **Areas of Specialization:** Notice how some universities have almost all their \"area\" concentrated in one or two branches (e.g., the Universities of Medical Sciences predominantly in \"Medical Sciences\"), while others show greater diversification. As observed, Medical Sciences stands out in all universities that offer it.",
  "A5_info_no_treemap_data": "No data available to generate the interactive map.",
  "A5_df_carreras_unicas_subheader": "Academic Jewels: Careers by Level of Exclusivity",
  "A5_df_carreras_unicas_markdown_new": "This chart groups careers by the number of universities that offer them in the {curso} academic year. Each dot represents a career. Hover over a dot to see its name. The annotations at the top indicate how many careers exist in each exclusivity group.",
  "A5_chart_title_grouped_offer": "Distribution of Careers by Exclusivity of Offering",
  "A5_chart_yaxis_num_unis": "No. of Universities Offering It",
  "_carrers": "careers",
  "A5_expander_show_all_data": "View the full table with all careers",
  "A5_info_no_limited_offer_data": "No data found on careers with limited offerings.",
  "A5_game1_subheader": "University GeoGuesser",
  "A5_game1_intro": "Before analyzing the universities in detail, do you know their location? Prove it!",
  "A5_game1_title": "Guess the Province",
  "A5_game2_subheader": "Guess the Exclusivity",
  "A5_game2_intro": "Some careers are taught throughout the country, while others are true rarities. How exclusive do you think the following career is?",
  "A5_game2_title": "The Exclusivity Estimator",
  "A5_subheader_2": "Focus on Key Careers: Who's Who in Specific Training?",
  "A5_markdown_2": "Select up to 3 careers of interest. The chart will show the historical evolution of enrollment for those careers, broken down by each university that offers them. This allows us to compare the weight and trajectory of different institutions in training professionals in specific fields.\n\n*If the chart seems too dense, try selecting fewer careers or focus on the general trends of the largest universities for each career.*",
  "A5_multiselect_carreras": "Careers to compare evolutions by university:",
  "A5_spinner_2": "Generating comparative chart by university...",
  "A5_chart_title_uni_comparison": "Evolution by University for: {careers}",
  "A5_chart_yaxis_enrollment": "Total Enrollment",
  "A5_warning_comparison_failed": "Could not generate the comparative chart. Cause: {status}",
  "A5_no_carreras_selected": "Please choose at least one career to see the comparison.",
  "A5_markdown_3": "---\n**Strategic Visions for the University Network:**\n*   **Enhance Excellence:** Identifying leading universities in key careers can guide investment to turn them into national or international reference centers.\n*   **Optimize Resources:** The treemap and the analysis of unique offerings can reveal unnecessary duplications or, conversely, the need to expand the offering of certain careers in more regions.\n*   **Inter-institutional Collaboration:** Knowing the strengths of each can foster synergies, joint programs, and student and faculty mobility.",
  "A6_header_1": "🔭 Looking to Tomorrow: What Could We Expect? (Future Projections)",
  "A6_markdown_1": "Anticipating the future is a challenge, but analyzing recent trends allows us to map out possible scenarios. In this section, we will re-examine our key enrollment indicators, but this time extending our gaze two academic years forward through projections.\n\n⚠️ **A Compass, Not an Oracle:** It is crucial to remember that these are **projections**, not infallible predictions. They are based on simple **Linear Regression models applied to the last 6 years of historical data** (or less, if data is insufficient for a specific branch or career). Multiple factors not considered in these models (policy changes, economic crises, new social demands, etc.) could significantly alter these trajectories. Let's use them as a tool for strategic reflection and proactive planning, not as a destiny written in stone.",
  "A6_chart_title_projection": "Evolution and Projection (Lin. Reg. last {n_years} years)",
  "A6_chart_title_branches_projection": "Evolution and Projection by Branch (Lin. Reg. last {n_years} years or less)",
  "A6_subheader_1": "National Horizon: Total Enrollment Projection",
  "A6_spinner_1": "Calculating national enrollment projection...",
  "A6_info_1": "The dashed lines and diamond-shaped points beyond the 2024-2025 academic year represent the projections.",
  "A6_markdown_national_explanation": "**Interpreting the Projected National Trend:**\n\nThe chart above combines the historical evolution of enrollment (bars and solid line up to the 2024-25 academic year) with a projection for the next two academic years (dashed line with diamonds).\n\n*   **Starting Point:** The projection begins from the last recorded historical data, which shows a national enrollment of approximately **205,000 students**.\n*   **Projected Trajectory:** The linear regression model, based on the trend of the last few years, suggests a **continuation of the adjustment or moderate decline phase** observed in the most recent period.\n*   **Future Estimates:**\n    *   For the **2025-2026** academic year, the model estimates an enrollment that could be in the range of **195,000 to 215,000 students**.\n    *   Towards **2026-2027**, this figure could drop to around **185,000 to 190,000 students**.\n*   **Strategic Implication:** If this trend materializes, it raises important questions for planning: How would this affect the installed capacity in universities? Would it require a reassessment of resource allocation or new strategies for student recruitment and retention at the national level?",
  "A6_warning_national_proj_failed": "Could not generate the national projection. Status: {status}",
  "A6_fig_A2_subheader": "Knowledge of Tomorrow: Projection by Branch of Science",
  "A6_fig_A2_spinner": "Calculating projection by branch of science...",
  "A6_warning_branches_proj_failed": "Could not generate the projection by branch.",
  "A6_fig_A7_subheader_1": "Key Careers on the Horizon: Interactive Projection",
  "A6_fig_A7_markdown_1": "Select up to 3 careers of interest to visualize their individual enrollment projection.",
  "A6_fig_A7_multiselect_1": "Select careers to project:",
  "A6_fig_A7_spinner_1": "Calculating projection for the selected careers...",
  "A6_game_subheader": "🔮 The Enrollment Oracle",
  "A6_game_intro": "Before revealing the model's projections, let's test your intuition as an analyst. Observe the historical trajectory of national enrollment. Based on this trend, what do you think happened in the last recorded year? Did the trend continue, stabilize, or reverse?",
  "A6_game_item_name": "National Enrollment",
  "A6_game_title": "Predict the National Trend",
  "A7_header_1": "💡 Areas of Attention: Specific Challenges and Opportunities",
  "A7_markdown_1": "Beyond the major trends, there are particular situations in careers and universities that deserve a special look. Some careers may be emerging vigorously, others might have concluded their offering cycle, and a third group may be struggling to attract a sufficient number of students. Identifying these cases is not about pointing out problems, but about discovering opportunities for more precise, agile, and adaptive academic management.",
  "A7_spinner_1": "Identifying specific areas of attention...",
  "A7_error_a8_analysis": "Could not complete the analysis of areas of attention.",
  "A7_a8_subheader_1": "🌱 Sowing the Future: Possible New or Reactivated Offerings",
  "A7_a8_markdown_1": "The following chart shows how many new or reactivated careers were detected each year. This reveals the periods of greatest expansion or renewal of the academic offering.",
  "A7_chart_title_new_offers": "New or Reactivated Offerings Detected by Year",
  "A7_chart_xaxis_year_new_offers": "Year of Detection/Reactivation",
  "A7_expander_new_offers": "View the full list of the {count} new offerings detected",
  "A7_col_detected_start_year": "Detected Start Year",
  "A7_col_current_enrollment": "Current Enrollment",
  "A7_info_no_new_offers": "No careers were identified that clearly meet the criteria for a new or reactivated offering.",
  "A7_a8_subheader_2": "🍂 Concluding Cycles: Possible Cessation of Offerings",
  "A7_a8_markdown_2_revised": "This chart summarizes how many careers ceased to have enrollment per year, giving us an idea of the periods with the greatest adjustments or discontinuations in the academic offering.",
  "A7_chart_title_ceased_offers": "Possible Cessation of Offerings by Last Year with Enrollment",
  "A7_chart_xaxis_last_year": "Last Year with Enrollment",
  "A7_expander_ceased_offers": "View the full list of the {count} possibly ceased offerings",
  "A7_col_last_enrollment_year": "Last Year with Enrollment",
  "A7_info_no_ceased_offers": "No careers were identified that clearly meet the criteria for cessation of offering.",
  "A7_a8_subheader_3": "📉 Focus Areas: Low Enrollment (Below {umbral})",
  "A7_a8_markdown_3_revised": "The following chart groups careers by their enrollment level in the {curso} academic year. Each dot represents a career at a specific university. Hover over a dot to see the details. This helps us see where the cases of most critical enrollment are concentrated (e.g., 1 or 2 students).",
  "A7_chart_title_low_enrollment": "Offerings with Low Enrollment (Academic Year {curso}, < {umbral} Students)",
  "A7_chart_yaxis_low_enrollment": "Number of Students",
  "A7_expander_low_enrollment": "View the full list of the {count} careers with low enrollment",
  "A7_col_enrollment_last_year": "Enrollment ({curso})",
  "A7_info_no_low_enrollment": "No careers with enrollment below {umbral} (and >0) were identified in the last year.",
  "A7_conclusion_markdown_1": "---\n**Informed Decisions for Proactive Management:**\nThe information presented in this section is a call for specific action:\n*   **New Offerings / Reactivations:**\n    *   **Verify:** Do they correspond to planned launches or reactivations?\n    *   **Monitor:** Evaluate their initial evolution, resource needs, and consolidation strategies.\n    *   **Learn:** Do they respond to an emerging social or labor demand that could be replicated?\n*   **Possible Cessation of Offerings:**\n    *   **Confirm:** Is the discontinuation official and final? Update records if necessary.\n    *   **Assess Impact:** If the cessation was unplanned or has negative implications (e.g., the only offering in a region), investigate the causes.\n*   **Low Enrollment:**\n    *   **Root-Cause Analysis:** Are these highly specialized careers with limited demand by nature? Recruitment problems? Outdated curriculum? Lack of labor relevance?\n    *   **Differentiated Strategies:** Depending on the diagnosis, actions could range from focused promotion, curriculum redesign, to considering a merger with other careers or, ultimately, a planned discontinuation if its maintenance is not justified.\n\nAttentive management of these details allows for resource optimization, better response to the country's needs, and ensures the vitality and relevance of the university's academic offering.",
  "A7_game_subheader": "🕵️‍♂️ Find the Focus Area",
  "A7_game_intro": "Among the multiple academic offerings of universities, some thrive with hundreds of students, while others struggle to stay afloat. Below, we present four university offerings. Three of them have healthy enrollment, but one is a \"focus area\" with critically low enrollment. Can you identify the impostor?",
  "A7_game_title": "The Low Enrollment Impostor",
  "A7_chart_yaxis_enrollment": "Total Enrollment",
  "A7_chart_title_projection": "Enrollment Projection for Selected Careers",
  "a7_proy_warning": "Could not generate projection data for: {careers}.",
  "a7_void_info": "Select at least one career to see its projection.",
  "a7_end_markdown": "---\n**Planning with a Vision for the Future:**\nThese projections, with all their limitations, are a valuable input for:\n*   Anticipating **infrastructure and faculty** needs.\n*   Debating the **allocation of spots and resources** among different areas and careers.\n*   Identifying areas that might require **proactive strategies** to reverse negative trends or to manage sustainable growth.\n*   Fostering an informed dialogue about the **future of academic offerings** in Cuba.",
  "B1_header_1": "🔬 Playground: Detailed Career Profile",
  "B1_markdown_1": "Dive into the details of the career you choose. Discover its historical evolution, its growth rate, and an annual overview of universities and gender composition.",
  "B1_selectbox_label_1": "Select a Career to analyze its profile:",
  "b1_info_select_career": "Please select a Career to continue.",
  "B1_spinner_1_hist": "Generating historical profile for {career}...",
  "B1_subheader_1_hist": "Evolution and Growth of: {career}",
  "B1_markdown_1_rama": "Branch of Science",
  "B1_chart_title_evolution_stacked": "Evolution and Composition of Enrollment: {career}",
  "B1_info_no_evolution_data": "No evolution data available for this career.",
  "B1_slider_label_cagr": "Select the year range for CAGR calculation:",
  "B1_subheader_2_snapshot": "Detailed Annual Analysis",
  "B1_slider_label_snapshot": "Select a year to see the details:",
  "B1_spinner_2_snapshot": "Loading data for the year {year}...",
  "B1_pie_title_genero_yearly": "Gender Distribution ({curso})",
  "B1_info_no_gender_data_pie": "No gender data for this year.",
  "b1_bar_chart_title": "Enrollment by University",
  "b1_info_no_universities_data_year": "No university registered enrollment in this year.",
  "b1_warning_no_data_for_year": "No data found for the career '{career}' in the year {year}.",
  "b2_header": "🗺️ Institutions Guide: Explore Academic Offerings by Location",
  "b2_intro": "Discover the higher education institutions in Cuba, filtering by province and municipality. For each university, you will find general information and the academic offering by branches and careers in the year you select.",
  "b2_error_no_institutions_data": "Institution data is not available. This section cannot be displayed.",
  "b2_error_no_enrollment_data": "Enrollment data is not available. Offering information will be limited.",
  "b2_subheader_filters": "Search Filters:",
  "b2_label_province": "Province:",
  "b2_label_municipality": "Municipality:",
  "b2_label_search_pattern": "Search by institution name or acronym (visual filter):",
  "b2_spinner_loading": "Loading institutions guide...",
  "b2_warning_basic_analysis_failed": "Could not load the basic list of institutions. Status: {status}",
  "b2_info_showing_unis": "Showing {shown} of {total} institution(s) ({last_year}).",
  "b2_warning_no_years_for_detail": "No enrollment years available to view details.",
  "b2_slider_year_detail": "Select the year to see the detailed academic offering:",
  "b2_info_no_unis_matched_filters": "No institutions found matching the applied filters.",
  "b2_pie_title_gender_total": "Total Gender ({curso})",
  "b2_caption_no_gender_data_for_year": "No gender data available for {curso}.",
  "b2_markdown_academic_offering": "**Academic Offering ({curso}, branches and careers with enrollment):**",
  "b2_info_no_branches_for_year": "This institution has no active science branches or careers with reported enrollment for {curso}.",
  "conclusion_header": "🏁 Conclusions and Future Horizons: Forging the University of Tomorrow",
  "conclusion_intro": "We have journeyed through a decade of data, exploring the complex ecosystem of higher education in Cuba. Whether as an analyst or an explorer, every unlocked chart and every overcome challenge has been a piece of a larger puzzle: the story of thousands of aspirations, institutional efforts, and the relentless pursuit of knowledge that defines our nation.\n\nThis analysis is not an endpoint, but a beacon that illuminates the path taken and helps us discern the paths that lie ahead.",
  "conclusion_success_message": "**Information is power, and the power of this data lies in our ability to transform it into wise action and strategic vision.**",
  "conclusion_findings_subheader": "🌟 Highlights of the Journey: Main Findings",
  "conclusion_findings_text": "Looking back at our analysis, several beacons emerge to guide our understanding:\n\n1.  **The Nation's Dynamic Pulse:** National university enrollment has shown a remarkable capacity for expansion, reaching significant peaks in the early 2020s, followed by a more recent adjustment phase. This fluctuation reminds us of the system's sensitivity to contextual factors and the need for flexible planning. *(Ref. Section 1)*\n\n2.  **The Medical Heart and the Pedagogical Soul:** **Medical Sciences** are consolidated as the backbone in terms of student volume, a testament to their strategic importance. **Pedagogical Sciences**, on the other hand, have shown extraordinary dynamism, with massive growth followed by a contraction, reflecting possible changes in demand or teacher training policies. *(Ref. Section 2)*\n\n3.  **The Rise of New Vocations:** The growth analysis (CAGR) has revealed the impressive takeoff of careers like **Dental Services** and the vigor of several **Engineering** fields (Artistic, Agro-industrial Processes, Computer Science), signaling potential new frontiers of interest and labor demand. *(Ref. Section 3)*\n\n4.  **Progress and Challenges in Gender Equity:** While Cuba exhibits high female participation in higher education, with many branches and careers showing a majority of women, significant challenges remain. The underrepresentation of women in **Technical Sciences** and **specific Engineering fields**, as well as in **Physical Culture and Sports Sciences**, calls us to redouble our efforts to build a truly equitable landscape. *(Ref. Section 4)*\n\n5.  **The Richness of Institutional Diversity:** Each university brings its unique nuance to the system. We have seen everything from large multidisciplinary centers to institutions with marked specialization (like the Universities of Medical Sciences). The identification of careers with limited offerings underscores the importance of a coordinated and strategically distributed university network. *(Ref. Section 5)*\n\n6.  **A Prudent Look at Tomorrow:** The projections, though subject to the uncertainty inherent in the future, suggest a possible continuation of the adjustment phase in general enrollment and in several key branches and careers. This is not an omen, but an invitation to preparation and proactive action. *(Ref. Section 6)*\n\n7.  **The Importance of Details:** The analysis of \"Areas of Attention\" has reminded us that the health of the system also lies in the vitality of each of its components, including emerging careers, those with low enrollment, or those that might be concluding their cycle. *(Ref. Section 7)*",
  "conclusion_player_summary_header": "🏆 Summary of Your Adventure as an Explorer",
  "metric_total_score": "Final Score",
  "metric_games_played": "Games Completed",
  "metric_analyst_profile": "Analyst Profile",
  "profile_strategist": "The Strategist",
  "profile_strategist_desc": "Your strength is classifying and ordering. You see the big picture and put every piece in its place.",
  "profile_competitor": "The Competitor",
  "profile_competitor_desc": "You love duels. Comparing and choosing the winner is your specialty.",
  "profile_visionary": "The Visionary",
  "profile_visionary_desc": "You have a gift for estimating figures and magnitudes with precision.",
  "profile_prophet": "The Prophet",
  "profile_prophet_desc": "You intuit future trends like no other. Your crystal ball works!",
  "profile_cartographer": "The Cartographer",
  "profile_cartographer_desc": "You know the terrain. Pinpointing each institution on the map is your natural talent.",
  "profile_detective": "The Detective",
  "profile_detective_desc": "No one can fool you. You are an expert at finding the element that doesn't fit.",
  "profile_scholar": "The Scholar",
  "profile_scholar_desc": "You answer direct questions with knowledge and certainty.",
  "profile_explorer": "The Explorer",
  "profile_explorer_desc": "You enjoy the journey and learn from every challenge, covering all areas.",
  "leaderboard_header": "Global Explorer Leaderboard",
  "leaderboard_intro": "Compete with other analysts and make your mark on the leaderboard. Will you be among the best?",
  "player_name_label": "Your name for the leaderboard:",
  "submit_score_button": "🚀 Submit my score!",
  "enter_name_warning": "Please enter a name.",
  "score_submitted_info": "Your score has already been submitted! Thank you for participating.",
  "loading_leaderboard_spinner": "Loading the leaderboard...",
  "leaderboard_col_timestamp": "Date",
  "leaderboard_col_playername": "Player",
  "leaderboard_col_score": "Score",
  "leaderboard_empty_caption": "The leaderboard is empty. Be the first to appear!",
  "leaderboard_connection_warning": "Could not connect to the leaderboard service. The feature is not available at this time.",
  "conclusion_recommendations_subheader": "🧭 Charting the Course: Strategic Recommendations",
  "conclusion_recommendations_text": "With these findings as a compass, we propose the following lines of action for the Central Headquarters and all stakeholders involved in Cuban Higher Education:\n\n*   **Strengthen the Higher Education Observatory:**\n    *   **Action:** Maintain and enrich this data analysis system as a permanent tool for monitoring trends, evaluating policies, and making informed decisions.\n    *   **Expected Impact:** Greater agility and responsiveness of the system to changing dynamics.\n\n*   **Promote Relevance and Quality with a Future Vision:**\n    *   **Action:** Conduct continuous prospective studies on the needs of the country's socioeconomic development and labor market demands to align academic offerings. Evaluate and update the curricula of careers with low demand or decline, and invest in those with growth potential and strategic relevance.\n    *   **Expected Impact:** Graduates better prepared for the challenges of the future and a greater contribution from the university to national development.\n\n*   **Boost Gender Equity in All Disciplines:**\n    *   **Action:** Design and implement specific and sustained programs to encourage female participation in STEM careers and other underrepresented areas, and vice versa, addressing stereotypes from early stages of education.\n    *   **Expected Impact:** A more inclusive university system that harnesses the talent of the entire population without gender bias.\n\n*   **Optimize the University Network and Promote Collaboration:**\n    *   **Action:** Use specialization and distribution analyses to make decisions about the opening, merging, or closing of careers in different institutions, seeking efficiency, quality, and equitable territorial coverage. Foster the creation of knowledge networks and inter-university programs.\n    *   **Expected Impact:** A more cohesive system, with strengthened centers of excellence and better use of available resources.\n\n*   **Integrate the Voice of Stakeholders:**\n    *   **Action:** Complement quantitative analyses with qualitative research that gathers the perceptions and experiences of students, professors, graduates, and employers.\n    *   **Expected Impact:** More holistic decisions and policies better adapted to the realities and expectations of the university community and society.",
  "conclusion_final_header": "✨ A Continuing Legacy, A Bright Future",
  "conclusion_final_paragraph": "The analysis of this data is not merely an academic exercise; it is an act of responsibility and a commitment to the future. Cuban Universities, each with its rich history and its transcendental role in society, face the challenge and the opportunity to continue evolving, adapting, and innovating.\n\nWe hope this data inspires everyone to work together for a higher education that not only responds to the needs of the present but actively shapes a more prosperous, just, and knowledgeable tomorrow for all young Cubans."
}