{
  "settings_title": "Configuración",
  "save": "Guardar",
  "load_df_error": "Error crítico: No se pudieron cargar los datos ('db.parquet'). La aplicación no puede continuar.",
  "load_screen_title": "🎓 Análisis Estratégico de la Matrícula Universitaria en Cuba",
  "main_image_caption": "Universidad de La Habana. Un símbolo de la educación superior en Cuba.",
  "main_markdown_1": "Un viaje para iluminar el camino de la Educación Superior.",
  "sidebar_title": "🧭 Explorador de secciones",
  "sidebar_radio_title_main": "Elige una sección:",
  "sidebar_radio_title_sub_prefix": "Subseccion: ",
  "sidebar_info": "Análisis basado en datos de matrícula del período 2015-16 a 2024-25.\n\n -- ⚠️ No incluye el curso 2018-2019 por falta de datos en dicho curso, los análisis se realizan obviando este curso.",
  "subseccion_not_valid_in": "Subsección no válida en ",
  "back": "Anterior: ",
  "next": "Siguiente: ",
  "authors": "Autores:",
  "author_reynier": "Reynier Ramos González",
  "author_ernesto": "Ernesto Herrera García",
  "lang_select_label": "Language / Idioma",
  "lang_select_help": "Selecciona tu idioma de preferencia para la aplicación.",
  "_women": "Mujeres",
  "_men": "Hombres",
  "_total_enrollment": "Matrícula Total",
  "_total_enrollment_projected": "Matrícula Total (Proyectada)",
  "_total_enrollment_historical": "Matrícula Total (Histórica)",
  "_projection_start": "Inicio Proyección",
  "_academic_year": "Curso Académico",
  "_enrollment": "Matrícula",
  "_legend": "Leyenda",
  "_projected_short": "Proy.",
  "_50_parity": "50% Paridad",
  "_university": "Universidad",
  "_date": "Dato",
  "_career": "Carrera",
  "_offers": "ofertas",
  "_elements": "elementos",
  "_number_of_students": "Número de Estudiantes",
  "_all_provinces": "TODAS LAS PROVINCIAS",
  "_all_municipalities": "TODOS LOS MUNICIPIOS",
  "_founded_in": "Fundada en",
  "_organism": "Organismo",
  "_address": "Dirección",
  "_main_modality": "Modalidad Principal",
  "generic_warn_figs": "No se pudo generar el gráfico del panorama nacional (A1).",
  "ask_ai_component": {
    "ai_initial_response_text": "🤖 ¿Preguntas sobre este análisis? ¡Pregúntale al Asistente de IA!",
    "restart_conversation": "Reiniciar esta conversación",
    "your_question_here": "Escribe tu pregunta aquí...",
    "thinking": "Procesando tu solicitud...",
    "code_download": "📥 Descargar Código",
    "generated_image": "Imagen generada",
    "error_parsing_table": "Error al parsear tabla"
  },
  "gamification_controller": {
    "confirm_deactivation_title": "Confirmar Desactivación",
    "confirm_deactivation_warning": "¿Seguro que quieres desactivar el Modo Juego?",
    "confirm_deactivation_text": "Dejarás de ver los minijuegos interactivos y perderás tu progreso actual.",
    "confirm_button": "Confirmar",
    "cancel_button": "Cancelar",
    "game_mode_label": "**Modo Juego**",
    "toggle_help": "Activa/desactiva los minijuegos interactivos.",
    "progress_header": "🏆 Tu Progreso",
    "reset_progress_button": "Reiniciar Progreso",
    "points_metric_label": "Puntos",
    "games_metric_label": "Juegos",
    "history_expander_label": "Ver Historial de Partidas",
    "history_empty": "Aún no has jugado. ¡Anímate!",
    "history_item_text": "{icon} **{game_title}**: *+{points_earned} pts*",
    "round": "Ronda",
    "detailed_analysis_revealed": "Análisis Detallado:",
    "feedback_victory": "¡Victoria! Has superado el desafío con **{total_score}** puntos.",
    "feedback_defeat": "¡Casi! Has obtenido **{total_score}** puntos. ¡Inténtalo de nuevo!",
    "feedback_game_over_text": "Has obtenido un total de **{total_score}** puntos.",
    "see_round_summary": "Ver resumen detallado de rondas",
    "submit_button_label": "¡Comprobar!",
    "please_pick_an_action": "Por favor, realiza una acción antes de comprobar.",
    "SimpleQuestionMinigame": {
      "minigame_prefix": "Minijuego:",
      "choose_your_answer": "Elige tu respuesta:"
    },
    "DataDuelMinigame": {
      "data_duel_title": "Duelo de Datos",
      "duel_question": "¿Cuál tiene un valor mayor?"
    },
    "ClassifierMinigame": {
      "classifier_title": "El Clasificador",
      "classifier_drag_info": "💡 Arrastra los elementos para ordenarlos de mayor a menor."
    },
    "OracleMinigame": {
      "oracle_title": "El Oráculo",
      "oracle_question": "Observa la evolución y predice la tendencia."
    },
    "EstimatorMinigame": {
      "estimator_title": "El Estimador",
      "estimator_instructions": "Usa el deslizador para estimar el valor. ¡Mientras más cerca, más puntos!",
      "estimator_question": "¿Cuál es el valor para **{item_name}**?",
      "_your_estimation": "Tu estimación",
      "estimator_result_shower": "**Resultado para '{item_name}' (Ronda {round_num})**",
      "_real_value": "Valor Real",
      "estimator_claim_victory": "¡Excelente estimación! Obtuviste **{score}** puntos.",
      "estimator_good_try": "¡Buen intento! Obtuviste **{score}** puntos."
    },
    "GeoGuesserMinigame": {
      "geoguesser_title": "GeoGuesser",
      "geoguesser_instructions": "Selecciona la provincia correcta para la siguiente institución.",
      "_where_is_it": "¿Dónde se encuentra?"
    },
    "ImpostorMinigame": {
      "impostor_title": "Encuentra al Intruso",
      "impostor_instructions": "Tres de estos elementos pertenecen al mismo grupo. ¿Cuál es el intruso?"
    }
  },
  "introduction_header": "🎯 Bienvenidos al Corazón de la Educación Superior Cubana",
  "introduction_markdown_1": "La universidad no es solo un edificio; es un crisol de sueños, un motor de progreso y un reflejo de las aspiraciones de una sociedad. En este espacio, nos embarcaremos en un viaje analítico, explorando las corrientes que moldean la matrícula universitaria en Cuba.\n\nDesde las tendencias generales hasta el detalle de cada carrera y universidad, desentrañaremos las historias ocultas detrás de las distintas universidades del país. ¿El objetivo? Proveer una brújula basada en evidencia para la toma de decisiones estratégicas, fomentando un sistema de educación superior más fuerte, equitativo y alineado con el futuro de la nación.",
  "intro_choose_your_path_header": "🛣️ Elige tu Camino: ¿Cómo Quieres Explorar?",
  "intro_choose_your_path_text": "Este viaje a través de los datos puede tomar dos rutas. Elige la que mejor se adapte a tu estilo.",
  "intro_analyst_path_title": "👨‍🏫 La Ruta del Analista",
  "intro_analyst_path_desc": "Ideal si buscas ir directo al grano. Accede a todos los gráficos y análisis de forma directa, sin interrupciones. Perfecto para una exploración rápida y enfocada.",
  "intro_analyst_path_button": "Activar Modo Análisis",
  "intro_explorer_path_title": "🎮 La Senda del Explorador",
  "intro_explorer_path_desc": "Convierte el análisis en un desafío. En cada sección, te enfrentarás a minijuegos para poner a prueba tu intuición sobre los datos antes de verlos. ¡Gana puntos y compite!",
  "intro_explorer_path_button": "Activar Modo Juego",
  "intro_game_mode_active_info": "🕹️ ¡**Modo Juego Activado!** Prepárate para los desafíos. Puedes ver tu progreso si presionas el botón '🏆' que aparece en la esquina inferior derecha.",
  "intro_analysis_mode_active_info": "📊 **Modo Análisis Activado.** Estás listo para una exploración directa de los datos. Puedes cambiar de modo en cualquier momento en la barra lateral.",
  "introduction_sucess": "¡Tu viaje comienza aquí! Selecciona una sección en el menú lateral o usa el botón 'Siguiente'.",
  "A1_header": "🌍 El Pulso Nacional: ¿Cómo Late la Matrícula Universitaria?",
  "A1_markdown_1": "Imagina que podemos tomarle el pulso a todo el sistema universitario cubano a lo largo de una década. ¿Cómo ha sido su ritmo? ¿Ha experimentado momentos de vigoroso crecimiento, períodos de estabilidad, o quizás fases donde el latido se ha vuelto más pausado?\n\nEsta primera sección nos ofrece una vista panorámica de la matrícula total a nivel nacional, permitiéndonos identificar las grandes tendencias que han marcado el sistema de educación superior en los últimos años. Es nuestro punto de partida para entender el contexto general antes de sumergirnos en análisis más específicos.",
  "A1_spinner_1": "Construyendo la gráfica A1, por favor espere...",
  "A1_chart_title_historical": "Matrícula Nacional: Evolución Histórica",
  "A1_fig_1_subheader": "Descifrando el Ritmo de la Década (2015-2025):",
  "A1_fig_1_markdown_1": "Observando la trayectoria de la matrícula nacional total en el gráfico superior, podemos identificar varias fases clave:\n\n*   **Impulso Inicial (2015-16 a 2016-17):** El viaje comienza en el curso 2015-2016 con una cifra que ronda los **165,000 estudiantes**. El año siguiente muestra un ligero aumento, estableciendo una base sólida para el crecimiento que vendrá.\n\n*   **Crecimiento Sostenido hacia la Cima (2017-18 a 2020-21):** A partir del curso 2017-18, y a pesar de la falta de datos para 2018-19, la tendencia ascendente se retoma con fuerza hasta alcanzar su **punto más álgido en el curso 2020-2021, superando los 285,000 estudiantes**. Este período representa la fase de mayor expansión de la matrícula en la década.\n\n*   **Meseta y Comienzo del Declive (2021-22 a 2022-23):** El curso 2021-2022 muestra una ligera contracción respecto al pico, marcando el inicio de una nueva fase. La matrícula se mantiene alta pero ya no crece, y para 2022-23, el descenso se hace más evidente.\n\n*   **Ajuste Reciente (2023-24 a 2024-25):** Los dos últimos cursos registrados muestran una **continuación de la tendencia descendente**, con la matrícula total situándose en torno a los **205,000 estudiantes** en el período más reciente. Esto sugiere un reajuste del sistema tras el pico de expansión.",
  "A1_ai_context": "The current analysis is about the evolution of total national enrollment, male and female, in Cuba from 2015 to 2025. The data, presented in the chart, shows a significant peak around 2020-2021 followed by a decline.",
  "A1_peak_enrollment_label": "Matrícula Nacional en el Año Pico ({curso})",
  "A1_game_subheader": "A Prueba: La Magnitud del Pico",
  "A1_game_intro": "El sistema universitario cubano alcanzó un número máximo de estudiantes en un punto de la última década. Antes de ver el gráfico, ¿qué tan buena es tu intuición? Intenta estimar cuál fue esa cifra máxima.",
  "A1_game_title": "El Estimador del Pico Nacional",
  "A1_estimator_question": "¿Cuántos estudiantes crees que había en todo el país durante el curso de máxima matrícula ({curso})?",
  "A2_header": "📚 Un Mosaico de Saberes: ¿Hacia Dónde se Inclinan los Futuros Profesionales?",
  "A2_markdown_1": "La universidad es un vasto jardín donde florecen diversas disciplinas. Cada rama del conocimiento, desde las Ciencias Médicas o Matemáticas hasta las Artes, representa un camino único de formación y contribución a la sociedad. En esta sección, desglosamos la matrícula total para ver cómo se distribuyen los estudiantes entre estas grandes áreas, con el objetivo de responder preguntascomo:\n- ¿Hay protagonistas claros?\n- ¿Cómo ha danzado el interés estudiantil a lo largo de la última década?",
  "A2_fig_a2_abs_subheader": "La Fuerza de Cada Rama: Evolución Histórica de la Matrícula",
  "A2_spinner_1": "Analizando la evolución de las ramas de ciencias...",
  "A2_chart_title_evolution": "Evolución Histórica por Rama",
  "A2_yaxis_title_enrollment_branch": "Matrícula en Rama de Ciencias",
  "A2_legend_title_branch": "Rama de Ciencias",
  "A2_fig_a2_abs_markdown_1": "**Cada Línea, una Corriente del Conocimiento:**\nEste gráfico traza el viaje de la matrícula absoluta (número total de estudiantes) para cada rama de ciencias a lo largo de los años.\n\n*   **Liderazgo Destacado:** Las **Ciencias Médicas** (línea verde agua) se erigen como la rama con la matrícula más numerosa de forma consistente durante todo el período, partiendo de unos 70,000 estudiantes en 2015-16, alcanzando un pico impresionante cercano a los **95,000 estudiantes en 2020-2021**, y aunque experimentan un descenso posterior, se mantienen como la principal fuerza, cerrando en 2024-2025 con más de 70,000 estudiantes.\n\n*   **Persecución y Dinamismo:** Las **Ciencias Pedagógicas** (línea naranja) muestran una trayectoria muy dinámica. Comienzan con una matrícula significativa (alrededor de 30,000), experimentan un crecimiento notable hasta superar los **65,000 estudiantes en 2020-2021 y 2021-2022**, convirtiéndose en la segunda rama más grande durante esos años. Sin embargo, sufren un declive pronunciado en los últimos cursos, finalizando cerca de los 40,000 estudiantes.\n\n*   **Bloque Intermedio Consistente:** Un grupo de ramas mantiene una presencia estable aunque con fluctuaciones:\n    *   Las **Ciencias Técnicas** (línea rosa) y las **Ciencias Sociales y Humanísticas** (línea celeste) muestran trayectorias paralelas, creciendo desde aproximadamente 20,000 estudiantes hasta un pico alrededor de los **30,000-32,000** entre 2020-21 y 2021-22, para luego descender y situarse en torno a los 23,000-25,000 estudiantes al final del período.\n    *   Las **Ciencias Económicas** (línea roja) presentan un crecimiento más moderado pero constante hasta 2021-22 (alcanzando unos 24,000 estudiantes), seguido de un descenso similar a otras ramas, terminando cerca de los 15,000.\n    *   Las **Ciencias Agropecuarias** (línea azul oscuro) y las **Ciencias de la Cultura Física y el Deporte** (línea verde oscuro/marrón) se mantienen en un rango más bajo, generalmente entre 5,000 y 15,000 estudiantes, con picos alrededor de 2020-2021 y descensos posteriores.\n\n*   **Nicho Especializado:** Las **Ciencias Naturales y Matemáticas** (línea morada) y las **Ciencias de las Artes** (línea violeta) representan las ramas con menor volumen de matrícula, manteniéndose consistentemente por debajo de los 5,000 estudiantes a lo largo de toda la década. Esto sugiere una alta especialización o una demanda más acotada.",
  "A2_fig_a2_pct_subheader": "El Reparto del Pastel Académico: Distribución Porcentual Histórica",
  "A2_chart_title_distribution": "Distribución Porcentual Histórica de la Matrícula por Rama de Ciencias",
  "A2_yaxis_label_percentage": "% Matrícula",
  "A2_fig_a2_pct_markdown_1": "**Proporciones en el Lienzo Universitario:**\nEste gráfico de área apilada nos muestra qué \"porción del pastel\" ha representado cada rama de ciencias dentro del total de la matrícula universitaria en cada curso académico.\n\n*   **Dominio Persistente de las Ciencias Médicas:** La ancha banda verde agua en la parte superior confirma que las Ciencias Médicas han representado consistentemente la mayor proporción de estudiantes, ocupando cerca del **40-50% del total** en su punto más alto (alrededor de 2016-17 y nuevamente hacia 2024-2025, tras una ligera reducción porcentual a mediados del período).\n\n*   **Ascenso y Descenso de las Ciencias Pedagógicas:** La banda naranja de las Ciencias Pedagógicas muestra un interesante cambio en su peso relativo. Comienza siendo una porción importante, se expande significativamente hasta representar la segunda mayor proporción (llegando a casi un **25-30%** del total alrededor de 2019-2021), pero luego reduce su participación porcentual en los últimos años.\n\n*   **Estabilidad Relativa en el Medio:** Las Ciencias Técnicas (banda marrón/ocre), Sociales y Humanísticas (banda celeste) y Económicas (banda azul oscuro) mantienen proporciones más estables a lo largo del tiempo, aunque con ligeras variaciones. Juntas, suelen conformar una porción significativa del estudiantado. Por ejemplo, las Ciencias Sociales y Humanísticas parecen ocupar consistentemente alrededor del 10-15%.\n\n*   **Menor Peso Porcentual:** Las demás ramas (Agropecuarias, Cultura Física, Naturales y Matemáticas, Artes) representan individualmente porcentajes menores del total de la matrícula, lo que es coherente con su menor volumen absoluto de estudiantes.\n\nEste análisis porcentual es crucial porque nos permite entender no solo cuántos estudiantes hay en cada rama, sino también cómo se distribuye el interés o la capacidad de admisión en relación con el conjunto del sistema universitario.",
  "A2_subhead_popularity": "Ranking de Popularidad: ¿Qué áreas del saber lideran?",
  "A2_intro_game1": "Antes de sumergirnos en los gráficos, pongamos a prueba tu percepción. A lo largo de Cuba, miles de estudiantes eligen su camino profesional cada año. ¿Cuáles crees que son las ramas del conocimiento que atraen a la mayor cantidad de universitarios? ¿Podrías ordenar las principales áreas según su popularidad?",
  "A2_game_title": "El Clasificador del Saber",
  "A2_subheader_2": "🔗 Interconexiones en el Crecimiento: ¿Cómo se Relacionan las Ramas?",
  "A2_markdown_2": "No todas las ramas de ciencias crecen o decrecen de forma aislada. Algunas pueden mostrar tendencias de matrícula similares a lo largo del tiempo, mientras que otras pueden tener dinámicas más independientes. El siguiente mapa de calor (heatmap) visualiza la **correlación del cambio porcentual anual de la matrícula** entre las diferentes ramas de ciencias.\n\n*   Un **valor cercano a 1 (azul oscuro/morado intenso)** indica una fuerte correlación positiva: cuando una rama crece, la otra tiende a crecer también en ese mismo período.\n*   Un **valor cercano a -1 (no visible en este ejemplo, sería el otro extremo del color)** indicaría una fuerte correlación negativa: cuando una crece, la otra tiende a decrecer.\n*   Un **valor cercano a 0 (colores más claros/neutros)** sugiere poca o ninguna relación lineal en sus patrones de crecimiento anual.",
  "A2_corr_title": "Matriz de Correlación del Crecimiento Anual entre Ramas de Ciencias",
  "A2_corr_legend": "Coef. Correlación",
  "A2_fig_corr_expander": "🔍 Análisis Detallado de las Correlaciones Observadas",
  "A2_fig_corr_markdown_1": "**Observaciones Clave del Mapa de Correlación:**\n\n*   **Sincronización Fuerte:** Se observa una **alta correlación positiva (valores > 0.9)** en las tendencias de crecimiento anual entre:\n    *   **Ciencias Agropecuarias y Ciencias Económicas** (aprox. 0.98)\n    *   **Ciencias Agropecuarias y Ciencias Pedagógicas** (aprox. 0.98)\n    *   **Ciencias Agropecuarias y Ciencias de la Cultura Física y el Deporte** (aprox. 0.96)\n    *   Así como entre **Ciencias Económicas, Pedagógicas y de la Cultura Física**, todas mostrando coeficientes muy elevados entre sí.\n    Esto sugiere que estas ramas a menudo experimentan impulsos de crecimiento (o contracción) de manera muy similar y simultánea, posiblemente debido a factores macroeconómicos, políticas educativas integrales o ciclos de demanda estudiantil que las afectan conjuntamente.\n\n*   **Correlaciones Positivas Moderadas:**\n    *   Las **Ciencias Médicas** muestran una correlación positiva moderada (generalmente entre 0.5 y 0.7) con varias otras ramas como Económicas, Sociales y Humanísticas, y Técnicas. Esto podría indicar que el sector médico, si bien tiene sus propias dinámicas, también se beneficia o participa de tendencias expansivas más amplias en la educación superior.\n    *   Las **Ciencias Técnicas** también se correlacionan moderadamente con la mayoría de las otras ramas, sugiriendo una conexión con el ciclo general del sistema.\n\n*   **Independencia Relativa Notoria:**\n    *   Las **Ciencias Naturales y Matemáticas** destacan por tener las **correlaciones más bajas** con casi todas las demás ramas (coeficientes frecuentemente entre 0.2 y 0.4). Esto indica que su patrón de crecimiento de matrícula parece ser bastante independiente de las fluctuaciones que afectan a otras grandes áreas del conocimiento. Esta rama podría estar influenciada por factores muy específicos, como programas de fomento científico particulares o una demanda más especializada y menos sensible a tendencias generales.\n    *   Las **Ciencias de las Artes** también muestran correlaciones más débiles con algunas de las ramas más grandes como Pedagógicas, aunque tiene una correlación moderada interesante con Ciencias Médicas.\n\n*   **Implicaciones Estratégicas:**\n    *   La fuerte sincronización entre ciertas ramas sugiere que las estrategias de planificación y asignación de recursos podrían considerar estos \"clusters\" de comportamiento.\n    *   La independencia de Ciencias Naturales y Matemáticas podría requerir un enfoque y monitoreo diferenciado para asegurar su vitalidad y alineación con las necesidades de desarrollo científico-técnico del país.\n    *   La ausencia de correlaciones fuertemente negativas (en este gráfico) sugiere que, a nivel agregado de cambio anual, no hay una \"canibalización\" evidente donde el crecimiento de una rama sea directamente a costa de otra, aunque no se descartan dinámicas competitivas a niveles más específicos.",
  "A2_corr_warn_1": "No se pudo generar el mapa de correlación entre ramas.",
  "A2_subhead_correlation": "Sinergias Ocultas: ¿Qué ramas crecen juntas?",
  "A2_intro_game2": "Las ramas del saber no son islas. Sus tendencias de crecimiento a menudo están conectadas. Algunas se mueven en perfecta sincronía, mientras que otras bailan a su propio ritmo. Cuando el interés en las Ciencias Pedagógicas crece, ¿qué otra área crees que se beneficia de un impulso similar? ¡Acepta el duelo y descúbrelo!",
  "A2_game_title_corr": "Duelo de Sinergias",
  "A2_duel_question_corr": "Crecimiento de las **Ciencias Pedagógicas** es MÁS similar al de:",
  "A3_header": "🔍 Carreras Bajo la Lupa: Popularidad, Tendencias y Dinamismo",
  "A3_markdown_1": "Tras explorar las grandes ramas del saber, es momento de enfocar nuestra lente en las unidades fundamentales: las carreras universitarias. ¿Cuáles son las que capturan el mayor interés estudiantil? ¿Cómo ha sido su evolución individual? Y, muy importante, ¿cuáles muestran un crecimiento acelerado y cuáles parecen estar perdiendo impulso?",
  "A3_subheader_2": "🏆 El Podio de las Carreras: ¿Cuáles Lideran la Matrícula Actual?",
  "A3_spinner_1": "Analizando el ranking y evolución de las carreras top...",
  "A3_warning_analysis_failed": "No se pudo realizar el análisis de popularidad de carreras. Estado: {status}",
  "A3_markdown_2": "A la izquierda observamos el ranking de todas las carreras según su matrícula total en el curso más reciente ({year_range}). A la derecha, vemos la evolución histórica de la matrícula para las {top_n} carreras que actualmente se encuentran en la cima de este ranking.",
  "A3_chart_title_evolution": "Evolución Histórica (Top {n} Carreras Actuales)",
  "A3_chart_yaxis_enrollment": "Matrícula Total en Carrera",
  "A3_col_evo_top_info": "No se generó gráfico de evolución para las carreras top actuales.",
  "A3_markdown_3": "**Puntos Clave del Podio:**\n*   **Liderazgo Indiscutible:** **Medicina** se posiciona firmemente como la carrera con la mayor matrícula (35,889 estudiantes), una constante que ya habíamos vislumbrado al analizar las ramas del saber.\n*   **Fuerzas Significativas:** Le siguen **Cultura Física** (14,695) y **Educación Primaria** (12,867), demostrando una demanda considerable en estas áreas.\n*   **Top 5 Robusto:** **Enfermería** (9,999) y **Contabilidad y Finanzas** (9,883) completan el top 5, ambas con una matrícula muy cercana a los 10,000 estudiantes.\n*   **Evolución de las Líderes:** El gráfico de la derecha nos permite ver cómo estas carreras (y otras del top 10) han llegado a su posición actual. Observa cómo algunas han tenido un crecimiento más sostenido, mientras otras muestran picos y valles más pronunciados.",
  "A3_game1_subheader": "A Prueba: El Ranking de Popularidad",
  "A3_game1_intro": "Antes de ver el ranking completo, ¿qué tan buena es tu intuición sobre la demanda estudiantil? Te presentamos una selección de carreras. ¡Ordénalas de la más popular a la menos popular según la matrícula del último año!",
  "A3_game1_title": "El Clasificador de Carreras",
  "A3_subheader_4": "🚀 El Ritmo del Cambio: ¿Qué Carreras Despegan o Aterrizan?",
  "A3_markdown_4": "La **Tasa de Crecimiento Anual Compuesto (CAGR)** nos ofrece una perspectiva del dinamismo. Calcula el crecimiento (o decrecimiento) porcentual promedio de la matrícula de una carrera cada año, considerando todo el período analizado. Un CAGR alto sugiere una expansión rápida.",
  "A3_spinner_4": "Calculando el dinamismo de las carreras (CAGR)...",
  "A3_warning_cagr_failed": "No se pudo realizar el análisis de crecimiento (CAGR). Estado: {status}",
  "A3_chart_title_cagr_top": "Top 15 por Mayor Crecimiento Promedio Anual {periodo}",
  "A3_chart_title_cagr_bottom": "Top 15 por Mayor Decrecimiento Promedio Anual {periodo}",
  "A3_cagr_top_title": "📈 Top 15 con Mayor Crecimiento",
  "A3_col_cagr_top_markdown_2": "Estas carreras han experimentado la expansión más notable en su matrícula promedio anual.\n*   **Sorprendente Despegue:** **Servicios Estomatológicos** lidera con un CAGR superior al 100%, lo que indica una duplicación (o más) de su matrícula promedio año tras año.\n*   **Ingenierías en Auge:** Varias ingenierías como **Artística**, **Procesos Agroindustriales** e **Informática** muestran un crecimiento muy saludable.\n*   **Educación con Impulso:** Ramas de la educación como **Preescolar**, **Agropecuaria** y **Primaria** también figuran con un CAGR positivo y significativo.",
  "A3_cagr_bottom_title": "📉 Top 15 con Mayor Decrecimiento",
  "A3_col_cagr_bottom_markdown_2": "En el otro extremo, estas carreras han visto su matrícula promedio anual disminuir o crecer a un ritmo mucho menor.\n*   **Ajustes Notables:** **Estudios Socioculturales** y **Estomatología** (no confundir con Servicios Estomatológicos) presentan los mayores decrecimientos promedio.\n*   **Desafíos Diversos:** Carreras como **Ingeniería Agrícola**, **Artes Visuales**, **Matemática**, **Música** y varias **Ingenierías** (Hidráulica, Civil, Telecomunicaciones, Industrial) también aparecen en esta lista, sugiriendo una revisión de sus tendencias.",
  "A3_markdown_5": "**Reflexiones Estratégicas a partir de estos Ritmos:**\n*   Un **alto CAGR** no siempre significa una matrícula total masiva (podría ser una carrera pequeña creciendo rápido), pero sí indica una **tendencia positiva fuerte** que merece atención, ya sea para fomentar o para asegurar recursos.\n*   Un **CAGR bajo o negativo** en carreras importantes podría ser una señal para investigar las causas: ¿cambios en el mercado laboral, preferencias estudiantiles, oferta académica?\n*   Es crucial cruzar esta información de CAGR con la matrícula absoluta (del ranking) para obtener una imagen completa.",
  "A3_game2_subheader": "Duelo del Crecimiento",
  "A3_game2_intro": "Algunas carreras crecen a un ritmo vertiginoso mientras otras se contraen. ¿Podrás identificar cuál de las dos opciones ha tenido una mayor tasa de crecimiento promedio anual? ¡Acepta el duelo!",
  "A3_game2_title": "Duelo de Crecimiento",
  "A3_duel_question": "Esta carrera tuvo un **MAYOR** crecimiento promedio que la otra.",
  "A4_header": "♀️♂️ Equilibrando la Balanza: Una Mirada a la Perspectiva de Género",
  "A4_markdown_1": "La universidad no solo forma profesionales, sino que también moldea una sociedad más justa y equitativa. En esta sección, nos adentramos en la composición de género de la matrícula universitaria. ¿Existe un equilibrio entre hombres y mujeres en las aulas? ¿Hay áreas del conocimiento tradicionalmente asociadas a un género que mantienen esos patrones, o estamos presenciando una transformación hacia una mayor paridad? Acompáñanos a descubrirlo.",
  "A4_spinner_1": "Analizando la perspectiva de género...",
  "A4_warning_analysis_failed": "No se pudo realizar el análisis de género. Estado: {status}",
  "A4_fig_ramas_subheader": "Participación Femenina por Rama de Ciencias ({curso})",
  "A4_chart_title_branches": "Porcentaje de Mujeres por Rama de Ciencias ({curso})",
  "A4_chart_yaxis_women_pct": "% Mujeres",
  "A4_fig_ramas_markdown_1": "**El Panorama General por Áreas del Saber:**\nEste gráfico de barras nos muestra el porcentaje de mujeres matriculadas en cada gran rama de ciencias. La línea roja punteada en el 50% representa la paridad perfecta.\n\n*   **Liderazgo Femenino Pronunciado:** Las **Ciencias Pedagógicas** destacan con más del **80%** de matrícula femenina, seguidas de cerca por las **Ciencias Sociales y Humanísticas** y las **Ciencias Médicas**, ambas superando el **70%**. Esto indica una fuerte presencia y preferencia femenina en estas importantes áreas.\n*   **Mayoría Femenina Sostenida:** Las **Ciencias Económicas**, **Ciencias de las Artes** y **Ciencias Naturales y Matemáticas** también muestran una mayoría de mujeres, con porcentajes que oscilan entre el **55% y el 65%**, situándose por encima de la línea de paridad.\n*   **Cerca de la Paridad o Ligera Mayoría Masculina:** Las **Ciencias Agropecuarias** se encuentran más cerca del equilibrio, aunque aún con una ligera mayoría femenina (casi el 50%).\n*   **Desafíos en Áreas Técnicas y Deportivas:** En contraste, las **Ciencias Técnicas** (aproximadamente 35% mujeres) y, de manera más marcada, las **Ciencias de la Cultura Física y el Deporte** (alrededor del 32% mujeres) son las ramas con la menor representación femenina, indicando una persistente brecha de género en estos campos.",
  "A4_info_no_branch_data": "No hay datos de género por ramas para mostrar.",
  "A4_fig_carreras_subheader": "Zoom a las Carreras: Extremos del Espectro de Género ({curso}, Matrícula >= 30)",
  "A4_legend_major_women": "Mayoría Mujeres",
  "A4_legend_minor_women": "Minoría Mujeres",
  "A4_chart_title_careers_gender": "Desbalance de Género en Carreras ({curso}, Matrícula >= 30)",
  "A4_subplot_title_top_women": "Top 10 Carreras con Mayor % de Mujeres",
  "A4_subplot_title_low_women": "Top 10 Carreras con Menor % de Mujeres",
  "A4_fig_carreras_markdown_1": "**Casos Destacados de Mayoría y Minoría Femenina:**\nEstos gráficos nos llevan al detalle de las carreras, mostrando las 10 con mayor porcentaje de mujeres y las 10 con menor porcentaje (es decir, mayor presencia masculina), siempre que tengan una matrícula de al menos 30 estudiantes para asegurar la representatividad.\n\n*   **Feminización Extrema en Algunas Áreas:** Carreras como **Educación Preescolar** se acercan al 100% de matrícula femenina. Otras, como **Técnico Superior en Logofonoaudiología**, **Educación Logopedia** y **Educación Español-Literatura**, también muestran una abrumadora mayoría de mujeres, superando el 90%. Esto es consistente con la alta feminización de las Ciencias Pedagógicas. **Servicios Estomatológicos** y **Estudios Socioculturales** también destacan en este grupo.\n\n*   **Dominio Masculino en Ingenierías y Áreas Técnicas:** En el otro extremo, carreras como **Ingeniería Informática**, **Ingeniería en Automática**, **Ciencias de la Computación**, **Gestión del Proceso Inversionista** y varias **Ingenierías Mecánica, Eléctrica y en Técnicos Superior en Entrenamiento Deportivo** presentan porcentajes de mujeres muy bajos, algunos por debajo del 10% y la mayoría por debajo del 25%. Esto refleja la brecha observada en las Ciencias Técnicas y deportivas a nivel de rama.\n\n*   **Matices Importantes:** Es crucial observar que incluso dentro de las \"Top 10 con Menor % de Mujeres\", los porcentajes varían. Mientras algunas ingenierías apenas superan el 5-10% de presencia femenina, otras pueden estar más cerca del 20-25%.",
  "A4_info_no_career_data": "No hay suficientes datos de carreras para mostrar el análisis de extremos de género.",
  "A4_markdown_2": "---\n**Reflexiones para la Acción:**\n*   La alta feminización en ciertas ramas y carreras es un fenómeno consolidado. Si bien refleja vocaciones, también es importante asegurar que no existan barreras implícitas o desincentivos para la participación masculina en ellas.\n*   El mayor desafío para la equidad de género se encuentra claramente en las **Ciencias Técnicas** y en varias ingenierías específicas, así como en **Ciencias de la Cultura Física y el Deporte**. Se requieren estrategias continuas y efectivas para atraer y retener a más mujeres en estos campos cruciales para el desarrollo tecnológico y social.\n*   Estos datos son una invitación a profundizar: ¿Cuáles son las causas de estos desbalances? ¿Cómo podemos inspirar a las nuevas generaciones a explorar todas las áreas del conocimiento sin sesgos de género?",
  "A4_game1_subheader": "Duelo de Género por Rama",
  "A4_game1_intro": "Algunas áreas del conocimiento atraen a más mujeres que otras. ¿Sabrías decir en cuál de las siguientes ramas hay un mayor porcentaje de matrícula femenina?",
  "A4_game1_title": "Duelo de Ramas",
  "A4_duel_question": "¿Qué rama tiene un porcentaje MÁS ALTO de mujeres?",
  "A4_game2_subheader": "Espera! Hay un intruso entre las carreras!",
  "A4_game2_intro": "Tres de las siguientes carreras tienen una abrumadora mayoría de mujeres en sus aulas. Una de ellas, sin embargo, es un campo predominantemente masculino. ¡Identifica al intruso!",
  "A4_game2_title": "El Intruso de Género",
  "A5_header": "🏛️ Universidades en Perspectiva: Descubriendo Fortalezas y Focos de Especialización",
  "A5_markdown_1": "Cada universidad es un ecosistema único con su propia historia, vocación y áreas de excelencia. En esta sección, cambiamos nuestra perspectiva para analizar cómo se distribuye el talento estudiantil a nivel institucional. ¿Qué universidades concentran la mayor cantidad de estudiantes? ¿Existen centros altamente especializados en ciertas ramas o carreras? ¿Y qué carreras son joyas raras, ofrecidas solo por unas pocas instituciones?",
  "A5_spinner_1": "Analizando la distribución institucional de la matrícula...",
  "A5_warning_analysis_failed": "No se pudo realizar el análisis institucional. Estado: {status}",
  "A5_fig_treemap_subheader": "Mapa Interactivo de la Matrícula Universitaria ({curso})",
  "A5_treemap_root_label": "Todas las Universidades",
  "A5_treemap_title": "Distribución de Matrícula ({curso})",
  "A5_fig_treemap_markdown_1": "**Navegando el Universo Institucional:**\nEste \"mapa de árbol\" (treemap) es una representación visual de la matrícula total.\n*   **El Tamaño Importa:** El área de cada rectángulo es proporcional al número de estudiantes. Comienza con \"Todas las Universidades\"; haz clic en una universidad (ej. `UCLV`, `UH`, `CUJAE`) para ver cómo se desglosa su matrícula por ramas de ciencias. Un nuevo clic en una rama te mostrará las carreras dentro de ella y su peso en esa institución.\n*   **Identifica los Gigantes:** A simple vista, puedes identificar las universidades con mayor volumen de estudiantes. Por ejemplo, la **UO (Universidad de Oriente)**, **UH (Universidad de La Habana)** y **UCMLH (Universidad de Ciencias Médicas de La Habana)**, entre otras, muestran rectángulos considerablemente grandes, indicando una matrícula importante.\n*   **Focos de Especialización:** Observa cómo algunas universidades tienen casi toda su \"área\" concentrada en una o dos ramas (ej. las Universidades de Ciencias Médicas predominantemente en \"Ciencias Médicas\"), mientras otras muestran una mayor diversificación, como se observa, Ciencias Médicas sobresale en todas las universidades que la ofertan.",
  "A5_info_no_treemap_data": "No hay datos disponibles para generar el mapa interactivo.",
  "A5_df_carreras_unicas_subheader": "Joyas Académicas: Carreras por Nivel de Exclusividad",
  "A5_df_carreras_unicas_markdown_new": "Este gráfico agrupa las carreras según el número de universidades que las imparten en el curso {curso}. Cada punto representa una carrera. Pasa el ratón sobre un punto para ver su nombre. Las anotaciones en la parte superior indican cuántas carreras existen en cada grupo de exclusividad.",
  "A5_chart_title_grouped_offer": "Distribución de Carreras por Exclusividad de Oferta",
  "A5_chart_yaxis_num_unis": "Nº de Universidades que la Ofertan",
  "_carrers": "carreras",
  "A5_expander_show_all_data": "Ver la tabla completa con todas las carreras",
  "A5_info_no_limited_offer_data": "No se encontraron datos sobre carreras con oferta limitada.",
  "A5_game1_subheader": "GeoGuesser Universitario",
  "A5_game1_intro": "Antes de analizar las universidades en detalle, ¿conoces su ubicación? ¡Demuéstralo!",
  "A5_game1_title": "Adivina la Provincia",
  "A5_game2_subheader": "Adivina la Exclusividad",
  "A5_game2_intro": "Algunas carreras se imparten en todo el país, mientras que otras son verdaderas rarezas. ¿Qué tan exclusiva crees que es la siguiente carrera?",
  "A5_game2_title": "El Estimador de Exclusividad",
  "A5_subheader_2": "Lupa en Carreras Clave: ¿Quién es Quién en la Formación Específica?",
  "A5_markdown_2": "Selecciona hasta 3 carreras de tu interés. El gráfico mostrará la evolución histórica de la matrícula para esas carreras, desglosada por cada universidad que las imparte. Esto nos permite comparar el peso y la trayectoria de diferentes instituciones en la formación de profesionales en campos específicos.\n\n*Si el gráfico parece muy denso, intenta seleccionar menos carreras o concéntrate en las tendencias generales de las universidades más grandes para cada carrera.*",
  "A5_multiselect_carreras": "Carreras para comparar evoluciones por universidad:",
  "A5_spinner_2": "Generando gráfico comparativo por universidad...",
  "A5_chart_title_uni_comparison": "Evolución por Universidad para: {careers}",
  "A5_chart_yaxis_enrollment": "Matrícula Total",
  "A5_warning_comparison_failed": "No se pudo generar el gráfico comparativo. Causa: {status}",
  "A5_no_carreras_selected": "Por favor, elige al menos una carrera para ver la comparativa.",
  "A5_markdown_3": "---\n**Visiones Estratégicas para la Red de Universidades:**\n*   **Potenciar la Excelencia:** Identificar universidades líderes en carreras clave puede guiar la inversión para convertirlas en centros de referencia nacional o internacional.\n*   **Optimizar Recursos:** El treemap y el análisis de ofertas únicas pueden revelar duplicidades innecesarias o, por el contrario, la necesidad de expandir la oferta de ciertas carreras en más regiones.\n*   **Colaboración Interinstitucional:** Conocer las fortalezas de cada una puede fomentar sinergias, programas conjuntos y movilidad estudiantil y profesoral.",
  "A6_header_1": "🔭 Mirando al Mañana: ¿Qué Podríamos Esperar? (Proyecciones Futuras)",
  "A6_markdown_1": "Anticipar el futuro es un desafío, pero analizar las tendencias recientes nos permite trazar escenarios posibles. En esta sección, volveremos a examinar nuestros indicadores clave de matrícula, pero esta vez extendiendo nuestra mirada dos cursos académicos hacia adelante mediante proyecciones.\n\n⚠️ **Una Brújula, no un Oráculo:** Es fundamental recordar que estas son **proyecciones**, no predicciones infalibles. Se basan en modelos de **Regresión Lineal simple aplicados a los últimos 6 años de datos históricos** (o menos, si los datos son insuficientes para una rama o carrera específica). Múltiples factores no contemplados en estos modelos (cambios de políticas, crisis económicas, nuevas demandas sociales, etc.) podrían alterar significativamente estas trayectorias. Utilicémoslas como una herramienta para la reflexión estratégica y la planificación proactiva, no como un destino escrito en piedra.",
  "A6_chart_title_projection": "Evolución y Proyección (Reg. Lin. {n_years} últimos años)",
  "A6_chart_title_branches_projection": "Evolución y Proyección por Rama (Reg. Lin. {n_years} últimos años o menos)",
  "A6_subheader_1": "Horizonte Nacional: Proyección de la Matrícula Total",
  "A6_spinner_1": "Calculando la proyección de matrícula nacional...",
  "A6_info_1": "Las líneas discontinuas y los puntos en forma de diamante más allá del curso 2024-2025 representan las proyecciones.",
  "A6_markdown_national_explanation": "**Interpretando la Tendencia Nacional Proyectada:**\n\nEl gráfico superior combina la evolución histórica de la matrícula (barras y línea sólida hasta el curso 2024-25) con una proyección para los dos cursos siguientes (línea discontinua con diamantes).\n\n*   **Punto de Partida:** La proyección comienza desde el último dato histórico registrado, que muestra una matrícula nacional de aproximadamente **205,000 estudiantes**.\n*   **Trayectoria Proyectada:** El modelo de regresión lineal, basado en la tendencia de los últimos años, sugiere una **continuación de la fase de ajuste o declive moderado** que se observa en el período más reciente.\n*   **Estimaciones Futuras:**\n    *   Para el curso **2025-2026**, el modelo estima una matrícula que podría situarse en el rango de **195,000 a 215,000 estudiantes**.\n    *   Hacia **2026-2027**, esta cifra podría descender hasta el entorno de los **185,000 a 190,000 estudiantes**.\n*   **Implicación Estratégica:** Si esta tendencia se materializa, plantea preguntas importantes para la planificación: ¿Cómo afectaría esto a la capacidad instalada en las universidades? ¿Requeriría una reevaluación de la asignación de recursos o nuevas estrategias de captación y retención de estudiantes a nivel nacional?",
  "A6_warning_national_proj_failed": "No se pudo generar la proyección nacional. Estado: {status}",
  "A6_fig_A2_subheader": "Saberes del Mañana: Proyección por Rama de Ciencias",
  "A6_fig_A2_spinner": "Calculando la proyección por ramas de ciencias...",
  "A6_warning_branches_proj_failed": "No se pudo generar la proyección por ramas.",
  "A6_fig_A7_subheader_1": "Carreras Clave en el Horizonte: Proyección Interactiva",
  "A6_fig_A7_markdown_1": "Selecciona hasta 3 carreras de tu interés para visualizar su proyección de matrícula individual.",
  "A6_fig_A7_multiselect_1": "Selecciona carreras para proyectar:",
  "A6_fig_A7_spinner_1": "Calculando la proyección para las carreras seleccionadas...",
  "A6_game_subheader": "🔮 El Oráculo de la Matrícula",
  "A6_game_intro": "Antes de revelar las proyecciones del modelo, pongamos a prueba tu intuición como analista. Observa la trayectoria histórica de la matrícula nacional. Basado en esta tendencia, ¿qué crees que ocurrió en el último año registrado? ¿Continuó la tendencia, se estabilizó o se revirtió?",
  "A6_game_item_name": "Matrícula Nacional",
  "A6_game_title": "Predice la Tendencia Nacional",
  "A7_header_1": "💡 Áreas de Atención: Desafíos y Oportunidades Específicas",
  "A7_markdown_1": "Más allá de las grandes tendencias, existen situaciones particulares en carreras y universidades que merecen una lupa especial. Algunas carreras pueden estar emergiendo con vigor, otras podrían haber concluido su ciclo de oferta, y un tercer grupo quizás lucha por atraer un número suficiente de estudiantes. Identificar estos casos no es señalar problemas, sino descubrir oportunidades para una gestión académica más precisa, ágil y adaptada a las realidades cambiantes.",
  "A7_spinner_1": "Identificando casos de atención específica...",
  "A7_error_a8_analysis": "No se pudo completar el análisis de áreas de atención.",
  "A7_a8_subheader_1": "🌱 Sembrando el Futuro: Posibles Nuevas Ofertas o Reactivaciones",
  "A7_a8_markdown_1": "El siguiente gráfico muestra cuántas carreras nuevas o reactivadas se detectaron cada año. Esto revela los períodos de mayor expansión o renovación de la oferta académica.",
  "A7_chart_title_new_offers": "Nuevas Ofertas o Reactivaciones Detectadas por Año",
  "A7_chart_xaxis_year_new_offers": "Año de Detección/Reactivación",
  "A7_expander_new_offers": "Ver la lista completa de las {count} nuevas ofertas detectadas",
  "A7_col_detected_start_year": "Año Inicio Detectado",
  "A7_col_current_enrollment": "Matrícula Actual",
  "A7_info_no_new_offers": "No se identificaron carreras que cumplan claramente con el criterio de nueva oferta o reactivación.",
  "A7_a8_subheader_2": "🍂 Ciclos que Concluyen: Posibles Ceses de Oferta",
  "A7_a8_markdown_2_revised": "Este gráfico resume cuántas carreras dejaron de tener matrícula por año, dándonos una idea de los períodos con mayores ajustes o discontinuaciones en la oferta académica.",
  "A7_chart_title_ceased_offers": "Posibles Ceses de Oferta por Último Año con Matrícula",
  "A7_chart_xaxis_last_year": "Último Año con Matrícula",
  "A7_expander_ceased_offers": "Ver la lista completa de las {count} ofertas posiblemente cesadas",
  "A7_col_last_enrollment_year": "Último Año con Matrícula",
  "A7_info_no_ceased_offers": "No se identificaron carreras que cumplan claramente con el criterio de cese de oferta.",
  "A7_a8_subheader_3": "📉 Focos de Atención: Matrícula Reducida (Inferior a {umbral})",
  "A7_a8_markdown_3_revised": "El siguiente gráfico agrupa las carreras según su nivel de matrícula en el curso {curso}. Cada punto representa una carrera en una universidad específica. Pasa el cursor sobre un punto para ver los detalles. Esto nos ayuda a ver dónde se concentran los casos de matrícula más crítica (ej. 1 o 2 estudiantes).",
  "A7_chart_title_low_enrollment": "Ofertas con Matrícula Reducida (Curso {curso}, < {umbral} Estudiantes)",
  "A7_chart_yaxis_low_enrollment": "Número de Estudiantes",
  "A7_expander_low_enrollment": "Ver la lista completa de las {count} carreras con matrícula baja",
  "A7_col_enrollment_last_year": "Matrícula ({curso})",
  "A7_info_no_low_enrollment": "No se identificaron carreras con matrícula inferior a {umbral} (y >0) en el último año.",
  "A7_conclusion_markdown_1": "---\n**Decisiones Informadas para una Gestión Proactiva:**\nLa información presentada en esta sección es un llamado a la acción específica:\n*   **Nuevas Ofertas / Reactivaciones:**\n    *   **Verificar:** ¿Corresponden a lanzamientos o reactivaciones planificadas?\n    *   **Monitorear:** Evaluar su evolución inicial, necesidades de recursos y estrategias de consolidación.\n    *   **Aprender:** ¿Responden a una demanda social o laboral emergente que podría replicarse?\n*   **Posibles Ceses de Oferta:**\n    *   **Confirmar:** ¿La discontinuación es oficial y definitiva? Actualizar registros si es necesario.\n    *   **Evaluar Impacto:** Si el cese no fue planificado o tiene implicaciones negativas (ej. única oferta en una región), investigar causas.\n*   **Matrícula Reducida:**\n    *   **Análisis Causa-Raíz:** ¿Se trata de carreras altamente especializadas con demanda limitada por naturaleza? ¿Problemas de captación? ¿Desactualización curricular? ¿Falta de pertinencia laboral?\n    *   **Estrategias Diferenciadas:** Dependiendo del diagnóstico, las acciones podrían ir desde la promoción focalizada, rediseño curricular, hasta la consideración de fusión con otras carreras o, en últi ma instancia, una discontinuación planificada si no se justifica su mantenimiento.\n\nUna gestión atenta a estos detalles permite optimizar recursos, responder mejor a las necesidades del país y asegurar la vitalidad y pertinencia de la oferta académica universitaria.",
  "A7_game_subheader": "🕵️‍♂️ Encuentra el Foco de Atención",
  "A7_game_intro": "Entre las múltiples ofertas académicas de las universidades, algunas prosperan con cientos de estudiantes, mientras que otras luchan por mantenerse a flote. A continuación, te presentamos cuatro ofertas universitarias. Tres de ellas tienen una matrícula saludable, pero una es un \"foco de atención\" con una matrícula críticamente baja. ¿Puedes identificar al intruso?",
  "A7_game_title": "El Intruso de Matrícula Baja",
  "A7_chart_yaxis_enrollment": "Matrícula Total",
  "A7_chart_title_projection": "Proyección de Matrícula para Carreras Seleccionadas",
  "a7_proy_warning": "No se pudieron generar datos para la proyección de: {careers}.",
  "a7_void_info": "Selecciona al menos una carrera para ver su proyección.",
  "a7_end_markdown": "---\n**Planificando con Visión de Futuro:**\nEstas proyecciones, con todas sus limitaciones, son un insumo valioso para:\n*   Anticipar necesidades de **infraestructura y profesorado**.\n*   Debatir sobre la **asignación de plazas y recursos** entre diferentes áreas y carreras.\n*   Identificar áreas que podrían requerir **estrategias proactivas** para revertir tendencias negativas o para gestionar un crecimiento sostenible.\n*   Fomentar un diálogo informado sobre el **futuro de la oferta académica** en Cuba.",
  "B1_header_1": "🔬 Playground: Perfil Detallado de Carrera",
  "B1_markdown_1": "Sumérgete en los detalles de la carrera que elijas. Descubre su evolución histórica, su tasa de crecimiento, y un panorama anual de las universidades y la composición de género.",
  "B1_selectbox_label_1": "Selecciona una Carrera para analizar su perfil:",
  "b1_info_select_career": "Por favor, selecciona una Carrera para continuar.",
  "B1_spinner_1_hist": "Generando perfil histórico para {career}...",
  "B1_subheader_1_hist": "Evolución y Crecimiento de: {career}",
  "B1_markdown_1_rama": "Rama de Ciencias",
  "B1_chart_title_evolution_stacked": "Evolución y Composición de Matrícula: {career}",
  "B1_info_no_evolution_data": "No hay datos de evolución disponibles para esta carrera.",
  "B1_slider_label_cagr": "Selecciona el rango de años para el cálculo del CAGR:",
  "B1_subheader_2_snapshot": "Análisis Anual Detallado",
  "B1_slider_label_snapshot": "Selecciona un año para ver los detalles:",
  "B1_spinner_2_snapshot": "Cargando datos para el año {year}...",
  "B1_pie_title_genero_yearly": "Distribución de Género ({curso})",
  "B1_info_no_gender_data_pie": "Sin datos de género para este año.",
  "b1_bar_chart_title": "Matrícula por Universidad",
  "b1_info_no_universities_data_year": "Ninguna universidad registró matrícula en este año.",
  "b1_warning_no_data_for_year": "No se encontraron datos para la carrera '{career}' en el año {year}.",
  "b2_header": "🗺️ Guía de Instituciones: Explora la Oferta Académica por Localidad",
  "b2_intro": "Descubre las instituciones de educación superior en Cuba, filtrando por provincia y municipio. Para cada universidad, encontrarás información general y la oferta académica por ramas y carreras en el año que selecciones.",
  "b2_error_no_institutions_data": "Los datos de instituciones no están disponibles. Esta sección no puede mostrarse.",
  "b2_error_no_enrollment_data": "Los datos de matrícula no están disponibles. La información de oferta será limitada.",
  "b2_subheader_filters": "Filtros de Búsqueda:",
  "b2_label_province": "Provincia:",
  "b2_label_municipality": "Municipio:",
  "b2_label_search_pattern": "Buscar por nombre o sigla de institución (filtro visual):",
  "b2_spinner_loading": "Cargando guía de instituciones...",
  "b2_warning_basic_analysis_failed": "No se pudo cargar la lista básica de instituciones. Estado: {status}",
  "b2_info_showing_unis": "Mostrando {shown} de {total} institución(es) ({last_year}).",
  "b2_warning_no_years_for_detail": "No hay años de matrícula disponibles para ver detalles.",
  "b2_slider_year_detail": "Selecciona el año para ver la oferta académica detallada:",
  "b2_info_no_unis_matched_filters": "No se encontraron instituciones que coincidan con los filtros aplicados.",
  "b2_pie_title_gender_total": "Género Total ({curso})",
  "b2_caption_no_gender_data_for_year": "Sin datos de género disponibles para {curso}.",
  "b2_markdown_academic_offering": "**Oferta Académica ({curso}, ramas y carreras con matrícula):**",
  "b2_info_no_branches_for_year": "Esta institución no tiene ramas de ciencias con oferta activa o carreras con matrícula reportada para {curso}.",
  "conclusion_header": "🏁 Conclusiones y Horizontes Futuros: Forjando la Universidad del Mañana",
  "conclusion_intro": "Hemos viajado a través de una década de datos, explorando el complejo ecosistema de la educación superior en Cuba. Ya sea como analista o como explorador, cada gráfico desbloqueado y cada desafío superado ha sido una pieza de un rompecabezas más grande: la historia de miles de aspiraciones, de esfuerzos institucionales y de la incesante búsqueda del conocimiento que define a nuestra nación.\n\nEste análisis no es un punto final, sino un faro que ilumina el camino recorrido y nos ayuda a discernir los senderos que se abren ante nosotros.",
  "conclusion_success_message": "**La información es poder, y el poder de estos datos reside en nuestra capacidad para transformarlos en acción sabia y visión estratégica.**",
  "conclusion_findings_subheader": "🌟 Destellos del Viaje: Principales Hallazgos",
  "conclusion_findings_text": "Al mirar atrás en nuestro análisis, emergen varios faros que guían nuestra comprensión:\n\n1.  **El Pulso Dinámico de la Nación:** La matrícula universitaria nacional ha mostrado una notable capacidad de expansión, alcanzando picos significativos a principios de la década de 2020, seguida de una fase de ajuste más reciente. Esta fluctuación nos recuerda la sensibilidad del sistema a factores contextuales y la necesidad de una planificación flexible. *(Ref. Sección 1)*\n\n2.  **El Corazón Médico y el Alma Pedagógica:** Las **Ciencias Médicas** se consolidan como la columna vertebral en términos de volumen estudiantil, un testimonio de su importancia estratégica. Las **Ciencias Pedagógicas**, por su parte, han demostrado un dinamismo extraordinario, con un crecimiento masivo seguido de una contracción, reflejando posibles cambios en la demanda o en las políticas de formación docente. *(Ref. Sección 2)*\n\n3.  **El Ascenso de Nuevas Vocaciones:** El análisis de crecimiento (CAGR) ha revelado el despegue impresionante de carreras como **Servicios Estomatológicos** y el vigor de varias **Ingenierías** (Artística, Procesos Agroindustriales, Informática), señalando posibles nuevas fronteras de interés y demanda laboral. *(Ref. Sección 3)*\n\n4.  **Avances y Desafíos en la Equidad de Género:** Si bien Cuba exhibe una alta participación femenina en la educación superior, con muchas ramas y carreras mostrando una mayoría de mujeres, persisten desafíos significativos. La subrepresentación femenina en las **Ciencias Técnicas** e **Ingenierías específicas**, así como en **Ciencias de la Cultura Física y el Deporte**, nos llama a redoblar esfuerzos para construir un panorama verdaderamente equitativo. *(Ref. Sección 4)*\n\n5.  **La Riqueza de la Diversidad Institucional:** Cada universidad aporta su matiz único al sistema. Hemos visto desde grandes centros multidisciplinarios hasta instituciones con una marcada especialización (como las Universidades de Ciencias Médicas). La identificación de carreras con oferta limitada subraya la importancia de una red universitaria coordinada y estratégicamente distribuida. *(Ref. Sección 5)*\n\n6.  **Una Mirada Prudente al Mañana:** Las proyecciones, aunque sujetas a la incertidumbre inherente al futuro, sugieren una posible continuación de la fase de ajuste en la matrícula general y en varias ramas y carreras clave. Esto no es un augurio, sino una invitación a la preparación y a la acción proactiva. *(Ref. Sección 6)*\n\n7.  **La Importancia de los Detalles:** El análisis de \"Áreas de Atención\" nos ha recordado que la salud del sistema también reside en la vitalidad de cada uno de sus componentes, incluyendo las carreras emergentes, aquellas con matrícula reducida o las que podrían estar concluyendo su ciclo. *(Ref. Sección 7)*",
  "conclusion_player_summary_header": "🏆 Resumen de tu Aventura como Explorador",
  "metric_total_score": "Puntuación Final",
  "metric_games_played": "Juegos Completados",
  "metric_analyst_profile": "Perfil de Analista",
  "profile_strategist": "El Estratega",
  "profile_strategist_desc": "Tu fuerte es clasificar y ordenar. Ves el panorama general y pones cada pieza en su lugar.",
  "profile_competitor": "El Competidor",
  "profile_competitor_desc": "Te encantan los duelos. Comparar y elegir al ganador es tu especialidad.",
  "profile_visionary": "El Visionario",
  "profile_visionary_desc": "Tienes un don para estimar cifras y magnitudes con precisión.",
  "profile_prophet": "El Profeta",
  "profile_prophet_desc": "Intuyes las tendencias futuras como nadie. ¡Tu bola de cristal funciona!",
  "profile_cartographer": "El Cartógrafo",
  "profile_cartographer_desc": "Conoces el terreno. Ubicar cada institución en el mapa es tu talento natural.",
  "profile_detective": "El Detective",
  "profile_detective_desc": "Nadie te engaña. Eres un experto en encontrar al elemento que no encaja.",
  "profile_scholar": "El Erudito",
  "profile_scholar_desc": "Respondes preguntas directas con conocimiento y certeza.",
  "profile_explorer": "El Explorador",
  "profile_explorer_desc": "Disfrutas del viaje y aprendes de cada desafío, cubriendo todas las áreas.",
  "leaderboard_header": "Ranking Global de Exploradores",
  "leaderboard_intro": "Compite con otros analistas y deja tu marca en el ranking. ¿Estarás entre los mejores?",
  "player_name_label": "Tu nombre para el ranking:",
  "submit_score_button": "🚀 ¡Enviar mi puntuación!",
  "enter_name_warning": "Por favor, introduce un nombre.",
  "score_submitted_info": "¡Tu puntuación ya ha sido enviada! Gracias por participar.",
  "loading_leaderboard_spinner": "Cargando el ranking...",
  "leaderboard_col_timestamp": "Fecha",
  "leaderboard_col_playername": "Jugador",
  "leaderboard_col_score": "Puntuación",
  "leaderboard_empty_caption": "El ranking está vacío. ¡Sé el primero en aparecer!",
  "leaderboard_connection_warning": "No se pudo conectar al servicio de ranking. La funcionalidad no está disponible en este momento.",
  "conclusion_recommendations_subheader": "🧭 Trazando la Carta de Navegación: Recomendaciones Estratégicas",
  "conclusion_recommendations_text": "Con estos hallazgos como brújula, proponemos las siguientes líneas de acción para la Sede Central y todos los actores involucrados en la Educación Superior cubana:\n\n*   **Fortalecer el Observatorio de la Educación Superior:**\n    *   **Acción:** Mantener y enriquecer este sistema de análisis de datos como una herramienta permanente para el monitoreo de tendencias, la evaluación de políticas y la toma de decisiones informadas.\n    *   **Impacto Esperado:** Mayor agilidad y capacidad de respuesta del sistema a las dinámicas cambiantes.\n\n*   **Fomentar la Pertinencia y la Calidad con Visión de Futuro:**\n    *   **Acción:** Realizar estudios prospectivos continuos sobre las necesidades del desarrollo socioeconómico del país y las demandas del mercado laboral para alinear la oferta académica. Evaluar y actualizar los planes de estudio de carreras con baja demanda o decrecimiento, e invertir en aquellas con potencial de crecimiento y relevancia estratégica.\n    *   **Impacto Esperado:** Egresados mejor preparados para los desafíos del futuro y una mayor contribución de la universidad al desarrollo nacional.\n\n*   **Impulsar la Equidad de Género en Todas las Disciplinas:**\n    *   **Acción:** Diseñar e implementar programas específicos y sostenidos para incentivar la participación femenina en carreras STEM y otras áreas subrepresentadas, y viceversa, abordando estereotipos desde etapas tempranas de la educación.\n    *   **Impacto Esperado:** Un sistema universitario más inclusivo que aproveche el talento de toda la población sin sesgos de género.\n\n*   **Optimizar la Red Universitaria y Promover la Colaboración:**\n    *   **Acción:** Utilizar los análisis de especialización y distribución para tomar decisiones sobre la apertura, fusión o cierre de carreras en diferentes instituciones, buscando la eficiencia, la calidad y la cobertura territorial equitativa. Fomentar la creación de redes de conocimiento y programas interuniversitarios.\n    *   **Impacto Esperado:** Un sistema más cohesionado, con centros de excelencia fortalecidos y una mejor utilización de los recursos disponibles.\n\n*   **Integrar la Voz de los Actores:**\n    *   **Acción:** Complementar los análisis cuantitativos con investigaciones cualitativas que recojan las percepciones y experiencias de estudiantes, profesores, egresados y empleadores.\n    *   **Impacto Esperado:** Decisiones más holísticas y políticas mejor adaptadas a las realidades y expectativas de la comunidad universitaria y la sociedad.",
  "conclusion_final_header": "✨ Un Legado Continuo, Un Futuro Brillante",
  "conclusion_final_paragraph": "El análisis de estos datos no es meramente un ejercicio académico; es un acto de responsabilidad y un compromiso con el futuro. Las Universidades Cubanas, cada una con su rica historia y su papel trascendental en la sociedad, tiene ante sí el desafío y la oportunidad de seguir evolucionando, adaptándose e innovando.\n\nEsperamos que estos datos los inspire a todos a trabajar juntos por una educación superior que no solo responda a las necesidades del presente, sino que activamente modele un mañana más próspero, justo y lleno de conocimiento para todos los jóvenes Cubanos."
}