{
  "settings_title": "Paramètres",
  "save": "Enregistrer",
  "load_df_error": "Erreur critique : Impossible de charger les données ('db.parquet'). L'application ne peut pas continuer.",
  "load_screen_title": "🎓 Analyse Stratégique des Inscriptions Universitaires à Cuba",
  "main_image_caption": "Université de La Havane. Un symbole de l'enseignement supérieur à Cuba.",
  "main_markdown_1": "Un voyage pour éclairer le chemin de l'Enseignement Supérieur.",
  "sidebar_title": "🧭 Explorateur de sections",
  "sidebar_radio_title_main": "Choisissez une section :",
  "sidebar_radio_title_sub_prefix": "Sous-section : ",
  "sidebar_info": "Analyse basée sur les données d'inscription de la période 2015-16 à 2024-25.\n\n -- ⚠️ N'inclut pas l'année académique 2018-2019 en raison d'un manque de données ; les analyses sont effectuées en omettant cette année.",
  "subseccion_not_valid_in": "Sous-section non valide dans ",
  "back": "Précédent : ",
  "next": "Suivant : ",
  "authors": "Auteurs :",
  "author_reynier": "Reynier Ramos González",
  "author_ernesto": "Ernesto Herrera García",
  "lang_select_label": "Langue / Idioma",
  "lang_select_help": "Sélectionnez votre langue de préférence pour l'application.",
  "_women": "Femmes",
  "_men": "Hommes",
  "_total_enrollment": "Inscriptions totales",
  "_total_enrollment_projected": "Inscriptions totales (projetées)",
  "_total_enrollment_historical": "Inscriptions totales (historiques)",
  "_projection_start": "Début de la projection",
  "_academic_year": "Année académique",
  "_enrollment": "Inscriptions",
  "_legend": "Légende",
  "_projected_short": "Proj.",
  "_50_parity": "Parité 50%",
  "_university": "Université",
  "_date": "Donnée",
  "_career": "Filière",
  "_offers": "offres",
  "_elements": "éléments",
  "_number_of_students": "Nombre d'étudiants",
  "_all_provinces": "TOUTES LES PROVINCES",
  "_all_municipalities": "TOUTES LES COMMUNES",
  "_founded_in": "Fondée en",
  "_organism": "Organisme",
  "_address": "Adresse",
  "_main_modality": "Modalité principale",
  "generic_warn_figs": "Impossible de générer le graphique de l'aperçu national (A1).",
  "ask_ai_component": {
    "ai_initial_response_text": "🤖 Des questions sur cette analyse ? Demandez à l'Assistant IA !",
    "restart_conversation": "Réinitialiser cette conversation",
    "your_question_here": "Écrivez votre question ici...",
    "thinking": "Traitement de votre demande...",
    "code_download": "📥 Télécharger le code",
    "generated_image": "Image générée",
    "error_parsing_table": "Erreur lors de l'analyse du tableau"
  },
  "gamification_controller": {
    "confirm_deactivation_title": "Confirmer la désactivation",
    "confirm_deactivation_warning": "Êtes-vous sûr de vouloir désactiver le Mode Jeu ?",
    "confirm_deactivation_text": "Vous ne verrez plus les mini-jeux interactifs et perdrez votre progression actuelle.",
    "confirm_button": "Confirmer",
    "cancel_button": "Annuler",
    "game_mode_label": "**Mode Jeu**",
    "toggle_help": "Active/désactive les mini-jeux interactifs.",
    "progress_header": "🏆 Votre Progression",
    "reset_progress_button": "Réinitialiser la progression",
    "points_metric_label": "Points",
    "games_metric_label": "Jeux",
    "history_expander_label": "Voir l'historique des parties",
    "history_empty": "Vous n'avez pas encore joué. Lancez-vous !",
    "history_item_text": "{icon} **{game_title}** : *+{points_earned} pts*",
    "round": "Manche",
    "detailed_analysis_revealed": "Analyse Détaillée :",
    "feedback_victory": "Victoire ! Vous avez réussi le défi avec **{total_score}** points.",
    "feedback_defeat": "Presque ! Vous avez obtenu **{total_score}** points. Réessayez !",
    "feedback_game_over_text": "Vous avez obtenu un total de **{total_score}** points.",
    "see_round_summary": "Voir le résumé détaillé des manches",
    "submit_button_label": "Vérifier !",
    "please_pick_an_action": "Veuillez effectuer une action avant de vérifier.",
    "SimpleQuestionMinigame": {
      "minigame_prefix": "Mini-jeu :",
      "choose_your_answer": "Choisissez votre réponse :"
    },
    "DataDuelMinigame": {
      "data_duel_title": "Duel de Données",
      "duel_question": "Lequel a la valeur la plus élevée ?"
    },
    "ClassifierMinigame": {
      "classifier_title": "Le Classificateur",
      "classifier_drag_info": "💡 Faites glisser les éléments pour les classer du plus grand au plus petit."
    },
    "OracleMinigame": {
      "oracle_title": "L'Oracle",
      "oracle_question": "Observez l'évolution et prédisez la tendance."
    },
    "EstimatorMinigame": {
      "estimator_title": "L'Estimateur",
      "estimator_instructions": "Utilisez le curseur pour estimer la valeur. Plus vous êtes proche, plus vous gagnez de points !",
      "estimator_question": "Quelle est la valeur pour **{item_name}** ?",
      "_your_estimation": "Votre estimation",
      "estimator_result_shower": "**Résultat pour '{item_name}' (Manche {round_num})**",
      "_real_value": "Valeur réelle",
      "estimator_claim_victory": "Excellente estimation ! Vous avez obtenu **{score}** points.",
      "estimator_good_try": "Bon essai ! Vous avez obtenu **{score}** points."
    },
    "GeoGuesserMinigame": {
      "geoguesser_title": "GeoGuesser",
      "geoguesser_instructions": "Sélectionnez la bonne province pour l'établissement suivant.",
      "_where_is_it": "Où se trouve-t-il ?"
    },
    "ImpostorMinigame": {
      "impostor_title": "Trouvez l'intrus",
      "impostor_instructions": "Trois de ces éléments appartiennent au même groupe. Quel est l'intrus ?"
    }
  },
  "introduction_header": "🎯 Bienvenue au Cœur de l'Enseignement Supérieur Cubain",
  "introduction_markdown_1": "Une université n'est pas seulement un bâtiment ; c'est un creuset de rêves, un moteur de progrès et le reflet des aspirations d'une société. Dans cet espace, nous nous lancerons dans un voyage analytique, explorant les courants qui façonnent les inscriptions universitaires à Cuba.\n\nDes tendances générales aux détails de chaque filière et université, nous démêlerons les histoires cachées derrière les différentes universités du pays. L'objectif ? Fournir une boussole basée sur des preuves pour la prise de décisions stratégiques, favorisant un système d'enseignement supérieur plus fort, plus équitable et aligné sur l'avenir de la nation.",
  "intro_choose_your_path_header": "🛣️ Choisissez Votre Chemin : Comment Voulez-vous Explorer ?",
  "intro_choose_your_path_text": "Ce voyage à travers les données peut emprunter deux voies. Choisissez celle qui correspond le mieux à votre style.",
  "intro_analyst_path_title": "👨‍🏫 La Voie de l'Analyste",
  "intro_analyst_path_desc": "Idéal si vous voulez aller droit au but. Accédez à tous les graphiques et analyses directement, sans interruptions. Parfait pour une exploration rapide et ciblée.",
  "intro_analyst_path_button": "Activer le Mode Analyse",
  "intro_explorer_path_title": "🎮 Le Sentier de l'Explorateur",
  "intro_explorer_path_desc": "Transformez l'analyse en défi. Dans chaque section, vous ferez face à des mini-jeux pour tester votre intuition sur les données avant de les voir. Gagnez des points et concourez !",
  "intro_explorer_path_button": "Activer le Mode Jeu",
  "intro_game_mode_active_info": "🕹️ **Mode Jeu Activé !** Préparez-vous pour les défis. Vous pouvez voir votre progression en appuyant sur le bouton '🏆' qui apparaît dans le coin inférieur droit.",
  "intro_analysis_mode_active_info": "📊 **Mode Analyse Activé.** Vous êtes prêt pour une exploration directe des données. Vous pouvez changer de mode à tout moment dans la barre latérale.",
  "introduction_sucess": "Votre voyage commence ici ! Sélectionnez une section dans le menu latéral ou utilisez le bouton 'Suivant'.",
  "A1_header": "🌍 Le Pouls National : Comment Battent les Inscriptions Universitaires ?",
  "A1_markdown_1": "Imaginons que nous puissions prendre le pouls de l'ensemble du système universitaire cubain sur une décennie. Quel a été son rythme ? A-t-il connu des moments de croissance vigoureuse, des périodes de stabilité, ou peut-être des phases où le battement est devenu plus lent ?\n\nCette première section nous offre une vue panoramique des inscriptions totales au niveau national, nous permettant d'identifier les grandes tendances qui ont marqué le système d'enseignement supérieur ces dernières années. C'est notre point de départ pour comprendre le contexte général avant de nous plonger dans des analyses plus spécifiques.",
  "A1_spinner_1": "Construction du graphique A1, veuillez patienter...",
  "A1_chart_title_historical": "Inscriptions Nationales : Évolution Historique",
  "A1_fig_1_subheader": "Déchiffrer le Rythme de la Décennie (2015-2025) :",
  "A1_fig_1_markdown_1": "En observant la trajectoire des inscriptions nationales totales dans le graphique ci-dessus, nous pouvons identifier plusieurs phases clés :\n\n*   **Impulsion Initiale (2015-16 à 2016-17) :** Le voyage commence lors de l'année académique 2015-2016 avec un chiffre d'environ **165 000 étudiants**. L'année suivante montre une légère augmentation, établissant une base solide pour la croissance à venir.\n\n*   **Croissance Soutenue vers le Sommet (2017-18 à 2020-21) :** À partir de l'année 2017-18, et malgré l'absence de données pour 2018-19, la tendance à la hausse reprend avec force pour atteindre son **point culminant lors de l'année académique 2020-2021, dépassant les 285 000 étudiants**. Cette période représente la phase de plus grande expansion des inscriptions de la décennie.\n\n*   **Plateau et Début du Déclin (2021-22 à 2022-23) :** L'année 2021-2022 montre une légère contraction par rapport au pic, marquant le début d'une nouvelle phase. Les inscriptions restent élevées mais ne croissent plus, et en 2022-23, la baisse devient plus évidente.\n\n*   **Ajustement Récent (2023-24 à 2024-25) :** Les deux dernières années académiques enregistrées montrent une **continuation de la tendance à la baisse**, avec des inscriptions totales se situant autour de **205 000 étudiants** pour la période la plus récente. Cela suggère un réajustement du système après le pic d'expansion.",
  "A1_ai_context": "L'analyse actuelle porte sur l'évolution des inscriptions nationales totales, hommes et femmes, à Cuba de 2015 à 2025. Les données, présentées dans le graphique, montrent un pic significatif vers 2020-2021 suivi d'une baisse.",
  "A1_peak_enrollment_label": "Inscriptions Nationales l'Année du Pic ({curso})",
  "A1_game_subheader": "À l'épreuve : L'Ampleur du Pic",
  "A1_game_intro": "Le système universitaire cubain a atteint un nombre maximum d'étudiants à un moment de la dernière décennie. Avant de voir le graphique, quelle est votre intuition ? Essayez d'estimer ce chiffre maximum.",
  "A1_game_title": "L'Estimateur du Pic National",
  "A1_estimator_question": "Combien d'étudiants pensez-vous qu'il y avait dans tout le pays pendant l'année académique avec le plus grand nombre d'inscrits ({curso}) ?",
  "A2_header": "📚 Une Mosaïque de Savoirs : Vers Où se Tournent les Futurs Professionnels ?",
  "A2_markdown_1": "L'université est un vaste jardin où s'épanouissent diverses disciplines. Chaque branche du savoir, des Sciences Médicales ou des Mathématiques aux Arts, représente un chemin unique de formation et de contribution à la société. Dans cette section, nous décomposons les inscriptions totales pour voir comment les étudiants se répartissent entre ces grands domaines, dans le but de répondre à des questions comme :\n- Y a-t-il des protagonistes clairs ?\n- Comment l'intérêt des étudiants a-t-il évolué au cours de la dernière décennie ?",
  "A2_fig_a2_abs_subheader": "La Force de Chaque Branche : Évolution Historique des Inscriptions",
  "A2_spinner_1": "Analyse de l'évolution des branches scientifiques...",
  "A2_chart_title_evolution": "Évolution Historique par Branche",
  "A2_yaxis_title_enrollment_branch": "Inscriptions par Branche Scientifique",
  "A2_legend_title_branch": "Branche Scientifique",
  "A2_fig_a2_abs_markdown_1": "**Chaque Ligne, un Courant de Savoir :**\nCe graphique retrace le parcours des inscriptions absolues (nombre total d'étudiants) pour chaque branche scientifique au fil des ans.\n\n*   **Leadership Remarquable :** Les **Sciences Médicales** (ligne bleu-vert) se distinguent comme la branche avec le plus grand nombre d'inscrits de manière constante sur toute la période, partant d'environ 70 000 étudiants en 2015-16, atteignant un pic impressionnant de près de **95 000 étudiants en 2020-2021**, et bien qu'elles connaissent une baisse ultérieure, elles restent la force principale, terminant en 2024-2025 avec plus de 70 000 étudiants.\n\n*   **Poursuite et Dynamisme :** Les **Sciences Pédagogiques** (ligne orange) montrent une trajectoire très dynamique. Elles commencent avec un nombre important d'inscrits (environ 30 000), connaissent une croissance remarquable pour dépasser **65 000 étudiants en 2020-2021 et 2021-2022**, devenant la deuxième plus grande branche pendant ces années. Cependant, elles subissent une forte baisse ces dernières années, terminant près de 40 000 étudiants.\n\n*   **Bloc Intermédiaire Constant :** Un groupe de branches maintient une présence stable, bien qu'avec des fluctuations :\n    *   Les **Sciences Techniques** (ligne rose) et les **Sciences Sociales et Humaines** (ligne bleu ciel) montrent des trajectoires parallèles, passant d'environ 20 000 étudiants à un pic d'environ **30 000-32 000** entre 2020-21 et 2021-22, pour ensuite baisser et se situer autour de 23 000-25 000 étudiants à la fin de la période.\n    *   Les **Sciences Économiques** (ligne rouge) présentent une croissance plus modérée mais constante jusqu'en 2021-22 (atteignant environ 24 000 étudiants), suivie d'une baisse similaire à d'autres branches, terminant près de 15 000.\n    *   Les **Sciences Agricoles** (ligne bleu foncé) et les **Sciences de la Culture Physique et du Sport** (ligne vert foncé/marron) restent dans une fourchette inférieure, généralement entre 5 000 et 15 000 étudiants, avec des pics vers 2020-2021 et des baisses ultérieures.\n\n*   **Niche Spécialisée :** Les **Sciences Naturelles et Mathématiques** (ligne violette) et les **Sciences des Arts** (ligne mauve) représentent les branches avec le plus faible volume d'inscriptions, restant constamment en dessous de 5 000 étudiants tout au long de la décennie. Cela suggère une forte spécialisation ou une demande plus limitée.",
  "A2_fig_a2_pct_subheader": "Le Partage du Gâteau Académique : Distribution Pourcentuelle Historique",
  "A2_chart_title_distribution": "Distribution Pourcentuelle Historique des Inscriptions par Branche Scientifique",
  "A2_yaxis_label_percentage": "% Inscriptions",
  "A2_fig_a2_pct_markdown_1": "**Proportions sur la Toile Universitaire :**\nCe graphique en aires empilées nous montre quelle \"part du gâteau\" chaque branche scientifique a représenté dans le total des inscriptions universitaires à chaque année académique.\n\n*   **Domination Persistante des Sciences Médicales :** La large bande bleu-vert en haut confirme que les Sciences Médicales ont constamment représenté la plus grande proportion d'étudiants, occupant près de **40-50% du total** à son apogée (vers 2016-17 et de nouveau vers 2024-2025, après une légère réduction de pourcentage au milieu de la période).\n\n*   **Ascension et Déclin des Sciences Pédagogiques :** La bande orange des Sciences Pédagogiques montre un changement intéressant dans son poids relatif. Elle commence comme une portion importante, s'étend considérablement pour représenter la deuxième plus grande proportion (atteignant presque **25-30%** du total vers 2019-2021), mais réduit ensuite sa part en pourcentage ces dernières années.\n\n*   **Stabilité Relative au Milieu :** Les Sciences Techniques (bande marron/ocre), Sociales et Humaines (bande bleu ciel) et Économiques (bande bleu foncé) maintiennent des proportions plus stables au fil du temps, bien qu'avec de légères variations. Ensemble, elles constituent généralement une part importante du corps étudiant. Par exemple, les Sciences Sociales et Humaines semblent occuper de manière constante environ 10-15%.\n\n*   **Poids Pourcentuel Plus Faible :** Les autres branches (Agricoles, Culture Physique, Naturelles et Mathématiques, Arts) représentent individuellement des pourcentages plus faibles des inscriptions totales, ce qui est cohérent avec leur plus faible volume absolu d'étudiants.\n\nCette analyse en pourcentage est cruciale car elle nous permet de comprendre non seulement combien d'étudiants il y a dans chaque branche, mais aussi comment l'intérêt ou la capacité d'admission est répartie par rapport à l'ensemble du système universitaire.",
  "A2_subhead_popularity": "Classement de popularité : quels domaines du savoir sont en tête ?",
  "A2_intro_game1": "Avant de plonger dans les graphiques, testons votre perception. À travers Cuba, des milliers d'étudiants choisissent leur voie professionnelle chaque année. Quelles branches du savoir pensez-vous qu'attirent le plus d'étudiants universitaires ? Pourriez-vous classer les principaux domaines selon leur popularité ?",
  "A2_game_title": "Le Classificateur du Savoir",
  "A2_subheader_2": "🔗 Interconnexions dans la Croissance : Comment les Branches sont-elles Liées ?",
  "A2_markdown_2": "Toutes les branches scientifiques ne croissent ou ne décroissent pas de manière isolée. Certaines peuvent montrer des tendances d'inscription similaires au fil du temps, tandis que d'autres peuvent avoir des dynamiques plus indépendantes. La carte de chaleur suivante visualise la **corrélation de la variation annuelle en pourcentage des inscriptions** entre les différentes branches scientifiques.\n\n*   Une **valeur proche de 1 (bleu foncé/violet intense)** indique une forte corrélation positive : lorsqu'une branche croît, l'autre a tendance à croître également pendant la même période.\n*   Une **valeur proche de -1 (non visible dans cet exemple, ce serait l'autre extrémité de l'échelle de couleurs)** indiquerait une forte corrélation négative : lorsqu'une branche croît, l'autre a tendance à décliner.\n*   Une **valeur proche de 0 (couleurs plus claires/neutres)** suggère peu ou pas de relation linéaire dans leurs modèles de croissance annuels.",
  "A2_corr_title": "Matrice de Corrélation de la Croissance Annuelle entre les Branches Scientifiques",
  "A2_corr_legend": "Coeff. de corrélation",
  "A2_fig_corr_expander": "🔍 Analyse Détaillée des Corrélations Observées",
  "A2_fig_corr_markdown_1": "**Observations Clés de la Carte de Corrélation :**\n\n*   **Forte Synchronisation :** Une **forte corrélation positive (valeurs > 0,9)** est observée dans les tendances de croissance annuelle entre :\n    *   **Sciences Agricoles et Sciences Économiques** (environ 0,98)\n    *   **Sciences Agricoles et Sciences Pédagogiques** (environ 0,98)\n    *   **Sciences Agricoles et Sciences de la Culture Physique et du Sport** (environ 0,96)\n    *   Ainsi qu'entre les **Sciences Économiques, Pédagogiques et de la Culture Physique**, toutes montrant des coefficients très élevés entre elles.\n    Cela suggère que ces branches connaissent souvent des impulsions de croissance (ou de contraction) de manière très similaire et simultanée, possiblement en raison de facteurs macroéconomiques, de politiques éducatives globales ou de cycles de demande étudiante qui les affectent conjointement.\n\n*   **Corrélations Positives Modérées :**\n    *   Les **Sciences Médicales** montrent une corrélation positive modérée (généralement entre 0,5 et 0,7) avec plusieurs autres branches comme les Sciences Économiques, Sociales et Humaines, et Techniques. Cela pourrait indiquer que le secteur médical, bien qu'ayant ses propres dynamiques, bénéficie également ou participe à des tendances d'expansion plus larges dans l'enseignement supérieur.\n    *   Les **Sciences Techniques** sont également modérément corrélées avec la plupart des autres branches, suggérant un lien avec le cycle général du système.\n\n*   **Indépendance Relative Notable :**\n    *   Les **Sciences Naturelles et Mathématiques** se distinguent par les **corrélations les plus faibles** avec presque toutes les autres branches (coefficients souvent entre 0,2 et 0,4). Cela indique que leur modèle de croissance des inscriptions semble assez indépendant des fluctuations affectant d'autres grands domaines de la connaissance. Cette branche pourrait être influencée par des facteurs très spécifiques, tels que des programmes de promotion scientifique particuliers ou une demande plus spécialisée et moins sensible aux tendances générales.\n    *   Les **Sciences des Arts** montrent également des corrélations plus faibles avec certaines des plus grandes branches comme les Sciences Pédagogiques, bien qu'elles aient une corrélation modérée intéressante avec les Sciences Médicales.\n\n*   **Implications Stratégiques :**\n    *   La forte synchronisation entre certaines branches suggère que les stratégies de planification et d'allocation des ressources pourraient tenir compte de ces \"clusters\" de comportement.\n    *   L'indépendance des Sciences Naturelles et Mathématiques pourrait nécessiter une approche et un suivi différenciés pour assurer leur vitalité et leur alignement avec les besoins de développement scientifique et technique du pays.\n    *   L'absence de corrélations fortement négatives (dans ce graphique) suggère que, au niveau agrégé de la variation annuelle, il n'y a pas de \"cannibalisation\" évidente où la croissance d'une branche se fait directement au détriment d'une autre, bien que des dynamiques concurrentielles à des niveaux plus spécifiques ne soient pas exclues.",
  "A2_corr_warn_1": "Impossible de générer la carte de corrélation entre les branches.",
  "A2_subhead_correlation": "Synergies cachées : quelles branches croissent ensemble ?",
  "A2_intro_game2": "Les branches du savoir ne sont pas des îles. Leurs tendances de croissance sont souvent liées. Certaines évoluent en parfaite synchronie, tandis que d'autres dansent à leur propre rythme. Lorsque l'intérêt pour les Sciences Pédagogiques augmente, quel autre domaine pensez-vous bénéficie d'une impulsion similaire ? Acceptez le duel et découvrez-le !",
  "A2_game_title_corr": "Duel de Synergies",
  "A2_duel_question_corr": "La croissance des **Sciences Pédagogiques** est PLUS similaire à :",
  "A3_header": "🔍 Les Filières à la Loupe : Popularité, Tendances et Dynamisme",
  "A3_markdown_1": "Après avoir exploré les grandes branches du savoir, il est temps de concentrer notre attention sur les unités fondamentales : les filières universitaires. Lesquelles suscitent le plus grand intérêt des étudiants ? Comment a été leur évolution individuelle ? Et, très important, lesquelles montrent une croissance accélérée et lesquelles semblent perdre de leur élan ?",
  "A3_subheader_2": "🏆 Le Podium des Filières : Lesquelles Dominent les Inscriptions Actuelles ?",
  "A3_spinner_1": "Analyse du classement et de l'évolution des filières principales...",
  "A3_warning_analysis_failed": "Impossible d'effectuer l'analyse de popularité des filières. État : {status}",
  "A3_markdown_2": "À gauche, nous voyons le classement de toutes les filières selon leurs inscriptions totales pour l'année académique la plus récente ({year_range}). À droite, nous voyons l'évolution historique des inscriptions pour les {top_n} filières qui sont actuellement en tête de ce classement.",
  "A3_chart_title_evolution": "Évolution Historique (Top {n} Filières Actuelles)",
  "A3_chart_yaxis_enrollment": "Inscriptions Totales par Filière",
  "A3_col_evo_top_info": "Aucun graphique d'évolution n'a été généré pour les filières actuellement en tête.",
  "A3_markdown_3": "**Points Clés du Podium :**\n*   **Leadership Incontesté :** La **Médecine** est solidement positionnée comme la filière avec le plus grand nombre d'inscrits (35 889 étudiants), une constante que nous avions déjà entrevue en analysant les branches du savoir.\n*   **Forces Significatives :** Suivent la **Culture Physique** (14 695) et l'**Éducation Primaire** (12 867), démontrant une demande considérable dans ces domaines.\n*   **Top 5 Robuste :** Les **Soins Infirmiers** (9 999) et la **Comptabilité et Finance** (9 883) complètent le top 5, toutes deux avec des inscriptions très proches de 10 000 étudiants.\n*   **Évolution des Leaders :** Le graphique de droite nous permet de voir comment ces filières (et d'autres du top 10) ont atteint leur position actuelle. Notez comment certaines ont eu une croissance plus soutenue, tandis que d'autres montrent des pics et des creux plus prononcés.",
  "A3_game1_subheader": "À l'épreuve : Le Classement de Popularité",
  "A3_game1_intro": "Avant de voir le classement complet, quelle est votre intuition sur la demande étudiante ? Nous vous présentons une sélection de filières. Classez-les de la plus populaire à la moins populaire selon les inscriptions de la dernière année !",
  "A3_game1_title": "Le Classificateur de Filières",
  "A3_subheader_4": "🚀 Le Rythme du Changement : Quelles Filières Décollent ou Atterrissent ?",
  "A3_markdown_4": "Le **Taux de Croissance Annuel Composé (TCAC)** nous offre une perspective sur le dynamisme. Il calcule la croissance (ou la baisse) annuelle moyenne en pourcentage des inscriptions d'une filière, en considérant toute la période analysée. Un TCAC élevé suggère une expansion rapide.",
  "A3_spinner_4": "Calcul du dynamisme des filières (TCAC)...",
  "A3_warning_cagr_failed": "Impossible d'effectuer l'analyse de croissance (TCAC). État : {status}",
  "A3_chart_title_cagr_top": "Top 15 par Croissance Annuelle Moyenne la Plus Élevée {periodo}",
  "A3_chart_title_cagr_bottom": "Top 15 par Baisse Annuelle Moyenne la Plus Élevée {periodo}",
  "A3_cagr_top_title": "📈 Top 15 avec la Plus Forte Croissance",
  "A3_col_cagr_top_markdown_2": "Ces filières ont connu l'expansion la plus remarquable de leurs inscriptions annuelles moyennes.\n*   **Décollage Surprenant :** Les **Services Stomatologiques** sont en tête avec un TCAC supérieur à 100 %, ce qui indique un doublement (ou plus) de leurs inscriptions moyennes année après année.\n*   **Ingénierie en plein essor :** Plusieurs domaines de l'ingénierie comme l'**Ingénierie Artistique**, les **Procédés Agro-industriels** et l'**Informatique** montrent une croissance très saine.\n*   **Éducation avec un élan :** Des branches de l'éducation comme l'**Éducation Préscolaire**, **Agricole** et **Primaire** figurent également avec un TCAC positif et significatif.",
  "A3_cagr_bottom_title": "📉 Top 15 avec la Plus Forte Baisse",
  "A3_col_cagr_bottom_markdown_2": "À l'autre extrémité, ces filières ont vu leurs inscriptions annuelles moyennes diminuer ou croître à un rythme beaucoup plus lent.\n*   **Ajustements Notables :** Les **Études Socioculturelles** et la **Stomatologie** (à ne pas confondre avec les Services Stomatologiques) présentent les plus fortes baisses moyennes.\n*   **Défis Divers :** Des filières comme l'**Ingénierie Agricole**, les **Arts Visuels**, les **Mathématiques**, la **Musique** et plusieurs **Ingénieries** (Hydraulique, Civile, Télécommunications, Industrielle) apparaissent également dans cette liste, suggérant une révision de leurs tendances.",
  "A3_markdown_5": "**Réflexions Stratégiques à partir de ces Rythmes :**\n*   Un **TCAC élevé** ne signifie pas toujours un nombre total d'inscrits massif (il pourrait s'agir d'une petite filière qui croît rapidement), mais il indique une **forte tendance positive** qui mérite attention, que ce soit pour encourager ou pour sécuriser les ressources.\n*   Un **TCAC faible ou négatif** dans des filières importantes pourrait être un signal pour enquêter sur les causes : changements sur le marché du travail, préférences des étudiants, offre académique ?\n*   Il est crucial de croiser cette information du TCAC avec les inscriptions absolues (du classement) pour obtenir une image complète.",
  "A3_game2_subheader": "Duel de Croissance",
  "A3_game2_intro": "Certaines filières croissent à un rythme effréné tandis que d'autres se contractent. Pouvez-vous identifier laquelle des deux options a eu un taux de croissance annuel moyen plus élevé ? Acceptez le duel !",
  "A3_game2_title": "Duel de Croissance",
  "A3_duel_question": "Cette filière a eu une croissance moyenne **PLUS ÉLEVÉE** que l'autre.",
  "A4_header": "♀️♂️ Équilibrer la Balance : Un Regard sur la Perspective de Genre",
  "A4_markdown_1": "L'université ne forme pas seulement des professionnels, elle façonne également une société plus juste et équitable. Dans cette section, nous nous penchons sur la composition par genre des inscriptions universitaires. Y a-t-il un équilibre entre les hommes et les femmes dans les salles de classe ? Y a-t-il des domaines de connaissance traditionnellement associés à un genre qui maintiennent ces schémas, ou assistons-nous à une transformation vers une plus grande parité ? Rejoignez-nous pour le découvrir.",
  "A4_spinner_1": "Analyse de la perspective de genre...",
  "A4_warning_analysis_failed": "Impossible d'effectuer l'analyse de genre. État : {status}",
  "A4_fig_ramas_subheader": "Participation Féminine par Branche Scientifique ({curso})",
  "A4_chart_title_branches": "Pourcentage de Femmes par Branche Scientifique ({curso})",
  "A4_chart_yaxis_women_pct": "% Femmes",
  "A4_fig_ramas_markdown_1": "**Le Grand Panorama par Domaine de Savoir :**\nCe graphique à barres nous montre le pourcentage de femmes inscrites dans chaque grande branche scientifique. La ligne rouge en pointillés à 50 % représente la parité parfaite.\n\n*   **Leadership Féminin Prononcé :** Les **Sciences Pédagogiques** se distinguent avec plus de **80 %** d'inscriptions féminines, suivies de près par les **Sciences Sociales et Humaines** et les **Sciences Médicales**, toutes deux dépassant les **70 %**. Cela indique une forte présence et préférence féminine dans ces domaines importants.\n*   **Majorité Féminine Soutenue :** Les **Sciences Économiques**, les **Sciences des Arts** et les **Sciences Naturelles et Mathématiques** montrent également une majorité de femmes, avec des pourcentages allant de **55 % à 65 %**, se situant au-dessus de la ligne de parité.\n*   **Proche de la Parité ou Légère Majorité Masculine :** Les **Sciences Agricoles** sont plus proches de l'équilibre, bien qu'avec encore une légère majorité féminine (presque 50 %).\n*   **Défis dans les Domaines Techniques et Sportifs :** En revanche, les **Sciences Techniques** (environ 35 % de femmes) et, de manière plus marquée, les **Sciences de la Culture Physique et du Sport** (environ 32 % de femmes) sont les branches avec la plus faible représentation féminine, indiquant un écart de genre persistant dans ces domaines.",
  "A4_info_no_branch_data": "Aucune donnée de genre par branche n'est disponible à afficher.",
  "A4_fig_carreras_subheader": "Zoom sur les Filières : Extrêmes du Spectre de Genre ({curso}, Inscriptions >= 30)",
  "A4_legend_major_women": "Majorité de Femmes",
  "A4_legend_minor_women": "Minorité de Femmes",
  "A4_chart_title_careers_gender": "Déséquilibre de Genre dans les Filières ({curso}, Inscriptions >= 30)",
  "A4_subplot_title_top_women": "Top 10 des Filières avec le Plus Grand % de Femmes",
  "A4_subplot_title_low_women": "Top 10 des Filières avec le Plus Faible % de Femmes",
  "A4_fig_carreras_markdown_1": "**Cas Marquants de Majorité et Minorité Féminine :**\nCes graphiques nous emmènent dans le détail des filières, montrant les 10 avec le plus grand pourcentage de femmes et les 10 avec le plus faible pourcentage (c'est-à-dire une plus grande présence masculine), à condition qu'elles aient au moins 30 inscrits pour garantir la représentativité.\n\n*   **Féminisation Extrême dans Certains Domaines :** Des filières comme l'**Éducation Préscolaire** approchent les 100 % d'inscriptions féminines. D'autres, comme **Technicien Supérieur en Orthophonie et Audiologie**, **Éducation en Orthophonie** et **Éducation Espagnol-Littérature**, montrent également une écrasante majorité de femmes, dépassant les 90 %. Cela est cohérent avec la forte féminisation des Sciences Pédagogiques. Les **Services Stomatologiques** et les **Études Socioculturelles** se distinguent également dans ce groupe.\n\n*   **Domination Masculine en Ingénierie et Domaines Techniques :** À l'autre extrême, des filières comme l'**Ingénierie Informatique**, l'**Ingénierie en Automatique**, les **Sciences de l'Informatique**, la **Gestion des Processus d'Investissement** et plusieurs **Ingénieries Mécanique, Électrique et Techniciens Supérieurs en Entraînement Sportif** présentent des pourcentages de femmes très faibles, certains en dessous de 10 % et la plupart en dessous de 25 %. Cela reflète l'écart observé dans les Sciences Techniques et sportives au niveau de la branche.\n\n*   **Nuances Importantes :** Il est crucial de noter que même au sein du \"Top 10 avec le Plus Faible % de Femmes\", les pourcentages varient. Alors que certaines filières d'ingénierie dépassent à peine 5-10 % de présence féminine, d'autres peuvent être plus proches de 20-25 %.",
  "A4_info_no_career_data": "Pas assez de données sur les filières pour montrer l'analyse des extrêmes de genre.",
  "A4_markdown_2": "---\n**Réflexions pour l'Action :**\n*   La forte féminisation dans certaines branches et filières est un phénomène consolidé. Bien qu'elle reflète des vocations, il est également important de s'assurer qu'il n'existe pas de barrières implicites ou de désincitations à la participation masculine.\n*   Le plus grand défi pour l'équité des genres se situe clairement dans les **Sciences Techniques** et dans plusieurs filières d'ingénierie spécifiques, ainsi que dans les **Sciences de la Culture Physique et du Sport**. Des stratégies continues et efficaces sont nécessaires pour attirer et retenir plus de femmes dans ces domaines cruciaux pour le développement technologique et social.\n*   Ces données sont une invitation à approfondir : Quelles sont les causes de ces déséquilibres ? Comment pouvons-nous inspirer les nouvelles générations à explorer tous les domaines de la connaissance sans préjugés de genre ?",
  "A4_game1_subheader": "Duel de Genre par Branche",
  "A4_game1_intro": "Certains domaines de connaissance attirent plus de femmes que d'autres. Sauriez-vous dire dans laquelle des branches suivantes il y a un plus grand pourcentage d'inscriptions féminines ?",
  "A4_game1_title": "Duel de Branches",
  "A4_duel_question": "Quelle branche a un pourcentage PLUS ÉLEVÉ de femmes ?",
  "A4_game2_subheader": "Attendez ! Il y a un intrus parmi les filières !",
  "A4_game2_intro": "Trois des filières suivantes ont une écrasante majorité de femmes dans leurs salles de classe. Une d'entre elles, cependant, est un domaine à prédominance masculine. Identifiez l'intrus !",
  "A4_game2_title": "L'Intrus de Genre",
  "A5_header": "🏛️ Les Universités en Perspective : Découvrir les Forces et les Domaines de Spécialisation",
  "A5_markdown_1": "Chaque université est un écosystème unique avec sa propre histoire, sa vocation et ses domaines d'excellence. Dans cette section, nous changeons de perspective pour analyser comment le talent étudiant est réparti au niveau institutionnel. Quelles universités concentrent le plus grand nombre d'étudiants ? Existe-t-il des centres hautement spécialisés dans certaines branches ou filières ? Et quelles filières sont des joyaux rares, offertes seulement par quelques institutions ?",
  "A5_spinner_1": "Analyse de la répartition institutionnelle des inscriptions...",
  "A5_warning_analysis_failed": "Impossible d'effectuer l'analyse institutionnelle. État : {status}",
  "A5_fig_treemap_subheader": "Carte Interactive des Inscriptions Universitaires ({curso})",
  "A5_treemap_root_label": "Toutes les Universités",
  "A5_treemap_title": "Répartition des Inscriptions ({curso})",
  "A5_fig_treemap_markdown_1": "**Naviguer dans l'Univers Institutionnel :**\nCette \"carte arborescente\" (treemap) est une représentation visuelle des inscriptions totales.\n*   **La Taille Compte :** La surface de chaque rectangle est proportionnelle au nombre d'étudiants. Elle commence par \"Toutes les Universités\" ; cliquez sur une université (par ex. `UCLV`, `UH`, `CUJAE`) pour voir comment ses inscriptions se répartissent par branches scientifiques. Un autre clic sur une branche vous montrera les filières qu'elle contient et leur poids dans cette institution.\n*   **Identifier les Géants :** D'un coup d'œil, vous pouvez identifier les universités avec le plus grand volume d'étudiants. Par exemple, l'**UO (Université d'Orient)**, l'**UH (Université de La Havane)** et l'**UCMLH (Université des Sciences Médicales de La Havane)**, entre autres, montrent des rectangles considérablement grands, indiquant un nombre important d'inscrits.\n*   **Domaines de Spécialisation :** Remarquez comment certaines universités ont presque toute leur \"surface\" concentrée dans une ou deux branches (par ex. les Universités des Sciences Médicales principalement dans \"Sciences Médicales\"), tandis que d'autres montrent une plus grande diversification. Comme on peut le voir, les Sciences Médicales se distinguent dans toutes les universités qui les proposent.",
  "A5_info_no_treemap_data": "Aucune donnée disponible pour générer la carte interactive.",
  "A5_df_carreras_unicas_subheader": "Joyaux Académiques : Filières par Niveau d'Exclusivité",
  "A5_df_carreras_unicas_markdown_new": "Ce graphique regroupe les filières selon le nombre d'universités qui les proposent pour l'année académique {curso}. Chaque point représente une filière. Passez la souris sur un point pour voir son nom. Les annotations en haut indiquent combien de filières existent dans chaque groupe d'exclusivité.",
  "A5_chart_title_grouped_offer": "Répartition des Filières par Exclusivité de l'Offre",
  "A5_chart_yaxis_num_unis": "Nbre d'Universités Proposant",
  "_carrers": "filières",
  "A5_expander_show_all_data": "Voir le tableau complet avec toutes les filières",
  "A5_info_no_limited_offer_data": "Aucune donnée trouvée sur les filières à offre limitée.",
  "A5_game1_subheader": "GeoGuesser Universitaire",
  "A5_game1_intro": "Avant d'analyser les universités en détail, connaissez-vous leur emplacement ? Prouvez-le !",
  "A5_game1_title": "Devinez la Province",
  "A5_game2_subheader": "Devinez l'Exclusivité",
  "A5_game2_intro": "Certaines filières sont enseignées dans tout le pays, tandis que d'autres sont de véritables raretés. À quel point pensez-vous que la filière suivante est exclusive ?",
  "A5_game2_title": "L'Estimateur d'Exclusivité",
  "A5_subheader_2": "Zoom sur les Filières Clés : Qui est Qui dans la Formation Spécifique ?",
  "A5_markdown_2": "Sélectionnez jusqu'à 3 filières d'intérêt. Le graphique montrera l'évolution historique des inscriptions pour ces filières, ventilée par chaque université qui les propose. Cela nous permet de comparer le poids et la trajectoire de différentes institutions dans la formation de professionnels dans des domaines spécifiques.\n\n*Si le graphique semble trop dense, essayez de sélectionner moins de filières ou concentrez-vous sur les tendances générales des plus grandes universités pour chaque filière.*",
  "A5_multiselect_carreras": "Filières pour comparer les évolutions par université :",
  "A5_spinner_2": "Génération du graphique comparatif par université...",
  "A5_chart_title_uni_comparison": "Évolution par Université pour : {careers}",
  "A5_chart_yaxis_enrollment": "Inscriptions Totales",
  "A5_warning_comparison_failed": "Impossible de générer le graphique comparatif. Cause : {status}",
  "A5_no_carreras_selected": "Veuillez choisir au moins une filière pour voir la comparaison.",
  "A5_markdown_3": "---\n**Visions Stratégiques pour le Réseau Universitaire :**\n*   **Renforcer l'Excellence :** Identifier les universités leaders dans des filières clés peut guider les investissements pour en faire des centres de référence nationaux ou internationaux.\n*   **Optimiser les Ressources :** La carte arborescente et l'analyse des offres uniques peuvent révéler des doublons inutiles ou, au contraire, la nécessité d'étendre l'offre de certaines filières dans plus de régions.\n*   **Collaboration Interinstitutionnelle :** Connaître les forces de chacun peut favoriser les synergies, les programmes communs et la mobilité des étudiants et des professeurs.",
  "A6_header_1": "🔭 Regarder vers Demain : Que Pourrions-nous Attendre ? (Projections Futures)",
  "A6_markdown_1": "Anticiper l'avenir est un défi, mais l'analyse des tendances récentes nous permet de dessiner des scénarios possibles. Dans cette section, nous réexaminerons nos indicateurs clés d'inscription, mais cette fois en étendant notre regard sur les deux prochaines années académiques grâce à des projections.\n\n⚠️ **Une Boussole, pas un Oracle :** Il est crucial de se rappeler que ce sont des **projections**, pas des prédictions infaillibles. Elles sont basées sur des modèles simples de **Régression Linéaire appliqués aux 6 dernières années de données historiques** (ou moins, si les données sont insuffisantes pour une branche ou une filière spécifique). De multiples facteurs non pris en compte dans ces modèles (changements de politique, crises économiques, nouvelles demandes sociales, etc.) pourraient altérer considérablement ces trajectoires. Utilisons-les comme un outil de réflexion stratégique et de planification proactive, et non comme un destin écrit dans la pierre.",
  "A6_chart_title_projection": "Évolution et Projection (Rég. Lin. {n_years} dernières années)",
  "A6_chart_title_branches_projection": "Évolution et Projection par Branche (Rég. Lin. {n_years} dernières années ou moins)",
  "A6_subheader_1": "Horizon National : Projection des Inscriptions Totales",
  "A6_spinner_1": "Calcul de la projection des inscriptions nationales...",
  "A6_info_1": "Les lignes en pointillés et les points en forme de losange au-delà de l'année académique 2024-2025 représentent les projections.",
  "A6_markdown_national_explanation": "**Interprétation de la Tendance Nationale Projetée :**\n\nLe graphique ci-dessus combine l'évolution historique des inscriptions (barres et ligne pleine jusqu'à l'année académique 2024-25) avec une projection pour les deux années académiques suivantes (ligne en pointillés avec des losanges).\n\n*   **Point de Départ :** La projection commence à partir des dernières données historiques enregistrées, qui montrent des inscriptions nationales d'environ **205 000 étudiants**.\n*   **Trajectoire Projetée :** Le modèle de régression linéaire, basé sur la tendance des dernières années, suggère une **continuation de la phase d'ajustement ou de déclin modéré** observée dans la période la plus récente.\n*   **Estimations Futures :**\n    *   Pour l'année académique **2025-2026**, le modèle estime des inscriptions qui pourraient se situer entre **195 000 et 215 000 étudiants**.\n    *   Vers **2026-2027**, ce chiffre pourrait chuter aux alentours de **185 000 à 190 000 étudiants**.\n*   **Implication Stratégique :** Si cette tendance se matérialise, elle soulève des questions importantes pour la planification : Comment cela affecterait-il la capacité installée dans les universités ? Nécessiterait-il une réévaluation de l'allocation des ressources ou de nouvelles stratégies de recrutement et de rétention des étudiants au niveau national ?",
  "A6_warning_national_proj_failed": "Impossible de générer la projection nationale. État : {status}",
  "A6_fig_A2_subheader": "Savoirs de Demain : Projection par Branche Scientifique",
  "A6_fig_A2_spinner": "Calcul de la projection par branche scientifique...",
  "A6_warning_branches_proj_failed": "Impossible de générer la projection par branche.",
  "A6_fig_A7_subheader_1": "Filières Clés à l'Horizon : Projection Interactive",
  "A6_fig_A7_markdown_1": "Sélectionnez jusqu'à 3 filières d'intérêt pour visualiser leur projection d'inscription individuelle.",
  "A6_fig_A7_multiselect_1": "Sélectionnez des filières à projeter :",
  "A6_fig_A7_spinner_1": "Calcul de la projection pour les filières sélectionnées...",
  "A6_game_subheader": "🔮 L'Oracle des Inscriptions",
  "A6_game_intro": "Avant de révéler les projections du modèle, testons votre intuition d'analyste. Observez la trajectoire historique des inscriptions nationales. Sur la base de cette tendance, que pensez-vous qu'il s'est passé lors de la dernière année enregistrée ? La tendance a-t-elle continué, s'est-elle stabilisée ou s'est-elle inversée ?",
  "A6_game_item_name": "Inscriptions Nationales",
  "A6_game_title": "Prédisez la Tendance Nationale",
  "A7_header_1": "💡 Zones d'Attention : Défis et Opportunités Spécifiques",
  "A7_markdown_1": "Au-delà des grandes tendances, il existe des situations particulières dans les filières et les universités qui méritent un examen spécial. Certaines filières peuvent émerger avec vigueur, d'autres peuvent avoir terminé leur cycle d'offre, et un troisième groupe peut avoir du mal à attirer un nombre suffisant d'étudiants. Identifier ces cas ne consiste pas à signaler des problèmes, mais à découvrir des opportunités pour une gestion académique plus précise, agile et adaptée aux réalités changeantes.",
  "A7_spinner_1": "Identification des zones d'attention spécifiques...",
  "A7_error_a8_analysis": "Impossible de terminer l'analyse des zones d'attention.",
  "A7_a8_subheader_1": "🌱 Semer l'Avenir : Nouvelles Offres ou Réactivations Possibles",
  "A7_a8_markdown_1": "Le graphique suivant montre combien de nouvelles filières ou de filières réactivées ont été détectées chaque année. Cela révèle les périodes de plus grande expansion ou de renouvellement de l'offre académique.",
  "A7_chart_title_new_offers": "Nouvelles Offres ou Réactivations Détectées par Année",
  "A7_chart_xaxis_year_new_offers": "Année de Détection/Réactivation",
  "A7_expander_new_offers": "Voir la liste complète des {count} nouvelles offres détectées",
  "A7_col_detected_start_year": "Année de Début Détectée",
  "A7_col_current_enrollment": "Inscriptions Actuelles",
  "A7_info_no_new_offers": "Aucune filière n'a été identifiée comme répondant clairement au critère de nouvelle offre ou de réactivation.",
  "A7_a8_subheader_2": "🍂 Cycles qui se Terminant : Cessations d'Offre Possibles",
  "A7_a8_markdown_2_revised": "Ce graphique résume combien de filières ont cessé d'avoir des inscrits par année, nous donnant une idée des périodes avec les plus grands ajustements ou abandons dans l'offre académique.",
  "A7_chart_title_ceased_offers": "Cessations d'Offre Possibles par Dernière Année avec Inscription",
  "A7_chart_xaxis_last_year": "Dernière Année avec Inscription",
  "A7_expander_ceased_offers": "Voir la liste complète des {count} offres possiblement abandonnées",
  "A7_col_last_enrollment_year": "Dernière Année avec Inscription",
  "A7_info_no_ceased_offers": "Aucune filière n'a été identifiée comme répondant clairement au critère de cessation d'offre.",
  "A7_a8_subheader_3": "📉 Zones d'Attention : Inscriptions Faibles (Inférieures à {umbral})",
  "A7_a8_markdown_3_revised": "Le graphique suivant regroupe les filières selon leur niveau d'inscription pour l'année académique {curso}. Chaque point représente une filière dans une université spécifique. Passez le curseur sur un point pour voir les détails. Cela nous aide à voir où se concentrent les cas d'inscriptions les plus critiques (par ex. 1 ou 2 étudiants).",
  "A7_chart_title_low_enrollment": "Offres à Faibles Inscriptions (Année Académique {curso}, < {umbral} Étudiants)",
  "A7_chart_yaxis_low_enrollment": "Nombre d'Étudiants",
  "A7_expander_low_enrollment": "Voir la liste complète des {count} filières à faibles inscriptions",
  "A7_col_enrollment_last_year": "Inscriptions ({curso})",
  "A7_info_no_low_enrollment": "Aucune filière avec des inscriptions inférieures à {umbral} (et >0) n'a été identifiée pour la dernière année.",
  "A7_conclusion_markdown_1": "---\n**Décisions Éclairées pour une Gestion Proactive :**\nLes informations présentées dans cette section sont un appel à une action spécifique :\n*   **Nouvelles Offres / Réactivations :**\n    *   **Vérifier :** Correspondent-elles à des lancements ou réactivations planifiés ?\n    *   **Surveiller :** Évaluer leur évolution initiale, leurs besoins en ressources et leurs stratégies de consolidation.\n    *   **Apprendre :** Répondent-elles à une demande sociale ou professionnelle émergente qui pourrait être reproduite ?\n*   **Cessations d'Offre Possibles :**\n    *   **Confirmer :** L'abandon est-il officiel et définitif ? Mettre à jour les registres si nécessaire.\n    *   **Évaluer l'Impact :** Si l'abandon n'était pas planifié ou a des implications négatives (par ex. la seule offre dans une région), enquêter sur les causes.\n*   **Inscriptions Faibles :**\n    *   **Analyse des Causes Profondes :** S'agit-il de filières hautement spécialisées avec une demande limitée par nature ? Problèmes de recrutement ? Cursus obsolète ? Manque de pertinence professionnelle ?\n    *   **Stratégies Différenciées :** Selon le diagnostic, les actions pourraient aller de la promotion ciblée, la refonte du cursus, à l'examen d'une fusion avec d'autres filières ou, en dernier recours, un abandon planifié si son maintien n'est pas justifié.\n\nUne gestion attentive de ces détails permet d'optimiser les ressources, de mieux répondre aux besoins du pays et d'assurer la vitalité et la pertinence de l'offre académique universitaire.",
  "A7_game_subheader": "🕵️‍♂️ Trouvez la Zone d'Attention",
  "A7_game_intro": "Parmi les multiples offres académiques des universités, certaines prospèrent avec des centaines d'étudiants, tandis que d'autres luttent pour se maintenir à flot. Ci-dessous, nous vous présentons quatre offres universitaires. Trois d'entre elles ont des inscriptions saines, mais une est une \"zone d'attention\" avec des inscriptions très faibles. Pouvez-vous identifier l'intrus ?",
  "A7_game_title": "L'Intrus à Faibles Inscriptions",
  "A7_chart_yaxis_enrollment": "Inscriptions Totales",
  "A7_chart_title_projection": "Projection des Inscriptions pour les Filières Sélectionnées",
  "a7_proy_warning": "Impossible de générer des données de projection pour : {careers}.",
  "a7_void_info": "Sélectionnez au moins une filière pour voir sa projection.",
  "a7_end_markdown": "---\n**Planifier avec une Vision d'Avenir :**\nCes projections, avec toutes leurs limites, sont un apport précieux pour :\n*   Anticiper les besoins en **infrastructures et en corps professoral**.\n*   Débattre de l'**allocation des places et des ressources** entre différents domaines et filières.\n*   Identifier les domaines qui pourraient nécessiter des **stratégies proactives** pour inverser les tendances négatives ou pour gérer une croissance durable.\n*   Favoriser un dialogue éclairé sur l'**avenir de l'offre académique** à Cuba.",
  "B1_header_1": "🔬 Laboratoire : Profil Détaillé de la Filière",
  "B1_markdown_1": "Plongez dans les détails de la filière de votre choix. Découvrez son évolution historique, son taux de croissance, et un aperçu annuel des universités et de la composition par genre.",
  "B1_selectbox_label_1": "Sélectionnez une Filière pour analyser son profil :",
  "b1_info_select_career": "Veuillez sélectionner une Filière pour continuer.",
  "B1_spinner_1_hist": "Génération du profil historique pour {career}...",
  "B1_subheader_1_hist": "Évolution et Croissance de : {career}",
  "B1_markdown_1_rama": "Branche Scientifique",
  "B1_chart_title_evolution_stacked": "Évolution et Composition des Inscriptions : {career}",
  "B1_info_no_evolution_data": "Aucune donnée d'évolution disponible pour cette filière.",
  "B1_slider_label_cagr": "Sélectionnez la plage d'années pour le calcul du TCAC :",
  "B1_subheader_2_snapshot": "Analyse Annuelle Détaillée",
  "B1_slider_label_snapshot": "Sélectionnez une année pour voir les détails :",
  "B1_spinner_2_snapshot": "Chargement des données pour l'année {year}...",
  "B1_pie_title_genero_yearly": "Répartition par Genre ({curso})",
  "B1_info_no_gender_data_pie": "Aucune donnée de genre pour cette année.",
  "b1_bar_chart_title": "Inscriptions par Université",
  "b1_info_no_universities_data_year": "Aucune université n'a enregistré d'inscriptions cette année-là.",
  "b1_warning_no_data_for_year": "Aucune donnée trouvée pour la filière '{career}' pour l'année {year}.",
  "b2_header": "🗺️ Guide des Institutions : Explorez l'Offre Académique par Localité",
  "b2_intro": "Découvrez les établissements d'enseignement supérieur à Cuba, en filtrant par province et commune. Pour chaque université, vous trouverez des informations générales et l'offre académique par branches et filières pour l'année que vous sélectionnez.",
  "b2_error_no_institutions_data": "Les données des institutions ne sont pas disponibles. Cette section ne peut pas être affichée.",
  "b2_error_no_enrollment_data": "Les données d'inscription ne sont pas disponibles. L'information sur l'offre sera limitée.",
  "b2_subheader_filters": "Filtres de Recherche :",
  "b2_label_province": "Province :",
  "b2_label_municipality": "Commune :",
  "b2_label_search_pattern": "Rechercher par nom ou sigle d'institution (filtre visuel) :",
  "b2_spinner_loading": "Chargement du guide des institutions...",
  "b2_warning_basic_analysis_failed": "Impossible de charger la liste de base des institutions. État : {status}",
  "b2_info_showing_unis": "Affichage de {shown} sur {total} institution(s) ({last_year}).",
  "b2_warning_no_years_for_detail": "Aucune année d'inscription disponible pour voir les détails.",
  "b2_slider_year_detail": "Sélectionnez l'année pour voir l'offre académique détaillée :",
  "b2_info_no_unis_matched_filters": "Aucune institution ne correspond aux filtres appliqués.",
  "b2_pie_title_gender_total": "Genre Total ({curso})",
  "b2_caption_no_gender_data_for_year": "Aucune donnée de genre disponible pour {curso}.",
  "b2_markdown_academic_offering": "**Offre Académique ({curso}, branches et filières avec inscriptions) :**",
  "b2_info_no_branches_for_year": "Cette institution n'a pas de branches scientifiques actives ni de filières avec des inscriptions signalées pour {curso}.",
  "conclusion_header": "🏁 Conclusions et Horizons Futurs : Forger l'Université de Demain",
  "conclusion_intro": "Nous avons voyagé à travers une décennie de données, explorant l'écosystème complexe de l'enseignement supérieur à Cuba. Que ce soit en tant qu'analyste ou explorateur, chaque graphique déverrouillé et chaque défi surmonté a été une pièce d'un puzzle plus grand : l'histoire de milliers d'aspirations, d'efforts institutionnels et de la quête incessante du savoir qui définit notre nation.\n\nCette analyse n'est pas un point final, mais un phare qui éclaire le chemin parcouru et nous aide à discerner les sentiers qui s'ouvrent devant nous.",
  "conclusion_success_message": "**L'information est le pouvoir, et le pouvoir de ces données réside dans notre capacité à les transformer en action sage et en vision stratégique.**",
  "conclusion_findings_subheader": "🌟 Éclats du Voyage : Principales Conclusions",
  "conclusion_findings_text": "En regardant notre analyse, plusieurs phares émergent pour guider notre compréhension :\n\n1.  **Le Pouls Dynamique de la Nation :** Les inscriptions universitaires nationales ont montré une capacité d'expansion remarquable, atteignant des pics significatifs au début des années 2020, suivis d'une phase d'ajustement plus récente. Cette fluctuation nous rappelle la sensibilité du système aux facteurs contextuels et la nécessité d'une planification flexible. *(Réf. Section 1)*\n\n2.  **Le Cœur Médical et l'Âme Pédagogique :** Les **Sciences Médicales** se consolident comme l'épine dorsale en termes de volume d'étudiants, un témoignage de leur importance stratégique. Les **Sciences Pédagogiques**, quant à elles, ont fait preuve d'un dynamisme extraordinaire, avec une croissance massive suivie d'une contraction, reflétant d'éventuels changements dans la demande ou dans les politiques de formation des enseignants. *(Réf. Section 2)*\n\n3.  **L'Ascension de Nouvelles Vocations :** L'analyse de la croissance (TCAC) a révélé le décollage impressionnant de filières comme les **Services Stomatologiques** et la vigueur de plusieurs **Ingénieries** (Artistique, Procédés Agro-industriels, Informatique), signalant de nouvelles frontières potentielles d'intérêt et de demande sur le marché du travail. *(Réf. Section 3)*\n\n4.  **Progrès et Défis en matière d'Équité de Genre :** Bien que Cuba affiche une forte participation féminine dans l'enseignement supérieur, avec de nombreuses branches et filières montrant une majorité de femmes, des défis importants subsistent. La sous-représentation des femmes dans les **Sciences Techniques** et les **filières d'Ingénierie spécifiques**, ainsi que dans les **Sciences de la Culture Physique et du Sport**, nous appelle à redoubler d'efforts pour construire un paysage véritablement équitable. *(Réf. Section 4)*\n\n5.  **La Richesse de la Diversité Institutionnelle :** Chaque université apporte sa nuance unique au système. Nous avons vu de grands centres multidisciplinaires à des institutions à spécialisation marquée (comme les Universités des Sciences Médicales). L'identification des filières à offre limitée souligne l'importance d'un réseau universitaire coordonné et stratégiquement réparti. *(Réf. Section 5)*\n\n6.  **Un Regard Prudent sur Demain :** Les projections, bien que soumises à l'incertitude inhérente à l'avenir, suggèrent une possible continuation de la phase d'ajustement des inscriptions générales et dans plusieurs branches et filières clés. Ce n'est pas un présage, mais une invitation à la préparation et à l'action proactive. *(Réf. Section 6)*\n\n7.  **L'Importance des Détails :** L'analyse des \"Zones d'Attention\" nous a rappelé que la santé du système réside également dans la vitalité de chacune de ses composantes, y compris les filières émergentes, celles à faibles inscriptions ou celles qui pourraient terminer leur cycle. *(Réf. Section 7)*",
  "conclusion_player_summary_header": "🏆 Résumé de Votre Aventure en tant qu'Explorateur",
  "metric_total_score": "Score Final",
  "metric_games_played": "Jeux Terminés",
  "metric_analyst_profile": "Profil d'Analyste",
  "profile_strategist": "Le Stratège",
  "profile_strategist_desc": "Votre point fort est de classer et d'ordonner. Vous voyez la situation dans son ensemble et mettez chaque pièce à sa place.",
  "profile_competitor": "Le Compétiteur",
  "profile_competitor_desc": "Vous adorez les duels. Comparer et choisir le gagnant est votre spécialité.",
  "profile_visionary": "Le Visionnaire",
  "profile_visionary_desc": "Vous avez un don pour estimer les chiffres et les grandeurs avec précision.",
  "profile_prophet": "Le Prophète",
  "profile_prophet_desc": "Vous pressentez les tendances futures comme personne. Votre boule de cristal fonctionne !",
  "profile_cartographer": "Le Cartographe",
  "profile_cartographer_desc": "Vous connaissez le terrain. Localiser chaque institution sur la carte est votre talent naturel.",
  "profile_detective": "Le Détective",
  "profile_detective_desc": "Personne ne peut vous tromper. Vous êtes un expert pour trouver l'élément qui ne correspond pas.",
  "profile_scholar": "L'Érudit",
  "profile_scholar_desc": "Vous répondez aux questions directes avec connaissance et certitude.",
  "profile_explorer": "L'Explorateur",
  "profile_explorer_desc": "Vous profitez du voyage et apprenez de chaque défi, couvrant tous les domaines.",
  "leaderboard_header": "Classement Mondial des Explorateurs",
  "leaderboard_intro": "Rivalisez avec d'autres analystes et laissez votre marque dans le classement. Serez-vous parmi les meilleurs ?",
  "player_name_label": "Votre nom pour le classement :",
  "submit_score_button": "🚀 Envoyer mon score !",
  "enter_name_warning": "Veuillez entrer un nom.",
  "score_submitted_info": "Votre score a déjà été soumis ! Merci de votre participation.",
  "loading_leaderboard_spinner": "Chargement du classement...",
  "leaderboard_col_timestamp": "Date",
  "leaderboard_col_playername": "Joueur",
  "leaderboard_col_score": "Score",
  "leaderboard_empty_caption": "Le classement est vide. Soyez le premier à y figurer !",
  "leaderboard_connection_warning": "Impossible de se connecter au service de classement. La fonctionnalité n'est pas disponible pour le moment.",
  "conclusion_recommendations_subheader": "🧭 Tracer la Feuille de Route : Recommandations Stratégiques",
  "conclusion_recommendations_text": "Avec ces conclusions comme boussole, nous proposons les lignes d'action suivantes pour le Siège Central et tous les acteurs impliqués dans l'Enseignement Supérieur cubain :\n\n*   **Renforcer l'Observatoire de l'Enseignement Supérieur :**\n    *   **Action :** Maintenir et enrichir ce système d'analyse de données comme un outil permanent pour le suivi des tendances, l'évaluation des politiques et la prise de décisions éclairées.\n    *   **Impact Attendu :** Une plus grande agilité et réactivité du système face aux dynamiques changeantes.\n\n*   **Promouvoir la Pertinence et la Qualité avec une Vision d'Avenir :**\n    *   **Action :** Mener des études prospectives continues sur les besoins du développement socio-économique du pays et les demandes du marché du travail pour aligner l'offre académique. Évaluer et mettre à jour les cursus des filières à faible demande ou en déclin, et investir dans celles qui ont un potentiel de croissance et une pertinence stratégique.\n    *   **Impact Attendu :** Des diplômés mieux préparés aux défis de l'avenir et une plus grande contribution de l'université au développement national.\n\n*   **Favoriser l'Équité de Genre dans Toutes les Disciplines :**\n    *   **Action :** Concevoir et mettre en œuvre des programmes spécifiques et durables pour encourager la participation féminine dans les filières STEM et autres domaines sous-représentés, et vice versa, en s'attaquant aux stéréotypes dès les premières étapes de l'éducation.\n    *   **Impact Attendu :** Un système universitaire plus inclusif qui tire parti du talent de toute la population sans préjugés de genre.\n\n*   **Optimiser le Réseau Universitaire et Promouvoir la Collaboration :**\n    *   **Action :** Utiliser les analyses de spécialisation et de répartition pour prendre des décisions sur l'ouverture, la fusion ou la fermeture de filières dans différentes institutions, en recherchant l'efficacité, la qualité et une couverture territoriale équitable. Favoriser la création de réseaux de connaissances et de programmes inter-universitaires.\n    *   **Impact Attendu :** Un système plus cohérent, avec des centres d'excellence renforcés et une meilleure utilisation des ressources disponibles.\n\n*   **Intégrer la Voix des Acteurs :**\n    *   **Action :** Compléter les analyses quantitatives par des recherches qualitatives qui recueillent les perceptions et les expériences des étudiants, des professeurs, des diplômés et des employeurs.\n    *   **Impact Attendu :** Des décisions plus holistiques et des politiques mieux adaptées aux réalités et aux attentes de la communauté universitaire et de la société.",
  "conclusion_final_header": "✨ Un Héritage Continu, un Avenir Brillant",
  "conclusion_final_paragraph": "L'analyse de ces données n'est pas un simple exercice académique ; c'est un acte de responsabilité et un engagement envers l'avenir. Les Universités Cubaines, chacune avec sa riche histoire et son rôle transcendantal dans la société, font face au défi et à l'opportunité de continuer à évoluer, à s'adapter et à innover.\n\nNous espérons que ces données inspireront chacun à travailler ensemble pour un enseignement supérieur qui ne répond pas seulement aux besoins du présent, mais qui façonne activement un avenir plus prospère, juste et riche en connaissances pour tous les jeunes Cubains."
}