{
  "settings_title": "Impostazioni",
  "save": "Salva",
  "load_df_error": "Errore critico: Impossibile caricare i dati ('db.parquet'). L'applicazione non può continuare.",
  "load_screen_title": "🎓 Analisi Strategica delle Iscrizioni Universitarie a Cuba",
  "main_image_caption": "Università dell'Avana. Un simbolo dell'istruzione superiore a Cuba.",
  "main_markdown_1": "Un viaggio per illuminare il cammino dell'Istruzione Superiore.",
  "sidebar_title": "🧭 Esploratore sezioni",
  "sidebar_radio_title_main": "Scegli una sezione:",
  "sidebar_radio_title_sub_prefix": "Sottosezione: ",
  "sidebar_info": "Analisi basata sui dati di immatricolazione del periodo 2015-16 al 2024-25.\n\n -- ⚠️ Non include l'anno accademico 2018-2019 per mancanza di dati; le analisi vengono eseguite omettendo questo anno.",
  "subseccion_not_valid_in": "Sottosezione non valida in ",
  "back": "Precedente: ",
  "next": "Successivo: ",
  "authors": "Autori:",
  "author_reynier": "Reynier Ramos González",
  "author_ernesto": "Ernesto Herrera García",
  "lang_select_label": "Lingua / Idioma",
  "lang_select_help": "Seleziona la tua lingua preferita per l'applicazione.",
  "_women": "Donne",
  "_men": "Uomini",
  "_total_enrollment": "Iscrizioni totali",
  "_total_enrollment_projected": "Iscrizioni totali (proiezione)",
  "_total_enrollment_historical": "Iscrizioni totali (storico)",
  "_projection_start": "Inizio proiezione",
  "_academic_year": "Anno Accademico",
  "_enrollment": "Iscrizioni",
  "_legend": "Legenda",
  "_projected_short": "Pro.",
  "_50_parity": "Parità 50%",
  "_university": "Università",
  "_date": "Dato",
  "_career": "Corso di laurea",
  "_offers": "offerte",
  "_elements": "elementi",
  "_number_of_students": "Numero di studenti",
  "_all_provinces": "TUTTE LE PROVINCE",
  "_all_municipalities": "TUTTI I COMUNI",
  "_founded_in": "Fondata nel",
  "_organism": "Organismo",
  "_address": "Indirizzo",
  "_main_modality": "Modalità principale",
  "generic_warn_figs": "Impossibile generare il grafico del panorama nazionale (A1).",
  "ask_ai_component": {
    "ai_initial_response_text": "🤖 Domande su questa analisi? Chiedi all'Assistente IA!",
    "restart_conversation": "Riavvia questa conversazione",
    "your_question_here": "Scrivi qui la tua domanda...",
    "thinking": "Elaborazione della tua richiesta...",
    "code_download": "📥 Scarica il codice",
    "generated_image": "Immagine generata",
    "error_parsing_table": "Errore durante l'analisi della tabella"
  },
  "gamification_controller": {
    "confirm_deactivation_title": "Conferma disattivazione",
    "confirm_deactivation_warning": "Sei sicuro di voler disattivare la Modalità Gioco?",
    "confirm_deactivation_text": "Smetterai di vedere i minigiochi interattivi e perderai i tuoi progressi attuali.",
    "confirm_button": "Conferma",
    "cancel_button": "Annulla",
    "game_mode_label": "**Modalità Gioco**",
    "toggle_help": "Attiva/disattiva i minigiochi interattivi.",
    "progress_header": "🏆 I Tuoi Progressi",
    "reset_progress_button": "Azzera progressi",
    "points_metric_label": "Punti",
    "games_metric_label": "Giochi",
    "history_expander_label": "Vedi cronologia partite",
    "history_empty": "Non hai ancora giocato. Forza!",
    "history_item_text": "{icon} **{game_title}**: *+{points_earned} pti*",
    "round": "Round",
    "detailed_analysis_revealed": "Analisi Dettagliata:",
    "feedback_victory": "Vittoria! Hai superato la sfida con **{total_score}** punti.",
    "feedback_defeat": "Quasi! Hai ottenuto **{total_score}** punti. Riprova!",
    "feedback_game_over_text": "Hai ottenuto un totale di **{total_score}** punti.",
    "see_round_summary": "Vedi riepilogo dettagliato dei round",
    "submit_button_label": "Verifica!",
    "please_pick_an_action": "Per favore, esegui un'azione prima di verificare.",
    "SimpleQuestionMinigame": {
      "minigame_prefix": "Minigioco:",
      "choose_your_answer": "Scegli la tua risposta:"
    },
    "DataDuelMinigame": {
      "data_duel_title": "Duello di Dati",
      "duel_question": "Quale ha il valore più alto?"
    },
    "ClassifierMinigame": {
      "classifier_title": "Il Classificatore",
      "classifier_drag_info": "💡 Trascina gli elementi per ordinarli dal più grande al più piccolo."
    },
    "OracleMinigame": {
      "oracle_title": "L'Oracolo",
      "oracle_question": "Osserva l'evoluzione e prevedi la tendenza."
    },
    "EstimatorMinigame": {
      "estimator_title": "Lo Stimatore",
      "estimator_instructions": "Usa il cursore per stimare il valore. Più ti avvicini, più punti ottieni!",
      "estimator_question": "Qual è il valore per **{item_name}**?",
      "_your_estimation": "La tua stima",
      "estimator_result_shower": "**Risultato per '{item_name}' (Round {round_num})**",
      "_real_value": "Valore reale",
      "estimator_claim_victory": "Stima eccellente! Hai ottenuto **{score}** punti.",
      "estimator_good_try": "Buon tentativo! Hai ottenuto **{score}** punti."
    },
    "GeoGuesserMinigame": {
      "geoguesser_title": "GeoGuesser",
      "geoguesser_instructions": "Seleziona la provincia corretta per la seguente istituzione.",
      "_where_is_it": "Dove si trova?"
    },
    "ImpostorMinigame": {
      "impostor_title": "Trova l'intruso",
      "impostor_instructions": "Tre di questi elementi appartengono allo stesso gruppo. Qual è l'intruso?"
    }
  },
  "introduction_header": "🎯 Benvenuti nel Cuore dell'Istruzione Superiore Cubana",
  "introduction_markdown_1": "Un'università non è solo un edificio; è un crogiolo di sogni, un motore di progresso e un riflesso delle aspirazioni di una società. In questo spazio, intraprenderemo un viaggio analitico, esplorando le correnti che modellano le iscrizioni universitarie a Cuba.\n\nDalle tendenze generali ai dettagli di ogni corso di laurea e università, sveleremo le storie nascoste dietro le diverse università del paese. L'obiettivo? Fornire una bussola basata sull'evidenza per la presa di decisioni strategiche, promuovendo un sistema di istruzione superiore più forte, più equo e allineato con il futuro della nazione.",
  "intro_choose_your_path_header": "🛣️ Scegli il Tuo Percorso: Come Vuoi Esplorare?",
  "intro_choose_your_path_text": "Questo viaggio attraverso i dati può prendere due strade. Scegli quella che si adatta meglio al tuo stile.",
  "intro_analyst_path_title": "👨‍🏫 Il Percorso dell'Analista",
  "intro_analyst_path_desc": "Ideale se vuoi andare dritto al punto. Accedi a tutti i grafici e le analisi direttamente, senza interruzioni. Perfetto per un'esplorazione rapida e mirata.",
  "intro_analyst_path_button": "Attiva Modalità Analisi",
  "intro_explorer_path_title": "🎮 Il Sentiero dell'Esploratore",
  "intro_explorer_path_desc": "Trasforma l'analisi in una sfida. In ogni sezione, affronterai minigiochi per mettere alla prova la tua intuizione sui dati prima di vederli. Guadagna punti e competi!",
  "intro_explorer_path_button": "Attiva Modalità Gioco",
  "intro_game_mode_active_info": "🕹️ **Modalità Gioco Attivata!** Preparati per le sfide. Puoi vedere i tuoi progressi premendo il pulsante '🏆' che appare nell'angolo in basso a destra.",
  "intro_analysis_mode_active_info": "📊 **Modalità Analisi Attivata.** Sei pronto per un'esplorazione diretta dei dati. Puoi cambiare modalità in qualsiasi momento nella barra laterale.",
  "introduction_sucess": "Il tuo viaggio inizia qui! Seleziona una sezione dal menu laterale o usa il pulsante 'Successivo'.",
  "A1_header": "🌍 Il Polso Nazionale: Come Batte l'Immatricolazione Universitaria?",
  "A1_markdown_1": "Immagina di poter misurare il polso dell'intero sistema universitario cubano nel corso di un decennio. Qual è stato il suo ritmo? Ha vissuto momenti di crescita vigorosa, periodi di stabilità, o forse fasi in cui il battito è diventato più lento?\n\nQuesta prima sezione ci offre una vista panoramica delle iscrizioni totali a livello nazionale, permettendoci di identificare le grandi tendenze che hanno segnato il sistema di istruzione superiore negli ultimi anni. È il nostro punto di partenza per comprendere il contesto generale prima di immergerci in analisi più specifiche.",
  "A1_spinner_1": "Costruzione del grafico A1, attendere prego...",
  "A1_chart_title_historical": "Iscrizioni Nazionali: Evoluzione Storica",
  "A1_fig_1_subheader": "Decifrare il Ritmo del Decennio (2015-2025):",
  "A1_fig_1_markdown_1": "Osservando la traiettoria delle iscrizioni nazionali totali nel grafico superiore, possiamo identificare diverse fasi chiave:\n\n*   **Spinta Iniziale (dal 2015-16 al 2016-17):** Il viaggio inizia nell'anno accademico 2015-2016 con una cifra di circa **165.000 studenti**. L'anno successivo mostra un leggero aumento, stabilendo una solida base per la crescita a venire.\n\n*   **Crescita Sostenuta verso il Picco (dal 2017-18 al 2020-21):** A partire dall'anno 2017-18, e nonostante la mancanza di dati per il 2018-19, la tendenza al rialzo riprende con forza fino a raggiungere il suo **punto più alto nell'anno accademico 2020-2021, superando i 285.000 studenti**. Questo periodo rappresenta la fase di maggiore espansione delle iscrizioni del decennio.\n\n*   **Plateau e Inizio del Declino (dal 2021-22 al 2022-23):** L'anno 2021-2022 mostra una leggera contrazione rispetto al picco, segnando l'inizio di una nuova fase. Le iscrizioni rimangono alte ma non crescono più, e nel 2022-23, il calo diventa più evidente.\n\n*   **Aggiustamento Recente (dal 2023-24 al 2024-25):** Gli ultimi due anni accademici registrati mostrano una **continuazione della tendenza al ribasso**, con le iscrizioni totali che si attestano intorno ai **205.000 studenti** nel periodo più recente. Ciò suggerisce un riaggiustamento del sistema dopo il picco di espansione.",
  "A1_ai_context": "L'analisi attuale riguarda l'evoluzione delle iscrizioni nazionali totali, maschili e femminili, a Cuba dal 2015 al 2025. I dati, presentati nel grafico, mostrano un picco significativo intorno al 2020-2021 seguito da un calo.",
  "A1_peak_enrollment_label": "Iscrizioni Nazionali nell'Anno di Picco ({curso})",
  "A1_game_subheader": "Alla Prova: L'Entità del Picco",
  "A1_game_intro": "Il sistema universitario cubano ha raggiunto un numero massimo di studenti in un punto dell'ultimo decennio. Prima di vedere il grafico, quanto è buona la tua intuizione? Prova a stimare quale fosse quella cifra massima.",
  "A1_game_title": "Lo Stimatore del Picco Nazionale",
  "A1_estimator_question": "Quanti studenti pensi ci fossero in tutto il paese durante l'anno accademico con il maggior numero di iscritti ({curso})?",
  "A2_header": "📚 Un Mosaico di Saperi: Verso Dove si Orientano i Futuri Professionisti?",
  "A2_markdown_1": "L'università è un vasto giardino dove fioriscono diverse discipline. Ogni ramo del sapere, dalle Scienze Mediche o Matematiche alle Arti, rappresenta un percorso unico di formazione e contributo alla società. In questa sezione, scomponiamo le iscrizioni totali per vedere come si distribuiscono gli studenti tra queste grandi aree, con l'obiettivo di rispondere a domande come:\n- Ci sono protagonisti chiari?\n- Come ha danzato l'interesse degli studenti nell'ultimo decennio?",
  "A2_fig_a2_abs_subheader": "La Forza di Ogni Ramo: Evoluzione Storica delle Iscrizioni",
  "A2_spinner_1": "Analisi dell'evoluzione dei rami scientifici...",
  "A2_chart_title_evolution": "Evoluzione Storica per Ramo",
  "A2_yaxis_title_enrollment_branch": "Iscrizioni per Ramo Scientifico",
  "A2_legend_title_branch": "Ramo Scientifico",
  "A2_fig_a2_abs_markdown_1": "**Ogni Linea, una Corrente di Sapere:**\nQuesto grafico traccia il percorso delle iscrizioni assolute (numero totale di studenti) per ogni ramo scientifico nel corso degli anni.\n\n*   **Leadership Eccezionale:** Le **Scienze Mediche** (linea verde acqua) si distinguono come il ramo con il maggior numero di iscritti in modo costante durante tutto il periodo, partendo da circa 70.000 studenti nel 2015-16, raggiungendo un picco impressionante di quasi **95.000 studenti nel 2020-2021**, e sebbene subiscano un calo successivo, rimangono la forza principale, chiudendo nel 2024-2025 con oltre 70.000 studenti.\n\n*   **Inseguimento e Dinamismo:** Le **Scienze Pedagogiche** (linea arancione) mostrano una traiettoria molto dinamica. Iniziano con un numero significativo di iscritti (circa 30.000), sperimentano una notevole crescita fino a superare i **65.000 studenti nel 2020-2021 e 2021-2022**, diventando il secondo ramo più grande in quegli anni. Tuttavia, subiscono un forte calo negli ultimi anni, terminando vicino ai 40.000 studenti.\n\n*   **Blocco Intermedio Coerente:** Un gruppo di rami mantiene una presenza stabile, sebbene con fluttuazioni:\n    *   Le **Scienze Tecniche** (linea rosa) e le **Scienze Sociali e Umanistiche** (linea celeste) mostrano traiettorie parallele, crescendo da circa 20.000 studenti a un picco di circa **30.000-32.000** tra il 2020-21 e il 2021-22, per poi scendere e attestarsi intorno ai 23.000-25.000 studenti alla fine del periodo.\n    *   Le **Scienze Economiche** (linea rossa) presentano una crescita più moderata ma costante fino al 2021-22 (raggiungendo circa 24.000 studenti), seguita da un calo simile ad altri rami, terminando vicino ai 15.000.\n    *   Le **Scienze Agrarie** (linea blu scuro) e le **Scienze della Cultura Fisica e dello Sport** (linea verde scuro/marrone) rimangono in un range inferiore, generalmente tra 5.000 e 15.000 studenti, con picchi intorno al 2020-2021 e cali successivi.\n\n*   **Nicchia Specializzata:** Le **Scienze Naturali e Matematiche** (linea viola) e le **Scienze delle Arti** (linea viola chiaro) rappresentano i rami con il volume di iscrizioni più basso, rimanendo costantemente al di sotto dei 5.000 studenti per tutto il decennio. Ciò suggerisce un'alta specializzazione o una domanda più limitata.",
  "A2_fig_a2_pct_subheader": "La Spartizione della Torta Accademica: Distribuzione Percentuale Storica",
  "A2_chart_title_distribution": "Distribuzione Percentuale Storica delle Iscrizioni per Ramo Scientifico",
  "A2_yaxis_label_percentage": "% Iscrizioni",
  "A2_fig_a2_pct_markdown_1": "**Proporzioni sulla Tela Universitaria:**\nQuesto grafico ad aree impilate ci mostra quale \"fetta della torta\" ogni ramo scientifico ha rappresentato all'interno delle iscrizioni universitarie totali in ogni anno accademico.\n\n*   **Dominio Persistente delle Scienze Mediche:** L'ampia fascia verde acqua in alto conferma che le Scienze Mediche hanno costantemente rappresentato la maggior parte degli studenti, occupando quasi il **40-50% del totale** al suo apice (intorno al 2016-17 e di nuovo verso il 2024-2025, dopo una leggera riduzione percentuale a metà periodo).\n\n*   **Ascesa e Declino delle Scienze Pedagogiche:** La fascia arancione delle Scienze Pedagogiche mostra un interessante cambiamento nel suo peso relativo. Inizia come una porzione importante, si espande significativamente fino a rappresentare la seconda porzione più grande (raggiungendo quasi il **25-30%** del totale intorno al 2019-2021), ma poi riduce la sua quota percentuale negli ultimi anni.\n\n*   **Stabilità Relativa al Centro:** Scienze Tecniche (fascia marrone/ocra), Sociali e Umanistiche (fascia celeste) ed Economiche (fascia blu scuro) mantengono proporzioni più stabili nel tempo, sebbene con leggere variazioni. Insieme, di solito costituiscono una porzione significativa del corpo studentesco. Ad esempio, le Scienze Sociali e Umanistiche sembrano occupare costantemente circa il 10-15%.\n\n*   **Peso Percentuale Inferiore:** Gli altri rami (Agrarie, Cultura Fisica, Naturali e Matematiche, Arti) rappresentano individualmente percentuali minori delle iscrizioni totali, il che è coerente con il loro minor volume assoluto di studenti.\n\nQuesta analisi percentuale è cruciale perché ci permette di capire non solo quanti studenti ci sono in ogni ramo, ma anche come l'interesse o la capacità di ammissione è distribuita rispetto all'intero sistema universitario.",
  "A2_subhead_popularity": "Classifica di popolarità: quali aree del sapere sono in testa?",
  "A2_intro_game1": "Prima di immergerci nei grafici, mettiamo alla prova la tua percezione. In tutta Cuba, migliaia di studenti scelgono il loro percorso professionale ogni anno. Quali rami del sapere pensi che attraggano il maggior numero di studenti universitari? Potresti classificare le aree principali in base alla loro popolarità?",
  "A2_game_title": "Il Classificatore del Sapere",
  "A2_subheader_2": "🔗 Interconnessioni nella Crescita: Come si Relazionano i Rami?",
  "A2_markdown_2": "Non tutti i rami scientifici crescono o decrescono in isolamento. Alcuni possono mostrare tendenze di iscrizione simili nel tempo, mentre altri possono avere dinamiche più indipendenti. La seguente mappa di calore (heatmap) visualizza la **correlazione della variazione percentuale annua delle iscrizioni** tra i diversi rami scientifici.\n\n*   Un **valore vicino a 1 (blu scuro/viola intenso)** indica una forte correlazione positiva: quando un ramo cresce, l'altro tende a crescere anch'esso nello stesso periodo.\n*   Un **valore vicino a -1 (non visibile in questo esempio, sarebbe l'altro estremo della scala di colori)** indicherebbe una forte correlazione negativa: quando uno cresce, l'altro tende a diminuire.\n*   Un **valore vicino a 0 (colori più chiari/neutri)** suggerisce poca o nessuna relazione lineare nei loro modelli di crescita annuali.",
  "A2_corr_title": "Matrice di Correlazione della Crescita Annua tra i Rami Scientifici",
  "A2_corr_legend": "Coeff. di Correlazione",
  "A2_fig_corr_expander": "🔍 Analisi Dettagliata delle Correlazioni Osservate",
  "A2_fig_corr_markdown_1": "**Osservazioni Chiave dalla Mappa di Correlazione:**\n\n*   **Sincronizzazione Forte:** Si osserva una **forte correlazione positiva (valori > 0,9)** nelle tendenze di crescita annuali tra:\n    *   **Scienze Agrarie e Scienze Economiche** (circa 0,98)\n    *   **Scienze Agrarie e Scienze Pedagogiche** (circa 0,98)\n    *   **Scienze Agrarie e Scienze della Cultura Fisica e dello Sport** (circa 0,96)\n    *   Così come tra **Scienze Economiche, Pedagogiche e della Cultura Fisica**, tutte che mostrano coefficienti molto alti tra loro.\n    Ciò suggerisce che questi rami spesso sperimentano spinte di crescita (o contrazione) in modo molto simile e simultaneo, possibly a causa di fattori macroeconomici, politiche educative globali o cicli di domanda studentesca che li influenzano congiuntamente.\n\n*   **Correlazioni Positive Moderate:**\n    *   Le **Scienze Mediche** mostrano una correlazione positiva moderata (generalmente tra 0,5 e 0,7) con diversi altri rami come Scienze Economiche, Sociali e Umanistiche e Tecniche. Ciò potrebbe indicare che il settore medico, pur avendo le proprie dinamiche, beneficia anche o partecipa a tendenze espansive più ampie nell'istruzione superiore.\n    *   Le **Scienze Tecniche** sono anche moderatamente correlate con la maggior parte degli altri rami, suggerendo una connessione con il ciclo generale del sistema.\n\n*   **Indipendenza Relativa Notevole:**\n    *   Le **Scienze Naturali e Matematiche** si distinguono per avere le **correlazioni più basse** con quasi tutti gli altri rami (coefficienti spesso tra 0,2 e 0,4). Ciò indica che il loro modello di crescita delle iscrizioni sembra essere abbastanza indipendente dalle fluttuazioni che influenzano altre grandi aree del sapere. Questo ramo potrebbe essere influenzato da fattori molto specifici, come particolari programmi di promozione scientifica o una domanda più specializzata e meno sensibile alle tendenze generali.\n    *   Le **Scienze delle Arti** mostrano anche correlazioni più deboli con alcuni dei rami più grandi come le Scienze Pedagogiche, sebbene abbiano un'interessante correlazione moderata con le Scienze Mediche.\n\n*   **Implicazioni Strategiche:**\n    *   La forte sincronizzazione tra alcuni rami suggerisce che le strategie di pianificazione e allocazione delle risorse potrebbero considerare questi \"cluster\" di comportamento.\n    *   L'indipendenza delle Scienze Naturali e Matematiche potrebbe richiedere un approccio e un monitoraggio differenziati per garantirne la vitalità e l'allineamento con le esigenze di sviluppo scientifico-tecnico del paese.\n    *   L'assenza di correlazioni fortemente negative (in questo grafico) suggerisce che, a livello aggregato di variazione annuale, non c'è una \"cannibalizzazione\" evidente in cui la crescita di un ramo sia direttamente a scapito di un altro, sebbene non si escludano dinamiche competitive a livelli più specifici.",
  "A2_corr_warn_1": "Impossibile generare la mappa di correlazione tra i rami.",
  "A2_subhead_correlation": "Sinergie nascoste: quali rami crescono insieme?",
  "A2_intro_game2": "I rami del sapere non sono isole. Le loro tendenze di crescita sono spesso collegate. Alcuni si muovono in perfetta sincronia, mentre altri danzano al proprio ritmo. Quando l'interesse per le Scienze Pedagogiche cresce, quale altra area pensi che benefici di una spinta simile? Accetta la sfida e scoprilo!",
  "A2_game_title_corr": "Duello di Sinergie",
  "A2_duel_question_corr": "La crescita delle **Scienze Pedagogiche** è PIÙ simile a:",
  "A3_header": "🔍 I Corsi di Laurea Sotto la Lente: Popolarità, Tendenze e Dinamismo",
  "A3_markdown_1": "Dopo aver esplorato i grandi rami del sapere, è il momento di focalizzare la nostra lente sulle unità fondamentali: i corsi di laurea universitari. Quali sono quelli che catturano il maggior interesse degli studenti? Come è stata la loro evoluzione individuale? E, cosa molto importante, quali mostrano una crescita accelerata e quali sembrano perdere slancio?",
  "A3_subheader_2": "🏆 Il Podio dei Corsi di Laurea: Quali Guidano le Iscrizioni Attuali?",
  "A3_spinner_1": "Analisi della classifica e dell'evoluzione dei corsi di laurea principali...",
  "A3_warning_analysis_failed": "Impossibile eseguire l'analisi di popolarità dei corsi di laurea. Stato: {status}",
  "A3_markdown_2": "A sinistra, vediamo la classifica di tutti i corsi di laurea in base alle loro iscrizioni totali nell'anno accademico più recente ({year_range}). A destra, vediamo l'evoluzione storica delle iscrizioni per i {top_n} corsi di laurea che si trovano attualmente in cima a questa classifica.",
  "A3_chart_title_evolution": "Evoluzione Storica (Top {n} Corsi di Laurea Attuali)",
  "A3_chart_yaxis_enrollment": "Iscrizioni Totali per Corso di Laurea",
  "A3_col_evo_top_info": "Nessun grafico di evoluzione è stato generato per i corsi di laurea attualmente in cima.",
  "A3_markdown_3": "**Punti Chiave del Podio:**\n*   **Leadership Indiscussa:** **Medicina** è saldamente posizionata come il corso di laurea con il maggior numero di iscritti (35.889 studenti), una costante che avevamo già intravisto analizzando i rami del sapere.\n*   **Forze Significative:** Seguono **Cultura Fisica** (14.695) e **Educazione Primaria** (12.867), dimostrando una notevole domanda in queste aree.\n*   **Top 5 Robusto:** **Infermieristica** (9.999) e **Contabilità e Finanza** (9.883) completano la top 5, entrambe con un numero di iscritti molto vicino a 10.000 studenti.\n*   **Evoluzione dei Leader:** Il grafico a destra ci permette di vedere come questi corsi di laurea (e altri nella top 10) abbiano raggiunto la loro posizione attuale. Notate come alcuni abbiano avuto una crescita più sostenuta, mentre altri mostrano picchi e valli più pronunciati.",
  "A3_game1_subheader": "Alla Prova: La Classifica di Popolarità",
  "A3_game1_intro": "Prima di vedere la classifica completa, quanto è buona la tua intuizione sulla domanda degli studenti? Ti presentiamo una selezione di corsi di laurea. Ordinali dal più popolare al meno popolare in base alle iscrizioni dell'ultimo anno!",
  "A3_game1_title": "Il Classificatore di Corsi di Laurea",
  "A3_subheader_4": "🚀 Il Ritmo del Cambiamento: Quali Corsi di Laurea Decollano o Atterrano?",
  "A3_markdown_4": "Il **Tasso di Crescita Annuo Composto (CAGR)** ci offre una prospettiva sul dinamismo. Calcola la crescita (o il calo) percentuale media annua delle iscrizioni di un corso di laurea, considerando l'intero periodo analizzato. Un CAGR elevato suggerisce una rapida espansione.",
  "A3_spinner_4": "Calcolo del dinamismo dei corsi di laurea (CAGR)...",
  "A3_warning_cagr_failed": "Impossibile eseguire l'analisi di crescita (CAGR). Stato: {status}",
  "A3_chart_title_cagr_top": "Top 15 per Maggiore Crescita Media Annua {periodo}",
  "A3_chart_title_cagr_bottom": "Top 15 per Maggiore Decrescita Media Annua {periodo}",
  "A3_cagr_top_title": "📈 Top 15 con la Crescita Maggiore",
  "A3_col_cagr_top_markdown_2": "Questi corsi di laurea hanno sperimentato l'espansione più notevole nelle loro iscrizioni medie annue.\n*   **Decollo Sorprendente:** **Servizi Odontoiatrici** è in testa con un CAGR superiore al 100%, il che indica un raddoppio (o più) delle sue iscrizioni medie anno dopo anno.\n*   **Ingegneria in Forte Crescita:** Diversi campi dell'ingegneria come **Artistica**, **Processi Agroindustriali** e **Informatica** mostrano una crescita molto sana.\n*   **Educazione con Slancio:** Rami dell'educazione come **Prescolare**, **Agraria** e **Primaria** figurano anche con un CAGR positivo e significativo.",
  "A3_cagr_bottom_title": "📉 Top 15 con la Decrescita Maggiore",
  "A3_col_cagr_bottom_markdown_2": "All'altro estremo, questi corsi di laurea hanno visto le loro iscrizioni medie annue diminuire o crescere a un ritmo molto più lento.\n*   **Aggiustamenti Notevoli:** **Studi Socioculturali** e **Stomatologia** (da non confondere con Servizi Odontoiatrici) presentano i maggiori cali medi.\n*   **Sfide Diverse:** Corsi di laurea come **Ingegneria Agraria**, **Arti Visive**, **Matematica**, **Musica** e diverse **Ingegnerie** (Idraulica, Civile, delle Telecomunicazioni, Industriale) compaiono anche in questa lista, suggerendo una revisione delle loro tendenze.",
  "A3_markdown_5": "**Riflessioni Strategiche da questi Ritmi:**\n*   Un **CAGR elevato** non significa sempre un numero totale di iscritti massiccio (potrebbe essere un piccolo corso di laurea che cresce velocemente), ma indica una **forte tendenza positiva** che merita attenzione, sia per incoraggiare che per garantire le risorse.\n*   Un **CAGR basso o negativo** in corsi di laurea importanti potrebbe essere un segnale per indagare le cause: cambiamenti nel mercato del lavoro, preferenze degli studenti, offerta accademica?\n*   È fondamentale incrociare queste informazioni del CAGR con le iscrizioni assolute (dalla classifica) per ottenere un quadro completo.",
  "A3_game2_subheader": "Duello di Crescita",
  "A3_game2_intro": "Alcuni corsi di laurea crescono a un ritmo vertiginoso mentre altri si contraggono. Riesci a identificare quale delle due opzioni ha avuto un tasso di crescita medio annuo più elevato? Accetta la sfida!",
  "A3_game2_title": "Duello di Crescita",
  "A3_duel_question": "Questo corso di laurea ha avuto una crescita media **MAGGIORE** dell'altro.",
  "A4_header": "♀️♂️ Bilanciare la Bilancia: Uno Sguardo alla Prospettiva di Genere",
  "A4_markdown_1": "L'università non forma solo professionisti, ma modella anche una società più giusta ed equa. In questa sezione, ci addentriamo nella composizione di genere delle iscrizioni universitarie. Esiste un equilibrio tra uomini e donne nelle aule? Ci sono aree del sapere tradizionalmente associate a un genere che mantengono questi schemi, o stiamo assistendo a una trasformazione verso una maggiore parità? Unisciti a noi per scoprirlo.",
  "A4_spinner_1": "Analisi della prospettiva di genere...",
  "A4_warning_analysis_failed": "Impossibile eseguire l'analisi di genere. Stato: {status}",
  "A4_fig_ramas_subheader": "Partecipazione Femminile per Ramo Scientifico ({curso})",
  "A4_chart_title_branches": "Percentuale di Donne per Ramo Scientifico ({curso})",
  "A4_chart_yaxis_women_pct": "% Donne",
  "A4_fig_ramas_markdown_1": "**Il Quadro Generale per Aree del Sapere:**\nQuesto grafico a barre ci mostra la percentuale di donne iscritte in ogni grande ramo scientifico. La linea rossa tratteggiata al 50% rappresenta la parità perfetta.\n\n*   **Leadership Femminile Pronunciata:** Le **Scienze Pedagogiche** si distinguono con oltre l'**80%** di iscrizioni femminili, seguite da vicino dalle **Scienze Sociali e Umanistiche** и le **Scienze Mediche**, entrambe che superano il **70%**. Ciò indica una forte presenza e preferenza femminile in queste importanti aree.\n*   **Maggioranza Femminile Sostenuta:** Le **Scienze Economiche**, le **Scienze delle Arti** и le **Scienze Naturali e Matematiche** mostrano anche una maggioranza di donne, con percentuali che vanno dal **55% al 65%**, posizionandosi al di sopra della linea di parità.\n*   **Vicino alla Parità o Leggera Maggioranza Maschile:** Le **Scienze Agrarie** sono più vicine all'equilibrio, sebbene ancora сon una leggera maggioranza femminile (quasi il 50%).\n*   **Sfide nelle Aree Tecniche e Sportive:** Al contrario, le **Scienze Tecniche** (circa il 35% di donne) e, in modo più marcato, le **Scienze della Cultura Fisica e dello Sport** (circa il 32% di donne) sono i rami con la più bassa rappresentanza femminile, indicando un persistente divario di genere in questi campi.",
  "A4_info_no_branch_data": "Nessun dato di genere per ramo disponibile da mostrare.",
  "A4_fig_carreras_subheader": "Zoom sui Corsi di Laurea: Estremi dello Spettro di Genere ({curso}, Iscrizioni >= 30)",
  "A4_legend_major_women": "Maggioranza Donne",
  "A4_legend_minor_women": "Minoranza Donne",
  "A4_chart_title_careers_gender": "Squilibrio di Genere nei Corsi di Laurea ({curso}, Iscrizioni >= 30)",
  "A4_subplot_title_top_women": "Top 10 Corsi di Laurea con la più alta % di Donne",
  "A4_subplot_title_low_women": "Top 10 Corsi di Laurea con la più bassa % di Donne",
  "A4_fig_carreras_markdown_1": "**Casi Salienti di Maggioranza e Minoranza Femminile:**\nQuesti grafici ci portano al dettaglio dei corsi di laurea, mostrando i 10 con la più alta percentuale di donne e i 10 con la percentuale più bassa (cioè, maggiore presenza maschile), a condizione che abbiano un'iscrizione di almeno 30 studenti per garantire la rappresentatività.\n\n*   **Femminilizzazione Estrema in Alcune Aree:** Corsi di laurea come **Educazione Prescolare** si avvicinano al 100% di iscrizioni femminili. Altri, come **Tecnico Superiore in Logopedia e Audiologia**, **Educazione in Logopedia** и **Educazione Spagnolo-Letteratura**, mostrano anche una schiacciante maggioranza di donne, superando il 90%. Ciò è coerente con l'alta femminilizzazione delle Scienze Pedagogiche. Anche **Servizi Odontoiatrici** и **Studi Socioculturali** si distinguono in questo gruppo.\n\n*   **Dominio Maschile in Ingegneria e Aree Tecniche:** All'altro estremo, corsi di laurea come **Ingegneria Informatica**, **Ingegneria dell'Automazione**, **Scienze Informatiche**, **Gestione dei Processi di Investimento** и diverse **Ingegnerie Meccanica, Elettrica e Tecnici Superiori in Allenamento Sportivo** presentano percentuali di donne molto basse, alcune al di sotto del 10% e la maggior parte al di sotto del 25%. Ciò riflette il divario osservato nelle Scienze Tecniche e sportive a livello di ramo.\n\n*   **Sfumature Importanti:** È fondamentale notare che anche all'interno della \"Top 10 con la più bassa % di Donne\", le percentuali variano. Mentre alcuni corsi di ingegneria superano a malapena il 5-10% di presenza femminile, altri possono essere più vicini al 20-25%.",
  "A4_info_no_career_data": "Dati insufficienti sui corsi di laurea per mostrare l'analisi degli estremi di genere.",
  "A4_markdown_2": "---\n**Riflessioni per l'Azione:**\n*   L'alta femminilizzazione in alcuni rami e corsi di laurea è un fenomeno consolidato. Sebbene rifletta vocazioni, è anche importante assicurarsi che non esistano barriere implicite o disincentivi alla partecipazione maschile.\n*   La sfida maggiore per l'equità di genere si trova chiaramente nelle **Scienze Tecniche** e in diversi corsi di ingegneria specifici, così come nelle **Scienze della Cultura Fisica e dello Sport**. Sono necessarie strategie continue ed efficaci per attrarre e trattenere più donne in questi campi cruciali per lo sviluppo tecnologico e sociale.\n*   Questi dati sono un invito ad approfondire: Quali sono le cause di questi squilibri? Come possiamo ispirare le nuove generazioni a esplorare tutte le aree del sapere senza pregiudizi di genere?",
  "A4_game1_subheader": "Duello di Genere per Ramo",
  "A4_game1_intro": "Alcune aree del sapere attirano più donne di altre. Sapresti dire in quale dei seguenti rami c'è una percentuale maggiore di iscrizioni femminili?",
  "A4_game1_title": "Duello di Rami",
  "A4_duel_question": "Quale ramo ha una percentuale PIÙ ALTA di donne?",
  "A4_game2_subheader": "Aspetta! C'è un intruso tra i corsi di laurea!",
  "A4_game2_intro": "Tre dei seguenti corsi di laurea hanno una schiacciante maggioranza di donne nelle loro aule. Uno, tuttavia, è un campo a predominanza maschile. Identifica l'intruso!",
  "A4_game2_title": "L'Intruso di Genere",
  "A5_header": "🏛️ Le Università in Prospettiva: Scoprire Punti di Forza e Aree di Specializzazione",
  "A5_markdown_1": "Ogni università è un ecosistema unico con la sua storia, vocazione e aree di eccellenza. In questa sezione, cambiamo la nostra prospettiva per analizzare come si distribuisce il talento studentesco a livello istituzionale. Quali università concentrano il maggior numero di studenti? Esistono centri altamente specializzati in determinati rami o corsi di laurea? E quali corsi di laurea sono gioielli rari, offerti solo da poche istituzioni?",
  "A5_spinner_1": "Analisi della distribuzione istituzionale delle iscrizioni...",
  "A5_warning_analysis_failed": "Impossibile eseguire l'analisi istituzionale. Stato: {status}",
  "A5_fig_treemap_subheader": "Mappa Interattiva delle Iscrizioni Universitarie ({curso})",
  "A5_treemap_root_label": "Tutte le Università",
  "A5_treemap_title": "Distribuzione delle Iscrizioni ({curso})",
  "A5_fig_treemap_markdown_1": "**Navigare nell'Universo Istituzionale:**\nQuesta \"mappa ad albero\" (treemap) è una rappresentazione visiva delle iscrizioni totali.\n*   **La Dimensione Conta:** L'area di ogni rettangolo è proporzionale al numero di studenti. Inizia con \"Tutte le Università\"; fai clic su un'università (ad es. `UCLV`, `UH`, `CUJAE`) per vedere come si suddividono le sue iscrizioni per rami scientifici. Un altro clic su un ramo ti mostrerà i corsi di laurea al suo interno e il loro peso in quella istituzione.\n*   **Identificare i Giganti:** A colpo d'occhio, puoi identificare le università con il maggior volume di studenti. Ad esempio, l'**UO (Università d'Oriente)**, l'**UH (Università dell'Avana)** e l'**UCMLH (Università di Scienze Mediche dell'Avana)**, tra le altre, mostrano rettangoli considerevolmente grandi, indicando un numero significativo di iscritti.\n*   **Aree di Specializzazione:** Nota come alcune università abbiano quasi tutta la loro \"area\" concentrata in uno o due rami (ad es. le Università di Scienze Mediche prevalentemente in \"Scienze Mediche\"), mentre altre mostrano una maggiore diversificazione. Come si osserva, le Scienze Mediche si distinguono in tutte le università che le offrono.",
  "A5_info_no_treemap_data": "Nessun dato disponibile per generare la mappa interattiva.",
  "A5_df_carreras_unicas_subheader": "Gioielli Accademici: Corsi di Laurea per Livello di Esclusività",
  "A5_df_carreras_unicas_markdown_new": "Questo grafico raggruppa i corsi di laurea in base al numero di università che li offrono nell'anno accademico {curso}. Ogni punto rappresenta un corso di laurea. Passa il mouse su un punto per vedere il suo nome. Le annotazioni in alto indicano quanti corsi di laurea esistono in ogni gruppo di esclusività.",
  "A5_chart_title_grouped_offer": "Distribuzione dei Corsi di Laurea per Esclusività dell'Offerta",
  "A5_chart_yaxis_num_unis": "N. di Università Offrenti",
  "_carrers": "corsi di laurea",
  "A5_expander_show_all_data": "Visualizza la tabella completa con tutti i corsi di laurea",
  "A5_info_no_limited_offer_data": "Nessun dato trovato sui corsi di laurea con offerta limitata.",
  "A5_game1_subheader": "GeoGuesser Universitario",
  "A5_game1_intro": "Prima di analizzare le università in dettaglio, conosci la loro ubicazione? Dimostralo!",
  "A5_game1_title": "Indovina la Provincia",
  "A5_game2_subheader": "Indovina l'Esclusività",
  "A5_game2_intro": "Alcuni corsi di laurea sono insegnati in tutto il paese, mentre altri sono vere rarità. Quanto pensi sia esclusivo il seguente corso di laurea?",
  "A5_game2_title": "Lo Stimatore di Esclusività",
  "A5_subheader_2": "Focus sui Corsi di Laurea Chiave: Chi è Chi nella Formazione Specifica?",
  "A5_markdown_2": "Seleziona fino a 3 corsi di laurea di interesse. Il grafico mostrerà l'evoluzione storica delle iscrizioni per quei corsi, suddivisa per ogni università che li offre. Questo ci permette di confrontare il peso e la traiettoria di diverse istituzioni nella formazione di professionisti in campi specifici.\n\n*Se il grafico sembra troppo denso, prova a selezionare meno corsi di laurea o concentrati sulle tendenze generali delle università più grandi per ogni corso.*",
  "A5_multiselect_carreras": "Corsi di laurea per confrontare le evoluzioni per università:",
  "A5_spinner_2": "Generazione del grafico comparativo per università...",
  "A5_chart_title_uni_comparison": "Evoluzione per Università per: {careers}",
  "A5_chart_yaxis_enrollment": "Iscrizioni Totali",
  "A5_warning_comparison_failed": "Impossibile generare il grafico comparativo. Causa: {status}",
  "A5_no_carreras_selected": "Scegli almeno un corso di laurea per vedere il confronto.",
  "A5_markdown_3": "---\n**Visioni Strategiche per la Rete Universitaria:**\n*   **Potenziare l'Eccellenza:** Identificare le università leader in corsi di laurea chiave può guidare gli investimenti per trasformarle in centri di riferimento nazionali o internazionali.\n*   **Ottimizzare le Risorse:** La mappa ad albero e l'analisi delle offerte uniche possono rivelare duplicazioni non necessarie o, al contrario, la necessità di espandere l'offerta di determinati corsi di laurea in più regioni.\n*   **Collaborazione Interistituzionale:** Conoscere i punti di forza di ciascuna può favorire sinergie, programmi congiunti e mobilità di studenti e docenti.",
  "A6_header_1": "🔭 Guardando al Domani: Cosa Potremmo Aspettarci? (Proiezioni Future)",
  "A6_markdown_1": "Anticipare il futuro è una sfida, ma analizzare le tendenze recenti ci permette di delineare scenari possibili. In questa sezione, riesamineremo i nostri indicatori chiave di iscrizione, ma questa volta estendendo il nostro sguardo ai prossimi due anni accademici attraverso proiezioni.\n\n⚠️ **Una Bussola, non un Oracolo:** È fondamentale ricordare che queste sono **proiezioni**, non previsioni infallibili. Si basano su semplici modelli di **Regressione Lineare applicati agli ultimi 6 anni di dati storici** (o meno, se i dati sono insufficienti per un ramo o un corso di laurea specifico). Molteplici fattori non considerati in questi modelli (cambiamenti politici, crisi economiche, nuove esigenze sociali, ecc.) potrebbero alterare significativamente queste traiettorie. Usiamole come strumento di riflessione strategica e pianificazione proattiva, non come un destino scritto nella pietra.",
  "A6_chart_title_projection": "Evoluzione e Proiezione (Reg. Lin. ultimi {n_years} anni)",
  "A6_chart_title_branches_projection": "Evoluzione e Proiezione per Ramo (Reg. Lin. ultimi {n_years} anni o meno)",
  "A6_subheader_1": "Orizzonte Nazionale: Proiezione delle Iscrizioni Totali",
  "A6_spinner_1": "Calcolo della proiezione delle iscrizioni nazionali...",
  "A6_info_1": "Le linee tratteggiate e i punti a forma di diamante oltre l'anno accademico 2024-2025 rappresentano le proiezioni.",
  "A6_markdown_national_explanation": "**Interpretazione della Tendenza Nazionale Proiettata:**\n\nIl grafico superiore combina l'evoluzione storica delle iscrizioni (barre e linea continua fino all'anno accademico 2024-25) con una proiezione per i prossimi due anni accademici (linea tratteggiata con diamanti).\n\n*   **Punto di Partenza:** La proiezione inizia dall'ultimo dato storico registrato, che mostra iscrizioni nazionali di circa **205.000 studenti**.\n*   **Traiettoria Proiettata:** Il modello di regressione lineare, basato sulla tendenza degli ultimi anni, suggerisce una **continuazione della fase di aggiustamento o declino moderato** osservata nel periodo più recente.\n*   **Stime Future:**\n    *   Per l'anno accademico **2025-2026**, il modello stima iscrizioni che potrebbero attestarsi tra **195.000 e 215.000 studenti**.\n    *   Verso il **2026-2027**, questa cifra potrebbe scendere intorno ai **185.000-190.000 studenti**.\n*   **Implicazione Strategica:** Se questa tendenza si concretizzasse, solleverebbe importanti questioni per la pianificazione: Come influenzerebbe la capacità installata nelle università? Richiederebbe una rivalutazione dell'allocazione delle risorse o nuove strategie di reclutamento e ritenzione degli studenti a livello nazionale?",
  "A6_warning_national_proj_failed": "Impossibile generare la proiezione nazionale. Stato: {status}",
  "A6_fig_A2_subheader": "Saperi di Domani: Proiezione per Ramo Scientifico",
  "A6_fig_A2_spinner": "Calcolo della proiezione per ramo scientifico...",
  "A6_warning_branches_proj_failed": "Impossibile generare la proiezione per ramo.",
  "A6_fig_A7_subheader_1": "Corsi di Laurea Chiave all'Orizzonte: Proiezione Interattiva",
  "A6_fig_A7_markdown_1": "Seleziona fino a 3 corsi di laurea di interesse per visualizzare la loro proiezione di iscrizione individuale.",
  "A6_fig_A7_multiselect_1": "Seleziona corsi di laurea da proiettare:",
  "A6_fig_A7_spinner_1": "Calcolo della proiezione per i corsi di laurea selezionati...",
  "A6_game_subheader": "🔮 L'Oracolo delle Iscrizioni",
  "A6_game_intro": "Prima di rivelare le proiezioni del modello, mettiamo alla prova la tua intuizione di analista. Osserva la traiettoria storica delle iscrizioni nazionali. Basandoti su questa tendenza, cosa pensi sia accaduto nell'ultimo anno registrato? La tendenza è continuata, si è stabilizzata o si è invertita?",
  "A6_game_item_name": "Iscrizioni Nazionali",
  "A6_game_title": "Prevedi la Tendenza Nazionale",
  "A7_header_1": "💡 Aree di Attenzione: Sfide e Opportunità Specifiche",
  "A7_markdown_1": "Oltre alle grandi tendenze, esistono situazioni particolari in corsi di laurea e università che meritano uno sguardo speciale. Alcuni corsi di laurea possono emergere con vigore, altri potrebbero aver concluso il loro ciclo di offerta, e un terzo gruppo potrebbe faticare ad attrarre un numero sufficiente di studenti. Identificare questi casi non significa segnalare problemi, ma scoprire opportunità per una gestione accademica più precisa, agile e adattata alle realtà mutevoli.",
  "A7_spinner_1": "Identificazione di aree di attenzione specifiche...",
  "A7_error_a8_analysis": "Impossibile completare l'analisi delle aree di attenzione.",
  "A7_a8_subheader_1": "🌱 Seminare il Futuro: Nuove Offerte o Riattivazioni Possibili",
  "A7_a8_markdown_1": "Il seguente grafico mostra quanti nuovi corsi di laurea o riattivati sono stati rilevati ogni anno. Ciò rivela i periodi di maggiore espansione o rinnovamento dell'offerta accademica.",
  "A7_chart_title_new_offers": "Nuove Offerte o Riattivazioni Rilevate per Anno",
  "A7_chart_xaxis_year_new_offers": "Anno di Rilevamento/Riattivazione",
  "A7_expander_new_offers": "Visualizza l'elenco completo delle {count} nuove offerte rilevate",
  "A7_col_detected_start_year": "Anno di Inizio Rilevato",
  "A7_col_current_enrollment": "Iscrizioni Attuali",
  "A7_info_no_new_offers": "Nessun corso di laurea è stato identificato come rispondente chiaramente al criterio di nuova offerta o riattivazione.",
  "A7_a8_subheader_2": "🍂 Cicli che si Concludono: Possibili Cessazioni di Offerta",
  "A7_a8_markdown_2_revised": "Questo grafico riassume quanti corsi di laurea hanno smesso di avere iscritti per anno, dandoci un'idea dei periodi con i maggiori aggiustamenti o interruzioni nell'offerta accademica.",
  "A7_chart_title_ceased_offers": "Possibili Cessazioni di Offerta per Ultimo Anno con Iscrizione",
  "A7_chart_xaxis_last_year": "Ultimo Anno con Iscrizione",
  "A7_expander_ceased_offers": "Visualizza l'elenco completo delle {count} offerte possibilmente cessate",
  "A7_col_last_enrollment_year": "Ultimo Anno con Iscrizione",
  "A7_info_no_ceased_offers": "Nessun corso di laurea è stato identificato come rispondente chiaramente al criterio di cessazione dell'offerta.",
  "A7_a8_subheader_3": "📉 Aree di Attenzione: Iscrizioni Ridotte (Inferiori a {umbral})",
  "A7_a8_markdown_3_revised": "Il seguente grafico raggruppa i corsi di laurea in base al loro livello di iscrizione nell'anno accademico {curso}. Ogni punto rappresenta un corso di laurea in un'università specifica. Passa il cursore su un punto per vedere i dettagli. Questo ci aiuta a vedere dove si concentrano i casi di iscrizione più critici (ad es. 1 o 2 studenti).",
  "A7_chart_title_low_enrollment": "Offerte con Iscrizioni Ridotte (Anno Accademico {curso}, < {umbral} Studenti)",
  "A7_chart_yaxis_low_enrollment": "Numero di Studenti",
  "A7_expander_low_enrollment": "Visualizza l'elenco completo dei {count} corsi di laurea con iscrizioni ridotte",
  "A7_col_enrollment_last_year": "Iscrizioni ({curso})",
  "A7_info_no_low_enrollment": "Nessun corso di laurea con iscrizioni inferiori a {umbral} (e >0) è stato identificato nell'ultimo anno.",
  "A7_conclusion_markdown_1": "---\n**Decisioni Informate per una Gestione Proattiva:**\nLe informazioni presentate in questa sezione sono un appello a un'azione specifica:\n*   **Nuove Offerte / Riattivazioni:**\n    *   **Verificare:** Corrispondono a lanci o riattivazioni pianificate?\n    *   **Monitorare:** Valutare la loro evoluzione iniziale, le esigenze di risorse e le strategie di consolidamento.\n    *   **Imparare:** Rispondono a una domanda sociale o lavorativa emergente che potrebbe essere replicata?\n*   **Possibili Cessazioni di Offerta:**\n    *   **Confermare:** L'interruzione è ufficiale e definitiva? Aggiornare i registri se necessario.\n    *   **Valutare l'Impatto:** Se la cessazione non era pianificata o ha implicazioni negative (ad es. l'unica offerta in una regione), indagarne le cause.\n*   **Iscrizioni Ridotte:**\n    *   **Analisi delle Cause profonde:** Si tratta di corsi di laurea altamente specializzati con una domanda limitata per natura? Problemi di reclutamento? Curriculum obsoleto? Mancanza di pertinenza lavorativa?\n    *   **Strategie Differenziate:** A seconda della diagnosi, le azioni potrebbero variare dalla promozione mirata, alla riprogettazione del curriculum, fino alla considerazione di una fusione con altri corsi di laurea o, in ultima istanza, a un'interruzione pianificata se il suo mantenimento non è giustificato.\n\nUna gestione attenta a questi dettagli consente di ottimizzare le risorse, rispondere meglio alle esigenze del paese e garantire la vitalità e la pertinenza dell'offerta accademica universitaria.",
  "A7_game_subheader": "🕵️‍♂️ Trova l'Area di Attenzione",
  "A7_game_intro": "Tra le molteplici offerte accademiche delle università, alcune prosperano con centinaia di studenti, mentre altre faticano a rimanere a galla. Di seguito, presentiamo quattro offerte universitarie. Tre di esse hanno iscrizioni sane, ma una è un'\"area di attenzione\" con iscrizioni criticamente basse. Riesci a identificare l'intruso?",
  "A7_game_title": "L'Intruso con Iscrizioni Basse",
  "A7_chart_yaxis_enrollment": "Iscrizioni Totali",
  "A7_chart_title_projection": "Proiezione delle Iscrizioni per i Corsi di Laurea Selezionati",
  "a7_proy_warning": "Impossibile generare dati di proiezione per: {careers}.",
  "a7_void_info": "Seleziona almeno un corso di laurea per vedere la sua proiezione.",
  "a7_end_markdown": "---\n**Pianificare con una Visione per il Futuro:**\nQueste proiezioni, con tutti i loro limiti, sono un input prezioso per:\n*   Anticipare le esigenze di **infrastrutture e corpo docente**.\n*   Discutere l'**assegnazione di posti e risorse** tra diverse aree e corsi di laurea.\n*   Identificare le aree che potrebbero richiedere **strategie proattive** per invertire le tendenze negative o per gestire una crescita sostenibile.\n*   Promuovere un dialogo informato sul **futuro dell'offerta accademica** a Cuba.",
  "B1_header_1": "🔬 Laboratorio: Profilo Dettagliato del Corso di Laurea",
  "B1_markdown_1": "Immergiti nei dettagli del corso di laurea che scegli. Scopri la sua evoluzione storica, il suo tasso di crescita e una panoramica annuale delle università e della composizione di genere.",
  "B1_selectbox_label_1": "Seleziona un Corso di Laurea per analizzarne il profilo:",
  "b1_info_select_career": "Seleziona un Corso di Laurea per continuare.",
  "B1_spinner_1_hist": "Generazione del profilo storico per {career}...",
  "B1_subheader_1_hist": "Evoluzione e Crescita di: {career}",
  "B1_markdown_1_rama": "Ramo Scientifico",
  "B1_chart_title_evolution_stacked": "Evoluzione e Composizione delle Iscrizioni: {career}",
  "B1_info_no_evolution_data": "Nessun dato di evoluzione disponibile per questo corso di laurea.",
  "B1_slider_label_cagr": "Seleziona l'intervallo di anni per il calcolo del CAGR:",
  "B1_subheader_2_snapshot": "Analisi Annuale Dettagliata",
  "B1_slider_label_snapshot": "Seleziona un anno per vedere i dettagli:",
  "B1_spinner_2_snapshot": "Caricamento dati per l'anno {year}...",
  "B1_pie_title_genero_yearly": "Distribuzione di Genere ({curso})",
  "B1_info_no_gender_data_pie": "Nessun dato di genere per quest'anno.",
  "b1_bar_chart_title": "Iscrizioni per Università",
  "b1_info_no_universities_data_year": "Nessuna università ha registrato iscrizioni in quest'anno.",
  "b1_warning_no_data_for_year": "Nessun dato trovato per il corso di laurea '{career}' nell'anno {year}.",
  "b2_header": "🗺️ Guida alle Istituzioni: Esplora l'Offerta Accademica per Località",
  "b2_intro": "Scopri le istituzioni di istruzione superiore a Cuba, filtrando per provincia e comune. Per ogni università, troverai informazioni generali e l'offerta accademica per rami e corsi di laurea nell'anno che selezioni.",
  "b2_error_no_institutions_data": "I dati delle istituzioni non sono disponibili. Questa sezione non può essere visualizzata.",
  "b2_error_no_enrollment_data": "I dati delle iscrizioni non sono disponibili. Le informazioni sull'offerta saranno limitate.",
  "b2_subheader_filters": "Filtri di Ricerca:",
  "b2_label_province": "Provincia:",
  "b2_label_municipality": "Comune:",
  "b2_label_search_pattern": "Cerca per nome o sigla dell'istituzione (filtro visivo):",
  "b2_spinner_loading": "Caricamento guida alle istituzioni...",
  "b2_warning_basic_analysis_failed": "Impossibile caricare l'elenco di base delle istituzioni. Stato: {status}",
  "b2_info_showing_unis": "Visualizzazione di {shown} su {total} istituzione(i) ({last_year}).",
  "b2_warning_no_years_for_detail": "Nessun anno di iscrizione disponibile per visualizzare i dettagli.",
  "b2_slider_year_detail": "Seleziona l'anno per vedere l'offerta accademica dettagliata:",
  "b2_info_no_unis_matched_filters": "Nessuna istituzione trovata che corrisponda ai filtri applicati.",
  "b2_pie_title_gender_total": "Genere Totale ({curso})",
  "b2_caption_no_gender_data_for_year": "Nessun dato di genere disponibile per {curso}.",
  "b2_markdown_academic_offering": "**Offerta Accademica ({curso}, rami e corsi di laurea con iscritti):**",
  "b2_info_no_branches_for_year": "Questa istituzione non ha rami scientifici attivi o corsi di laurea con iscritti segnalati per {curso}.",
  "conclusion_header": "🏁 Conclusioni e Orizzonti Futuri: Forgiare l'Università di Domani",
  "conclusion_intro": "Abbiamo viaggiato attraverso un decennio di dati, esplorando il complesso ecosistema dell'istruzione superiore a Cuba. Che sia come analista o esploratore, ogni grafico sbloccato e ogni sfida superata è stata un pezzo di un puzzle più grande: la storia di migliaia di aspirazioni, di sforzi istituzionali e della ricerca incessante della conoscenza che definisce la nostra nazione.\n\nQuesta analisi non è un punto di arrivo, ma un faro che illumina il cammino percorso e ci aiuta a discernere i sentieri che si aprono davanti a noi.",
  "conclusion_success_message": "**L'informazione è potere, e il potere di questi dati risiede nella nostra capacità di trasformarli in azione saggia e visione strategica.**",
  "conclusion_findings_subheader": "🌟 Punti Salienti del Viaggio: Principali Risultati",
  "conclusion_findings_text": "Guardando indietro alla nostra analisi, emergono diversi fari che guidano la nostra comprensione:\n\n1.  **Il Polso Dinamico della Nazione:** Le iscrizioni universitarie nazionali hanno mostrato una notevole capacità di espansione, raggiungendo picchi significativi all'inizio degli anni 2020, seguiti da una fase di aggiustamento più recente. Questa fluttuazione ci ricorda la sensibilità del sistema ai fattori contestuali e la necessità di una pianificazione flessibile. *(Rif. Sezione 1)*\n\n2.  **Il Cuore Medico e l'Anima Pedagogica:** Le **Scienze Mediche** si consolidano come la colonna vertebrale in termini di volume di studenti, una testimonianza della loro importanza strategica. Le **Scienze Pedagogiche**, d'altra parte, hanno dimostrato un dinamismo straordinario, con una crescita massiccia seguita da una contrazione, riflettendo possibili cambiamenti nella domanda o nelle politiche di formazione degli insegnanti. *(Rif. Sezione 2)*\n\n3.  **L'Ascesa di Nuove Vocazioni:** L'analisi della crescita (CAGR) ha rivelato il decollo impressionante di corsi di laurea come **Servizi Odontoiatrici** e il vigore di diverse **Ingegnerie** (Artistica, Processi Agroindustriali, Informatica), segnalando potenziali nuove frontiere di interesse e domanda lavorativa. *(Rif. Sezione 3)*\n\n4.  **Progressi e Sfide nell'Equità di Genere:** Sebbene Cuba mostri un'alta partecipazione femminile nell'istruzione superiore, con molti rami e corsi di laurea che mostrano una maggioranza di donne, persistono sfide significative. La sottorappresentazione femminile nelle **Scienze Tecniche** e in **corsi di Ingegneria specifici**, così come nelle **Scienze della Cultura Fisica e dello Sport**, ci chiama a raddoppiare gli sforzi per costruire un panorama veramente equo. *(Rif. Sezione 4)*\n\n5.  **La Ricchezza della Diversità Istituzionale:** Ogni università porta la sua sfumatura unica al sistema. Abbiamo visto di tutto, da grandi centri multidisciplinari a istituzioni con una marcata specializzazione (come le Università di Scienze Mediche). L'identificazione di corsi di laurea con offerta limitata sottolinea l'importanza di una rete universitaria coordinata e strategicamente distribuita. *(Rif. Sezione 5)*\n\n6.  **Uno Sguardo Prudente al Domani:** Le proiezioni, sebbene soggette all'incertezza intrinseca del futuro, suggeriscono una possibile continuazione della fase di aggiustamento delle iscrizioni generali e in diversi rami e corsi di laurea chiave. Questo non è un presagio, ma un invito alla preparazione e all'azione proattiva. *(Rif. Sezione 6)*\n\n7.  **L'Importanza dei Dettagli:** L'analisi delle \"Aree di Attenzione\" ci ha ricordato che la salute del sistema risiede anche nella vitalità di ciascuno dei suoi componenti, inclusi i corsi di laurea emergenti, quelli con basse iscrizioni o quelli che potrebbero concludere il loro ciclo. *(Rif. Sezione 7)*",
  "conclusion_player_summary_header": "🏆 Riepilogo della Tua Avventura come Esploratore",
  "metric_total_score": "Punteggio Finale",
  "metric_games_played": "Giochi Completati",
  "metric_analyst_profile": "Profilo Analista",
  "profile_strategist": "Lo Stratega",
  "profile_strategist_desc": "La tua forza è classificare e ordinare. Vedi il quadro generale e metti ogni pezzo al suo posto.",
  "profile_competitor": "Il Competitore",
  "profile_competitor_desc": "Ami i duelli. Confrontare e scegliere il vincitore è la tua specialità.",
  "profile_visionary": "Il Visionario",
  "profile_visionary_desc": "Hai un dono per stimare cifre e grandezze con precisione.",
  "profile_prophet": "Il Profeta",
  "profile_prophet_desc": "Intuisci le tendenze future come nessun altro. La tua sfera di cristallo funziona!",
  "profile_cartographer": "Il Cartografo",
  "profile_cartographer_desc": "Conosci il terreno. Individuare ogni istituzione sulla mappa è il tuo talento naturale.",
  "profile_detective": "Il Detective",
  "profile_detective_desc": "Nessuno può ingannarti. Sei un esperto nel trovare l'elemento che non c'entra.",
  "profile_scholar": "L'Erudito",
  "profile_scholar_desc": "Rispondi a domande dirette con conoscenza e certezza.",
  "profile_explorer": "L'Esploratore",
  "profile_explorer_desc": "Ti godi il viaggio e impari da ogni sfida, coprendo tutte le aree.",
  "leaderboard_header": "Classifica Globale degli Esploratori",
  "leaderboard_intro": "Competi con altri analisti e lascia il tuo segno in classifica. Sarai tra i migliori?",
  "player_name_label": "Il tuo nome per la classifica:",
  "submit_score_button": "🚀 Invia il mio punteggio!",
  "enter_name_warning": "Per favore, inserisci un nome.",
  "score_submitted_info": "Il tuo punteggio è già stato inviato! Grazie per aver partecipato.",
  "loading_leaderboard_spinner": "Caricamento della classifica...",
  "leaderboard_col_timestamp": "Data",
  "leaderboard_col_playername": "Giocatore",
  "leaderboard_col_score": "Punteggio",
  "leaderboard_empty_caption": "La classifica è vuota. Sii il primo a comparire!",
  "leaderboard_connection_warning": "Impossibile connettersi al servizio di classifica. La funzionalità non è disponibile al momento.",
  "conclusion_recommendations_subheader": "🧭 Tracciare la Rotta: Raccomandazioni Strategiche",
  "conclusion_recommendations_text": "Con questi risultati come bussola, proponiamo le seguenti linee d'azione per la Sede Centrale e tutti gli attori coinvolti nell'Istruzione Superiore cubana:\n\n*   **Rafforzare l'Osservatorio dell'Istruzione Superiore:**\n    *   **Azione:** Mantenere e arricchire questo sistema di analisi dei dati come strumento permanente per il monitoraggio delle tendenze, la valutazione delle politiche e la presa di decisioni informate.\n    *   **Impatto Atteso:** Maggiore agilità e reattività del sistema alle dinamiche mutevoli.\n\n*   **Promuovere la Pertinenza e la Qualità con una Visione Futura:**\n    *   **Azione:** Condurre studi prospettici continui sulle esigenze dello sviluppo socioeconomico del paese e sulle richieste del mercato del lavoro per allineare l'offerta accademica. Valutare e aggiornare i curricula dei corsi di laurea con bassa domanda o in calo, e investire in quelli con potenziale di crescita e rilevanza strategica.\n    *   **Impatto Atteso:** Laureati meglio preparati per le sfide del futuro e un maggiore contributo dell'università allo sviluppo nazionale.\n\n*   **Promuovere l'Equità di Genere in Tutte le Discipline:**\n    *   **Azione:** Progettare e implementare programmi specifici e sostenuti per incoraggiare la partecipazione femminile nei corsi di laurea STEM e in altre aree sottorappresentate, e viceversa, affrontando gli stereotipi fin dalle prime fasi dell'istruzione.\n    *   **Impatto Atteso:** Un sistema universitario più inclusivo che sfrutti il talento di tutta la popolazione senza pregiudizi di genere.\n\n*   **Ottimizzare la Rete Universitaria e Promuovere la Collaborazione:**\n    *   **Azione:** Utilizzare le analisi di specializzazione e distribuzione per prendere decisioni sull'apertura, fusione o chiusura di corsi di laurea in diverse istituzioni, cercando efficienza, qualità e una copertura territoriale equa. Promuovere la creazione di reti di conoscenza и programmi inter-universitari.\n    *   **Impatto Atteso:** Un sistema più coeso, con centri di eccellenza rafforzati e un migliore utilizzo delle risorse disponibili.\n\n*   **Integrare la Voce degli Stakeholder:**\n    *   **Azione:** Integrare le analisi quantitative con ricerche qualitative che raccolgano le percezioni e le esperienze di studenti, professori, laureati e datori di lavoro.\n    *   **Impatto Atteso:** Decisioni più olistiche e politiche meglio adattate alle realtà e alle aspettative della comunità universitaria e della società.",
  "conclusion_final_header": "✨ Un'Eredità Continua, un Futuro Luminoso",
  "conclusion_final_paragraph": "L'analisi di questi dati non è un mero esercizio accademico; è un atto di responsabilità e un impegno per il futuro. Le Università Cubane, ognuna con la sua ricca storia e il suo ruolo trascendentale nella società, affrontano la sfida e l'opportunità di continuare a evolversi, adattarsi e innovare.\n\nSperiamo che questi dati ispirino tutti a lavorare insieme per un'istruzione superiore che non solo risponda alle esigenze del presente, ma che modelli attivamente un domani più prospero, giusto e ricco di conoscenza per tutti i giovani cubani."
}