{
  "settings_title": "Configurações",
  "save": "Salvar",
  "load_df_error": "Erro crítico: Não foi possível carregar os dados ('db.parquet'). A aplicação não pode continuar.",
  "load_screen_title": "🎓 Análise Estratégica da Matrícula Universitária em Cuba",
  "main_image_caption": "Universidade de Havana. Um símbolo do ensino superior em Cuba.",
  "main_markdown_1": "Uma jornada para iluminar o caminho do Ensino Superior.",
  "sidebar_title": "🧭 Explorador de seções",
  "sidebar_radio_title_main": "Escolha uma seção:",
  "sidebar_radio_title_sub_prefix": "Subseção: ",
  "sidebar_info": "Análise baseada em dados de matrícula do período 2015-16 a 2024-25.\n\n -- ⚠️ Não inclui o ano letivo 2018-2019 por falta de dados; as análises são realizadas omitindo este ano.",
  "subseccion_not_valid_in": "Subseção inválida em ",
  "back": "Anterior: ",
  "next": "Próximo: ",
  "authors": "Autores:",
  "author_reynier": "Reynier Ramos González",
  "author_ernesto": "Ernesto Herrera García",
  "lang_select_label": "Idioma / Idioma",
  "lang_select_help": "Selecione o seu idioma de preferência para a aplicação.",
  "_women": "Mulheres",
  "_men": "Homens",
  "_total_enrollment": "Matrícula Total",
  "_total_enrollment_projected": "Matrícula Total (Projetada)",
  "_total_enrollment_historical": "Matrícula Total (Histórica)",
  "_projection_start": "Início da Projeção",
  "_academic_year": "Ano Letivo",
  "_enrollment": "Matrícula",
  "_legend": "Legenda",
  "_projected_short": "Proj.",
  "_50_parity": "Paridade 50%",
  "_university": "Universidade",
  "_date": "Dado",
  "_career": "Curso",
  "_offers": "ofertas",
  "_elements": "elementos",
  "_number_of_students": "Número de estudantes",
  "_all_provinces": "TODAS AS PROVÍNCIAS",
  "_all_municipalities": "TODOS OS MUNICÍPIOS",
  "_founded_in": "Fundada em",
  "_organism": "Organismo",
  "_address": "Endereço",
  "_main_modality": "Modalidade Principal",
  "generic_warn_figs": "Não foi possível gerar o gráfico do panorama nacional (A1).",
  "ask_ai_component": {
    "ai_initial_response_text": "🤖 Perguntas sobre esta análise? Pergunte ao Assistente de IA!",
    "restart_conversation": "Reiniciar esta conversa",
    "your_question_here": "Escreva sua pergunta aqui...",
    "thinking": "Processando sua solicitação...",
    "code_download": "📥 Baixar Código",
    "generated_image": "Imagem gerada",
    "error_parsing_table": "Erro ao analisar a tabela"
  },
  "gamification_controller": {
    "confirm_deactivation_title": "Confirmar Desativação",
    "confirm_deactivation_warning": "Tem certeza de que deseja desativar o Modo Jogo?",
    "confirm_deactivation_text": "Você deixará de ver os minijogos interativos e perderá seu progresso atual.",
    "confirm_button": "Confirmar",
    "cancel_button": "Cancelar",
    "game_mode_label": "**Modo Jogo**",
    "toggle_help": "Ativa/desativa os minijogos interativos.",
    "progress_header": "🏆 Seu Progresso",
    "reset_progress_button": "Reiniciar Progresso",
    "points_metric_label": "Pontos",
    "games_metric_label": "Jogos",
    "history_expander_label": "Ver Histórico de Partidas",
    "history_empty": "Você ainda não jogou. Vamos lá!",
    "history_item_text": "{icon} **{game_title}**: *+{points_earned} pts*",
    "round": "Rodada",
    "detailed_analysis_revealed": "Análise Detalhada:",
    "feedback_victory": "Vitória! Você superou o desafio com **{total_score}** pontos.",
    "feedback_defeat": "Quase! Você conseguiu **{total_score}** pontos. Tente novamente!",
    "feedback_game_over_text": "Você obteve um total de **{total_score}** pontos.",
    "see_round_summary": "Ver resumo detalhado das rodadas",
    "submit_button_label": "Verificar!",
    "please_pick_an_action": "Por favor, realize uma ação antes de verificar.",
    "SimpleQuestionMinigame": {
      "minigame_prefix": "Minijogo:",
      "choose_your_answer": "Escolha sua resposta:"
    },
    "DataDuelMinigame": {
      "data_duel_title": "Duelo de Dados",
      "duel_question": "Qual tem o valor maior?"
    },
    "ClassifierMinigame": {
      "classifier_title": "O Classificador",
      "classifier_drag_info": "💡 Arraste os itens para ordená-los do maior para o menor."
    },
    "OracleMinigame": {
      "oracle_title": "O Oráculo",
      "oracle_question": "Observe a evolução e preveja a tendência."
    },
    "EstimatorMinigame": {
      "estimator_title": "O Estimador",
      "estimator_instructions": "Use o controle deslizante para estimar o valor. Quanto mais perto, mais pontos!",
      "estimator_question": "Qual é o valor para **{item_name}**?",
      "_your_estimation": "Sua estimativa",
      "estimator_result_shower": "**Resultado para '{item_name}' (Rodada {round_num})**",
      "_real_value": "Valor Real",
      "estimator_claim_victory": "Excelente estimativa! Você conseguiu **{score}** pontos.",
      "estimator_good_try": "Boa tentativa! Você conseguiu **{score}** pontos."
    },
    "GeoGuesserMinigame": {
      "geoguesser_title": "GeoGuesser",
      "geoguesser_instructions": "Selecione a província correta para a seguinte instituição.",
      "_where_is_it": "Onde se localiza?"
    },
    "ImpostorMinigame": {
      "impostor_title": "Encontre o Impostor",
      "impostor_instructions": "Três destes itens pertencem ao mesmo grupo. Qual é o impostor?"
    }
  },
  "introduction_header": "🎯 Bem-vindo ao Coração do Ensino Superior Cubano",
  "introduction_markdown_1": "Uma universidade não é apenas um edifício; é um cadinho de sonhos, um motor de progresso e um reflexo das aspirações de uma sociedade. Neste espaço, embarcaremos em uma jornada analítica, explorando as correntes que moldam a matrícula universitária em Cuba.\n\nDas tendências gerais aos detalhes de cada curso e universidade, desvendaremos as histórias ocultas por trás das diferentes universidades do país. O objetivo? Fornecer uma bússola baseada em evidências para a tomada de decisões estratégicas, fomentando um sistema de ensino superior mais forte, equitativo e alinhado com o futuro da nação.",
  "intro_choose_your_path_header": "🛣️ Escolha o Seu Caminho: Como Você Quer Explorar?",
  "intro_choose_your_path_text": "Esta jornada através dos dados pode seguir dois caminhos. Escolha o que melhor se adapta ao seu estilo.",
  "intro_analyst_path_title": "👨‍🏫 A Rota do Analista",
  "intro_analyst_path_desc": "Ideal se você busca ir direto ao ponto. Acesse todos os gráficos e análises diretamente, sem interrupções. Perfeito para uma exploração rápida e focada.",
  "intro_analyst_path_button": "Ativar Modo Análise",
  "intro_explorer_path_title": "🎮 A Trilha do Explorador",
  "intro_explorer_path_desc": "Transforme a análise em um desafio. Em cada seção, você enfrentará minijogos para testar sua intuição sobre os dados antes de vê-los. Ganhe pontos e compita!",
  "intro_explorer_path_button": "Ativar Modo Jogo",
  "intro_game_mode_active_info": "🕹️ **Modo Jogo Ativado!** Prepare-se para os desafios. Você pode ver seu progresso pressionando o botão '🏆' que aparece no canto inferior direito.",
  "intro_analysis_mode_active_info": "📊 **Modo Análise Ativado.** Você está pronto para uma exploração direta dos dados. Você pode trocar de modo a qualquer momento na barra lateral.",
  "introduction_sucess": "Sua jornada começa aqui! Selecione uma seção no menu lateral ou use o botão 'Próximo'.",
  "A1_header": "🌍 O Pulso Nacional: Como Bate a Matrícula Universitária?",
  "A1_markdown_1": "Imagine que podemos aferir o pulso de todo o sistema universitário cubano ao longo de uma década. Como tem sido seu ritmo? Experimentou momentos de crescimento vigoroso, períodos de estabilidade, ou talvez fases onde a batida se tornou mais lenta?\n\nEsta primeira seção nos oferece uma visão panorâmica da matrícula total em nível nacional, permitindo-nos identificar as grandes tendências que marcaram o sistema de ensino superior nos últimos anos. É nosso ponto de partida para entender o contexto geral antes de mergulharmos em análises mais específicas.",
  "A1_spinner_1": "Construindo o gráfico A1, por favor aguarde...",
  "A1_chart_title_historical": "Matrícula Nacional: Evolução Histórica",
  "A1_fig_1_subheader": "Decifrando o Ritmo da Década (2015-2025):",
  "A1_fig_1_markdown_1": "Observando a trajetória da matrícula nacional total no gráfico superior, podemos identificar várias fases-chave:\n\n*   **Impulso Inicial (2015-16 a 2016-17):** A jornada começa no ano letivo 2015-2016 com um número em torno de **165.000 estudantes**. O ano seguinte mostra um ligeiro aumento, estabelecendo uma base sólida para o crescimento que virá.\n\n*   **Crescimento Sustentado até o Pico (2017-18 a 2020-21):** A partir do ano letivo 2017-18, e apesar da falta de dados para 2018-19, a tendência ascendente é retomada com força até atingir seu **ponto mais alto no ano letivo 2020-2021, superando os 285.000 estudantes**. Este período representa a fase de maior expansão da matrícula na década.\n\n*   **Platô e Início do Declínio (2021-22 a 2022-23):** O ano letivo 2021-2022 mostra uma ligeira contração em relação ao pico, marcando o início de uma nova fase. A matrícula se mantém alta, mas já не cresce, e em 2022-23, o declínio se torna mais evidente.\n\n*   **Ajuste Recente (2023-24 a 2024-25):** Os dois últimos anos letivos registrados mostram uma **continuação da tendência de queda**, com a matrícula total situando-se em torno de **205.000 estudantes** no período mais recente. Isso sugere um reajuste do sistema após o pico de expansão.",
  "A1_ai_context": "A análise atual é sobre a evolução da matrícula nacional total, masculina e feminina, em Cuba de 2015 a 2025. Os dados, apresentados no gráfico, mostram um pico significativo em torno de 2020-2021, seguido de um declínio.",
  "A1_peak_enrollment_label": "Matrícula Nacional no Ano de Pico ({curso})",
  "A1_game_subheader": "À Prova: A Magnitude do Pico",
  "A1_game_intro": "O sistema universitário cubano atingiu um número máximo de estudantes em um ponto da última década. Antes de ver o gráfico, quão boa é a sua intuição? Tente estimar qual foi esse número máximo.",
  "A1_game_title": "O Estimador do Pico Nacional",
  "A1_estimator_question": "Quantos estudantes você acha que havia em todo o país durante o ano letivo de maior matrícula ({curso})?",
  "A2_header": "📚 Um Mosaico de Saberes: Para Onde se Inclinam os Futuros Profissionais?",
  "A2_markdown_1": "A universidade é um vasto jardim onde florescem diversas disciplinas. Cada ramo do conhecimento, das Ciências Médicas ou Matemática às Artes, representa um caminho único de formação e contribuição para a sociedade. Nesta seção, detalhamos a matrícula total para ver como os estudantes se distribuem entre estas grandes áreas, com o objetivo de responder a perguntas como:\n- Existem protagonistas claros?\n- Como o interesse estudantil dançou ao longo da última década?",
  "A2_fig_a2_abs_subheader": "A Força de Cada Ramo: Evolução Histórica da Matrícula",
  "A2_spinner_1": "Analisando a evolução dos ramos da ciência...",
  "A2_chart_title_evolution": "Evolução Histórica por Ramo",
  "A2_yaxis_title_enrollment_branch": "Matrícula no Ramo da Ciência",
  "A2_legend_title_branch": "Ramo da Ciência",
  "A2_fig_a2_abs_markdown_1": "**Cada Linha, uma Corrente do Conhecimento:**\nEste gráfico traça a jornada da matrícula absoluta (número total de estudantes) para cada ramo da ciência ao longo dos anos.\n\n*   **Liderança Destacada:** As **Ciências Médicas** (linha verde-água) se erguem como o ramo com a matrícula mais numerosa de forma consistente durante todo o período, partindo de cerca de 70.000 estudantes em 2015-16, atingindo um pico impressionante de quase **95.000 estudantes em 2020-2021**, e, embora experimentem um declínio posterior, mantêm-se como a principal força, fechando em 2024-2025 com mais de 70.000 estudantes.\n\n*   **Perseguição e Dinamismo:** As **Ciências Pedagógicas** (linha laranja) mostram uma trajetória muito dinâmica. Começam com uma matrícula significativa (cerca de 30.000), experimentam um crescimento notável até superar os **65.000 estudantes em 2020-2021 e 2021-2022**, tornando-se o segundo maior ramo durante esses anos. No entanto, sofrem um declínio acentuado nos últimos anos, finalizando perto dos 40.000 estudantes.\n\n*   **Bloco Intermediário Consistente:** Um grupo de ramos mantém uma presença estável, embora com flutuações:\n    *   As **Ciências Técnicas** (linha rosa) e as **Ciências Sociais e Humanísticas** (linha azul-celeste) mostram trajetórias paralelas, crescendo de aproximadamente 20.000 estudantes para um pico em torno de **30.000-32.000** entre 2020-21 e 2021-22, para depois diminuir e se situar em torno de 23.000-25.000 estudantes no final do período.\n    *   As **Ciências Econômicas** (linha vermelha) apresentam um crescimento mais moderado, mas constante até 2021-22 (atingindo cerca de 24.000 estudantes), seguido de um declínio semelhante a outros ramos, terminando perto de 15.000.\n    *   As **Ciências Agropecuárias** (linha azul-escuro) e as **Ciências da Cultura Física e do Desporto** (linha verde-escuro/marrom) mantêm-se em uma faixa mais baixa, geralmente entre 5.000 e 15.000 estudantes, com picos por volta de 2020-2021 e declínios posteriores.\n\n*   **Nicho Especializado:** As **Ciências Naturais e Matemática** (linha roxa) e as **Ciências das Artes** (linha violeta) representam os ramos com menor volume de matrícula, mantendo-se consistentemente abaixo de 5.000 estudantes ao longo de toda a década. Isso sugere alta especialização ou uma demanda mais limitada.",
  "A2_fig_a2_pct_subheader": "A Divisão do Bolo Acadêmico: Distribuição Percentual Histórica",
  "A2_chart_title_distribution": "Distribuição Percentual Histórica da Matrícula por Ramo da Ciência",
  "A2_yaxis_label_percentage": "% Matrícula",
  "A2_fig_a2_pct_markdown_1": "**Proporções na Tela Universitária:**\nEste gráfico de área empilhada nos mostra que \"fatia do bolo\" cada ramo da ciência representou dentro do total da matrícula universitária em cada ano letivo.\n\n*   **Domínio Persistente das Ciências Médicas:** A larga faixa verde-água na parte superior confirma que as Ciências Médicas representaram consistentemente a maior proporção de estudantes, ocupando cerca de **40-50% do total** em seu ponto mais alto (por volta de 2016-17 e novamente em 2024-2025, após uma ligeira redução percentual no meio do período).\n\n*   **Ascensão e Declínio das Ciências Pedagógicas:** A faixa laranja das Ciências Pedagógicas mostra uma interessante mudança em seu peso relativo. Começa sendo uma porção importante, expande-se significativamente para representar a segunda maior proporção (chegando a quase **25-30%** do total por volta de 2019-2021), mas depois reduz sua participação percentual nos últimos anos.\n\n*   **Estabilidade Relativa no Meio:** As Ciências Técnicas (faixa marrom/ocre), Sociais e Humanísticas (faixa azul-celeste) e Econômicas (faixa azul-escuro) mantêm proporções mais estáveis ao longo do tempo, embora com ligeiras variações. Juntas, costumam formar uma porção significativa do corpo discente. Por exemplo, as Ciências Sociais e Humanísticas parecem ocupar consistentemente cerca de 10-15%.\n\n*   **Menor Peso Percentual:** Os demais ramos (Agropecuárias, Cultura Física, Naturais e Matemática, Artes) representam individualmente porcentagens menores da matrícula total, o que é consistente com seu menor volume absoluto de estudantes.\n\nEsta análise percentual é crucial porque nos permite entender não apenas quantos estudantes há em cada ramo, mas também como o interesse ou a capacidade de admissão é distribuída em relação ao conjunto do sistema universitário.",
  "A2_subhead_popularity": "Ranking de Popularidade: que áreas do saber lideram?",
  "A2_intro_game1": "Antes de mergulharmos nos gráficos, vamos testar sua percepção. Em Cuba, milhares de estudantes escolhem seu caminho profissional a cada ano. Quais ramos do conhecimento você acha que atraem o maior número de universitários? Você poderia ordenar as principais áreas de acordo com sua popularidade?",
  "A2_game_title": "O Classificador do Saber",
  "A2_subheader_2": "🔗 Interconexões no Crescimento: Como os Ramos se Relacionam?",
  "A2_markdown_2": "Nem todos os ramos da ciência crescem ou diminuem de forma isolada. Alguns podem mostrar tendências de matrícula semelhantes ao longo do tempo, enquanto outros podem ter dinâmicas mais independentes. O mapa de calor (heatmap) a seguir visualiza a **correlação da variação percentual anual da matrícula** entre os diferentes ramos da ciência.\n\n*   Um **valor próximo a 1 (azul escuro/roxo intenso)** indica uma forte correlação positiva: quando um ramo cresce, o outro tende a crescer também no mesmo período.\n*   Um **valor próximo a -1 (não visível neste exemplo, seria o outro extremo da escala de cores)** indicaria uma forte correlação negativa: quando um cresce, o outro tende a diminuir.\n*   Um **valor próximo a 0 (cores mais claras/neutras)** sugere pouca ou nenhuma relação linear em seus padrões de crescimento anual.",
  "A2_corr_title": "Matriz de Correlação do Crescimento Anual entre os Ramos da Ciência",
  "A2_corr_legend": "Coef. de Correlação",
  "A2_fig_corr_expander": "🔍 Análise Detalhada das Correlações Observadas",
  "A2_fig_corr_markdown_1": "**Observações-Chave do Mapa de Correlação:**\n\n*   **Sincronização Forte:** Observa-se uma **alta correlação positiva (valores > 0.9)** nas tendências de crescimento anual entre:\n    *   **Ciências Agropecuárias e Ciências Econômicas** (aprox. 0.98)\n    *   **Ciências Agropecuárias e Ciências Pedagógicas** (aprox. 0.98)\n    *   **Ciências Agropecuárias e Ciências da Cultura Física e do Desporto** (aprox. 0.96)\n    *   Assim como entre **Ciências Econômicas, Pedagógicas e da Cultura Física**, todas mostrando coeficientes muito elevados entre si.\n    Isso sugere que esses ramos frequentemente experimentam impulsos de crescimento (ou contração) de forma muito semelhante e simultânea, possivelmente devido a fatores macroeconômicos, políticas educacionais abrangentes ou ciclos de demanda estudantil que os afetam conjuntamente.\n\n*   **Correlações Positivas Moderadas:**\n    *   As **Ciências Médicas** mostram uma correlação positiva moderada (geralmente entre 0.5 e 0.7) com vários outros ramos, como Econômicas, Sociais e Humanísticas, e Técnicas. Isso pode indicar que o setor médico, embora tenha suas próprias dinâmicas, também se beneficia ou participa de tendências expansionistas mais amplas no ensino superior.\n    *   As **Ciências Técnicas** também se correlacionam moderadamente com a maioria dos outros ramos, sugerindo uma conexão com o ciclo geral do sistema.\n\n*   **Independência Relativa Notória:**\n    *   As **Ciências Naturais e Matemática** destacam-se por terem as **correlações mais baixas** com quase todos os outros ramos (coeficientes frequentemente entre 0.2 e 0.4). Isso indica que seu padrão de crescimento de matrícula parece ser bastante independente das flutuações que afetam outras grandes áreas do conhecimento. Este ramo pode ser influenciado por fatores muito específicos, como programas de fomento científico particulares ou uma demanda mais especializada e menos sensível às tendências gerais.\n    *   As **Ciências das Artes** também mostram correlações mais fracas com alguns dos maiores ramos, como as Ciências Pedagógicas, embora tenha uma interessante correlação moderada com as Ciências Médicas.\n\n*   **Implicações Estratégicas:**\n    *   A forte sincronização entre certos ramos sugere que as estratégias de planejamento e alocação de recursos poderiam considerar esses \"clusters\" de comportamento.\n    *   A independência das Ciências Naturais e Matemática pode exigir uma abordagem e monitoramento diferenciados para garantir sua vitalidade e alinhamento com as necessidades de desenvolvimento científico-técnico do país.\n    *   A ausência de correlações fortemente negativas (neste gráfico) sugere que, no nível agregado de variação anual, não há uma \"canibalização\" evidente onde o crescimento de um ramo seja diretamente às custas de outro, embora não se descartem dinâmicas competitivas em níveis mais específicos.",
  "A2_corr_warn_1": "Não foi possível gerar o mapa de correlação entre os ramos.",
  "A2_subhead_correlation": "Sinergias ocultas: que ramos crescem juntos?",
  "A2_intro_game2": "Os ramos do saber não são ilhas. Suas tendências de crescimento estão frequentemente conectadas. Alguns se movem em perfeita sincronia, enquanto outros dançam ao seu próprio ritmo. Quando o interesse pelas Ciências Pedagógicas cresce, qual outra área você acha que se beneficia de um impulso semelhante? Aceite o duelo e descubra!",
  "A2_game_title_corr": "Duelo de Sinergias",
  "A2_duel_question_corr": "O crescimento das **Ciências Pedagógicas** é MAIS semelhante ao de:",
  "A3_header": "🔍 Cursos sob a Lupa: Popularidade, Tendências e Dinamismo",
  "A3_markdown_1": "Após explorar os grandes ramos do saber, é hora de focar nossa lente nas unidades fundamentais: os cursos universitários. Quais são os que capturam o maior interesse estudantil? Como tem sido sua evolução individual? E, muito importante, quais mostram um crescimento acelerado e quais parecem estar perdendo impulso?",
  "A3_subheader_2": "🏆 O Pódio dos Cursos: Quais Lideram a Matrícula Atual?",
  "A3_spinner_1": "Analisando o ranking e a evolução dos cursos principais...",
  "A3_warning_analysis_failed": "Não foi possível realizar a análise de popularidade dos cursos. Estado: {status}",
  "A3_markdown_2": "À esquerda, vemos o ranking de todos os cursos de acordo com sua matrícula total no ano letivo mais recente ({year_range}). À direita, vemos a evolução histórica da matrícula para os {top_n} cursos que atualmente estão no topo deste ranking.",
  "A3_chart_title_evolution": "Evolução Histórica (Top {n} Cursos Atuais)",
  "A3_chart_yaxis_enrollment": "Matrícula Total no Curso",
  "A3_col_evo_top_info": "Não foi gerado gráfico de evolução para os cursos atualmente no topo.",
  "A3_markdown_3": "**Pontos-Chave do Pódio:**\n*   **Liderança Indiscutível:** **Medicina** posiciona-se firmemente como o curso com a maior matrícula (35.889 estudantes), uma constante que já havíamos vislumbrado ao analisar os ramos do saber.\n*   **Forças Significativas:** Seguem-se **Cultura Física** (14.695) e **Educação Primária** (12.867), demonstrando uma demanda considerável nestas áreas.\n*   **Top 5 Robusto:** **Enfermagem** (9.999) e **Contabilidade e Finanças** (9.883) completam o top 5, ambos com uma matrícula muito próxima dos 10.000 estudantes.\n*   **Evolução dos Líderes:** O gráfico à direita permite-nos ver como estes cursos (e outros do top 10) chegaram à sua posição atual. Observe como alguns tiveram um crescimento mais sustentado, enquanto outros mostram picos e vales mais pronunciados.",
  "A3_game1_subheader": "À Prova: O Ranking de Popularidade",
  "A3_game1_intro": "Antes de ver o ranking completo, quão boa é a sua intuição sobre a demanda estudantil? Apresentamos-lhe uma seleção de cursos. Ordene-os do mais popular ao menos popular de acordo com a matrícula do último ano!",
  "A3_game1_title": "O Classificador de Cursos",
  "A3_subheader_4": "🚀 O Ritmo da Mudança: Que Cursos Decolam ou Aterram?",
  "A3_markdown_4": "A **Taxa de Crescimento Anual Composta (CAGR)** nos oferece uma perspectiva do dinamismo. Calcula o crescimento (ou decrescimento) percentual médio anual da matrícula de um curso, considerando todo o período analisado. Um CAGR alto sugere uma expansão rápida.",
  "A3_spinner_4": "Calculando o dinamismo dos cursos (CAGR)...",
  "A3_warning_cagr_failed": "Não foi possível realizar a análise de crescimento (CAGR). Estado: {status}",
  "A3_chart_title_cagr_top": "Top 15 por Maior Crescimento Médio Anual {periodo}",
  "A3_chart_title_cagr_bottom": "Top 15 por Maior Decrescimento Médio Anual {periodo}",
  "A3_cagr_top_title": "📈 Top 15 com Maior Crescimento",
  "A3_col_cagr_top_markdown_2": "Estes cursos experimentaram a expansão mais notável em sua matrícula média anual.\n*   **Decolagem Surpreendente:** **Serviços Odontológicos** lidera com um CAGR superior a 100%, o que indica uma duplicação (ou mais) de sua matrícula média ano após ano.\n*   **Engenharias em Ascensão:** Várias engenharias como **Artística**, **Processos Agroindustriais** e **Informática** mostram um crescimento muito saudável.\n*   **Educação com Impulso:** Ramos da educação como **Pré-escolar**, **Agropecuária** e **Primária** também figuram com um CAGR positivo e significativo.",
  "A3_cagr_bottom_title": "📉 Top 15 com Maior Decrescimento",
  "A3_col_cagr_bottom_markdown_2": "No outro extremo, estes cursos viram sua matrícula média anual diminuir ou crescer a um ritmo muito menor.\n*   **Ajustes Notáveis:** **Estudos Socioculturais** e **Estomatologia** (não confundir com Serviços Odontológicos) apresentam os maiores decrescimentos médios.\n*   **Desafios Diversos:** Cursos como **Engenharia Agrícola**, **Artes Visuais**, **Matemática**, **Música** e várias **Engenharias** (Hidráulica, Civil, Telecomunicações, Industrial) também aparecem nesta lista, sugerindo uma revisão de suas tendências.",
  "A3_markdown_5": "**Reflexões Estratégicas a partir destes Ritmos:**\n*   Um **CAGR alto** nem sempre significa uma matrícula total massiva (poderia ser um curso pequeno crescendo rápido), mas indica uma **forte tendência positiva** que merece atenção, seja para fomentar ou para garantir recursos.\n*   Um **CAGR baixo ou negativo** em cursos importantes poderia ser um sinal para investigar as causas: mudanças no mercado de trabalho, preferências estudantis, oferta acadêmica?\n*   É crucial cruzar esta informação do CAGR com a matrícula absoluta (do ranking) para obter uma imagem completa.",
  "A3_game2_subheader": "Duelo do Crescimento",
  "A3_game2_intro": "Alguns cursos crescem a um ritmo vertiginoso enquanto outros se contraem. Consegue identificar qual das duas opções teve uma maior taxa de crescimento médio anual? Aceite o duelo!",
  "A3_game2_title": "Duelo do Crescimento",
  "A3_duel_question": "Este curso teve um crescimento médio **MAIOR** que o outro.",
  "A4_header": "♀️♂️ Equilibrando a Balança: Um Olhar sobre a Perspectiva de Gênero",
  "A4_markdown_1": "A universidade não apenas forma profissionais, mas também molda uma sociedade mais justa e equitativa. Nesta seção, adentramos na composição de gênero da matrícula universitária. Existe um equilíbrio entre homens e mulheres nas salas de aula? Existem áreas do conhecimento tradicionalmente associadas a um gênero que mantêm esses padrões, ou estamos testemunhando uma transformação em direção a uma maior paridade? Acompanhe-nos para descobrir.",
  "A4_spinner_1": "Analisando a perspectiva de gênero...",
  "A4_warning_analysis_failed": "Não foi possível realizar a análise de gênero. Estado: {status}",
  "A4_fig_ramas_subheader": "Participação Feminina por Ramo da Ciência ({curso})",
  "A4_chart_title_branches": "Percentagem de Mulheres por Ramo da Ciência ({curso})",
  "A4_chart_yaxis_women_pct": "% Mulheres",
  "A4_fig_ramas_markdown_1": "**O Panorama Geral por Área do Saber:**\nEste gráfico de barras nos mostra a percentagem de mulheres matriculadas em cada grande ramo da ciência. A linha vermelha pontilhada em 50% representa a paridade perfeita.\n\n*   **Liderança Feminina Pronunciada:** As **Ciências Pedagógicas** destacam-se com mais de **80%** de matrícula feminina, seguidas de perto pelas **Ciências Sociais e Humanísticas** e pelas **Ciências Médicas**, ambas superando os **70%**. Isso indica uma forte presença e preferência feminina nestas importantes áreas.\n*   **Maioria Feminina Sustentada:** As **Ciências Econômicas**, **Ciências das Artes** e **Ciências Naturais e Matemática** também mostram uma maioria de mulheres, com percentagens que variam entre **55% e 65%**, situando-se acima da linha de paridade.\n*   **Perto da Paridade ou Ligeira Maioria Masculina:** As **Ciências Agropecuárias** encontram-se mais perto do equilíbrio, embora ainda com uma ligeira maioria feminina (quase 50%).\n*   **Desafios em Áreas Técnicas e Desportivas:** Em contraste, as **Ciências Técnicas** (aproximadamente 35% de mulheres) e, de forma mais acentuada, as **Ciências da Cultura Física e do Desporto** (cerca de 32% de mulheres) são os ramos com a menor representação feminina, indicando uma persistente lacuna de gênero nestes campos.",
  "A4_info_no_branch_data": "Não há dados de gênero por ramos para mostrar.",
  "A4_fig_carreras_subheader": "Zoom nos Cursos: Extremos do Espectro de Gênero ({curso}, Matrícula >= 30)",
  "A4_legend_major_women": "Maioria Mulheres",
  "A4_legend_minor_women": "Minoria Mulheres",
  "A4_chart_title_careers_gender": "Desequilíbrio de Gênero nos Cursos ({curso}, Matrícula >= 30)",
  "A4_subplot_title_top_women": "Top 10 Cursos com Maior % de Mulheres",
  "A4_subplot_title_low_women": "Top 10 Cursos com Menor % de Mulheres",
  "A4_fig_carreras_markdown_1": "**Casos Destacados de Maioria e Minoria Feminina:**\nEstes gráficos nos levam ao detalhe dos cursos, mostrando os 10 com maior percentagem de mulheres e os 10 com menor percentagem (ou seja, maior presença masculina), desde que tenham uma matrícula de pelo menos 30 estudantes para garantir a representatividade.\n\n*   **Feminização Extrema em Algumas Áreas:** Cursos como **Educação Pré-escolar** aproximam-se dos 100% de matrícula feminina. Outros, como **Técnico Superior em Fonoaudiologia**, **Educação em Logopedia** e **Educação Espanhol-Literatura**, também mostram uma esmagadora maioria de mulheres, superando os 90%. Isso é consistente com a alta feminização das Ciências Pedagógicas. **Serviços Odontológicos** e **Estudos Socioculturais** também se destacam neste grupo.\n\n*   **Domínio Masculino em Engenharias e Áreas Técnicas:** No outro extremo, cursos como **Engenharia Informática**, **Engenharia em Automação**, **Ciências da Computação**, **Gestão do Processo de Investimento** e várias **Engenharias Mecânica, Elétrica e em Técnicos Superiores em Treinamento Desportivo** apresentam percentagens de mulheres muito baixas, algumas abaixo de 10% e a maioria abaixo de 25%. Isso reflete a lacuna observada nas Ciências Técnicas e desportivas a nível de ramo.\n\n*   **Nuances Importantes:** É crucial observar que mesmo dentro do \"Top 10 com Menor % de Mulheres\", as percentagens variam. Enquanto algumas engenharias mal superam 5-10% de presença feminina, outras podem estar mais perto de 20-25%.",
  "A4_info_no_career_data": "Não há dados de cursos suficientes para mostrar a análise de extremos de gênero.",
  "A4_markdown_2": "---\n**Reflexões para a Ação:**\n*   A alta feminização em certos ramos e cursos é um fenômeno consolidado. Embora reflita vocações, também é importante garantir que não existam barreiras implícitas ou desincentivos à participação masculina neles.\n*   O maior desafio para a equidade de gênero encontra-se claramente nas **Ciências Técnicas** e em várias engenharias específicas, bem como nas **Ciências da Cultura Física e do Desporto**. São necessárias estratégias contínuas e eficazes para atrair e reter mais mulheres nestes campos cruciais para o desenvolvimento tecnológico e social.\n*   Estes dados são um convite a aprofundar: Quais são as causas destes desequilíbrios? Como podemos inspirar as novas gerações a explorar todas as áreas do conhecimento sem vieses de gênero?",
  "A4_game1_subheader": "Duelo de Gênero por Ramo",
  "A4_game1_intro": "Algumas áreas do conhecimento atraem mais mulheres do que outras. Saberia dizer em qual dos seguintes ramos há uma maior percentagem de matrícula feminina?",
  "A4_game1_title": "Duelo de Ramos",
  "A4_duel_question": "Qual ramo tem uma percentagem MAIS ALTA de mulheres?",
  "A4_game2_subheader": "Espere! Há um impostor entre os cursos!",
  "A4_game2_intro": "Três dos seguintes cursos têm uma esmagadora maioria de mulheres em suas salas de aula. Um deles, no entanto, é um campo predominantemente masculino. Identifique o impostor!",
  "A4_game2_title": "O Impostor de Gênero",
  "A5_header": "🏛️ Universidades em Perspectiva: Descobrindo Forças e Focos de Especialização",
  "A5_markdown_1": "Cada universidade é um ecossistema único com sua própria história, vocação e áreas de excelência. Nesta seção, mudamos nossa perspectiva para analisar como o talento estudantil se distribui em nível institucional. Quais universidades concentram o maior número de estudantes? Existem centros altamente especializados em certos ramos ou cursos? E quais cursos são joias raras, oferecidos por apenas algumas instituições?",
  "A5_spinner_1": "Analisando a distribuição institucional da matrícula...",
  "A5_warning_analysis_failed": "Não foi possível realizar a análise institucional. Estado: {status}",
  "A5_fig_treemap_subheader": "Mapa Interativo da Matrícula Universitária ({curso})",
  "A5_treemap_root_label": "Todas as Universidades",
  "A5_treemap_title": "Distribuição de Matrícula ({curso})",
  "A5_fig_treemap_markdown_1": "**Navegando o Universo Institucional:**\nEste \"mapa de árvore\" (treemap) é uma representação visual da matrícula total.\n*   **O Tamanho Importa:** A área de cada retângulo é proporcional ao número de estudantes. Começa com \"Todas as Universidades\"; clique em uma universidade (ex. `UCLV`, `UH`, `CUJAE`) para ver como sua matrícula se decompõe por ramos da ciência. Um novo clique em um ramo mostrará os cursos dentro dele e seu peso naquela instituição.\n*   **Identifique os Gigantes:** À primeira vista, você pode identificar as universidades com maior volume de estudantes. Por exemplo, a **UO (Universidade de Oriente)**, **UH (Universidade de Havana)** e **UCMLH (Universidade de Ciências Médicas de Havana)**, entre outras, mostram retângulos consideravelmente grandes, indicando uma matrícula importante.\n*   **Focos de Especialização:** Observe como algumas universidades têm quase toda a sua \"área\" concentrada em um ou dois ramos (ex. as Universidades de Ciências Médicas predominantemente em \"Ciências Médicas\"), enquanto outras mostram uma maior diversificação. Como se observa, as Ciências Médicas se destacam em todas as universidades que a oferecem.",
  "A5_info_no_treemap_data": "Não há dados disponíveis para gerar o mapa interativo.",
  "A5_df_carreras_unicas_subheader": "Joias Acadêmicas: Cursos por Nível de Exclusividade",
  "A5_df_carreras_unicas_markdown_new": "Este gráfico agrupa os cursos de acordo com o número de universidades que os oferecem no ano letivo {curso}. Cada ponto representa um curso. Passe o mouse sobre um ponto para ver seu nome. As anotações na parte superior indicam quantos cursos existem em cada grupo de exclusividade.",
  "A5_chart_title_grouped_offer": "Distribuição de Cursos por Exclusividade de Oferta",
  "A5_chart_yaxis_num_unis": "Nº de Universidades que Oferecem",
  "_carrers": "cursos",
  "A5_expander_show_all_data": "Ver a tabela completa com todos os cursos",
  "A5_info_no_limited_offer_data": "Não foram encontrados dados sobre cursos com oferta limitada.",
  "A5_game1_subheader": "GeoGuesser Universitário",
  "A5_game1_intro": "Antes de analisar as universidades em detalhe, você conhece a localização delas? Demonstre!",
  "A5_game1_title": "Adivinhe a Província",
  "A5_game2_subheader": "Adivinhe a Exclusividade",
  "A5_game2_intro": "Alguns cursos são ministrados em todo o país, enquanto outros são verdadeiras raridades. Quão exclusivo você acha que é o seguinte curso?",
  "A5_game2_title": "O Estimador de Exclusividade",
  "A5_subheader_2": "Lupa em Cursos-Chave: Quem é Quem na Formação Específica?",
  "A5_markdown_2": "Selecione até 3 cursos de seu interesse. O gráfico mostrará a evolução histórica da matrícula para esses cursos, detalhada por cada universidade que os oferece. Isso nos permite comparar o peso e a trajetória de diferentes instituições na formação de profissionais em campos específicos.\n\n*Se o gráfico parecer muito denso, tente selecionar menos cursos ou concentre-se nas tendências gerais das maiores universidades para cada curso.*",
  "A5_multiselect_carreras": "Cursos para comparar evoluções por universidade:",
  "A5_spinner_2": "Gerando gráfico comparativo por universidade...",
  "A5_chart_title_uni_comparison": "Evolução por Universidade para: {careers}",
  "A5_chart_yaxis_enrollment": "Matrícula Total",
  "A5_warning_comparison_failed": "Não foi possível gerar o gráfico comparativo. Causa: {status}",
  "A5_no_carreras_selected": "Por favor, escolha pelo menos um curso para ver a comparação.",
  "A5_markdown_3": "---\n**Visões Estratégicas para a Rede de Universidades:**\n*   **Potencializar a Excelência:** Identificar universidades líderes em cursos-chave pode guiar o investimento para transformá-las em centros de referência nacional ou internacional.\n*   **Otimizar Recursos:** O treemap e a análise de ofertas únicas podem revelar duplicações desnecessárias ou, pelo contrário, a necessidade de expandir a oferta de certos cursos em mais regiões.\n*   **Colaboração Interinstitucional:** Conhecer os pontos fortes de cada uma pode fomentar sinergias, programas conjuntos e mobilidade estudantil e de professores.",
  "A6_header_1": "🔭 Olhando para o Amanhã: O que Podemos Esperar? (Projeções Futuras)",
  "A6_markdown_1": "Antecipar o futuro é um desafio, mas analisar as tendências recentes nos permite traçar cenários possíveis. Nesta seção, voltaremos a examinar nossos indicadores-chave de matrícula, mas desta vez estendendo nosso olhar dois anos letivos para frente por meio de projeções.\n\n⚠️ **Uma Bússola, não um Oráculo:** É fundamental lembrar que estas são **projeções**, não previsões infalíveis. Baseiam-se em modelos simples de **Regressão Linear aplicados aos últimos 6 anos de dados históricos** (ou menos, se os dados forem insuficientes para um ramo ou curso específico). Múltiplos fatores não contemplados nestes modelos (mudanças de políticas, crises econômicas, novas demandas sociais, etc.) poderiam alterar significativamente estas trajetórias. Usemos-as como uma ferramenta para a reflexão estratégica e o planejamento proativo, não como um destino escrito em pedra.",
  "A6_chart_title_projection": "Evolução e Projeção (Reg. Lin. últimos {n_years} anos)",
  "A6_chart_title_branches_projection": "Evolução e Projeção por Ramo (Reg. Lin. últimos {n_years} anos ou menos)",
  "A6_subheader_1": "Horizonte Nacional: Projeção da Matrícula Total",
  "A6_spinner_1": "Calculando a projeção da matrícula nacional...",
  "A6_info_1": "As linhas pontilhadas e os pontos em forma de diamante além do ano letivo 2024-2025 representam as projeções.",
  "A6_markdown_national_explanation": "**Interpretando a Tendência Nacional Projetada:**\n\nO gráfico superior combina a evolução histórica da matrícula (barras e linha contínua até o ano letivo 2024-25) com uma projeção para os dois anos letivos seguintes (linha pontilhada com diamantes).\n\n*   **Ponto de Partida:** A projeção começa a partir do último dado histórico registrado, que mostra uma matrícula nacional de aproximadamente **205.000 estudantes**.\n*   **Trajetória Projetada:** O modelo de regressão linear, baseado na tendência dos últimos anos, sugere uma **continuação da fase de ajuste ou declínio moderado** que se observa no período mais recente.\n*   **Estimativas Futuras:**\n    *   Para o ano letivo de **2025-2026**, o modelo estima uma matrícula que poderia se situar na faixa de **195.000 a 215.000 estudantes**.\n    *   Até **2026-2027**, este número poderia cair para cerca de **185.000 a 190.000 estudantes**.\n*   **Implicação Estratégica:** Se esta tendência se materializar, levanta questões importantes para o planejamento: Como isso afetaria a capacidade instalada nas universidades? Exigiria uma reavaliação da alocação de recursos ou novas estratégias de captação e retenção de estudantes em nível nacional?",
  "A6_warning_national_proj_failed": "Não foi possível gerar a projeção nacional. Estado: {status}",
  "A6_fig_A2_subheader": "Saberes do Amanhã: Projeção por Ramo da Ciência",
  "A6_fig_A2_spinner": "Calculando a projeção por ramos da ciência...",
  "A6_warning_branches_proj_failed": "Não foi possível gerar a projeção por ramos.",
  "A6_fig_A7_subheader_1": "Cursos-Chave no Horizonte: Projeção Interativa",
  "A6_fig_A7_markdown_1": "Selecione até 3 cursos de seu interesse para visualizar sua projeção de matrícula individual.",
  "A6_fig_A7_multiselect_1": "Selecione cursos para projetar:",
  "A6_fig_A7_spinner_1": "Calculando a projeção para os cursos selecionados...",
  "A6_game_subheader": "🔮 O Oráculo da Matrícula",
  "A6_game_intro": "Antes de revelar as projeções do modelo, vamos testar sua intuição como analista. Observe a trajetória histórica da matrícula nacional. Com base nesta tendência, o que você acha que aconteceu no último ano registrado? A tendência continuou, se estabilizou ou se reverteu?",
  "A6_game_item_name": "Matrícula Nacional",
  "A6_game_title": "Preveja a Tendência Nacional",
  "A7_header_1": "💡 Áreas de Atenção: Desafios e Oportunidades Específicas",
  "A7_markdown_1": "Além das grandes tendências, existem situações particulares em cursos e universidades que merecem um olhar especial. Alguns cursos podem estar emergindo com vigor, outros podem ter concluído seu ciclo de oferta, e um terceiro grupo talvez lute para atrair um número suficiente de estudantes. Identificar estes casos não é apontar problemas, mas descobrir oportunidades para uma gestão acadêmica mais precisa, ágil e adaptada às realidades em mudança.",
  "A7_spinner_1": "Identificando casos de atenção específica...",
  "A7_error_a8_analysis": "Não foi possível completar a análise de áreas de atenção.",
  "A7_a8_subheader_1": "🌱 Semeando o Futuro: Possíveis Novas Ofertas ou Reativações",
  "A7_a8_markdown_1": "O gráfico a seguir mostra quantos cursos novos ou reativados foram detectados a cada ano. Isso revela os períodos de maior expansão ou renovação da oferta acadêmica.",
  "A7_chart_title_new_offers": "Novas Ofertas ou Reativações Detectadas por Ano",
  "A7_chart_xaxis_year_new_offers": "Ano de Detecção/Reativação",
  "A7_expander_new_offers": "Ver a lista completa das {count} novas ofertas detectadas",
  "A7_col_detected_start_year": "Ano de Início Detectado",
  "A7_col_current_enrollment": "Matrícula Atual",
  "A7_info_no_new_offers": "Não foram identificados cursos que cumpram claramente o critério de nova oferta ou reativação.",
  "A7_a8_subheader_2": "🍂 Ciclos que se Concluem: Possíveis Cessações de Oferta",
  "A7_a8_markdown_2_revised": "Este gráfico resume quantos cursos deixaram de ter matrícula por ano, dando-nos uma ideia dos períodos com maiores ajustes ou descontinuações na oferta acadêmica.",
  "A7_chart_title_ceased_offers": "Possíveis Cessações de Oferta por Último Ano com Matrícula",
  "A7_chart_xaxis_last_year": "Último Ano com Matrícula",
  "A7_expander_ceased_offers": "Ver a lista completa das {count} ofertas possivelmente cessadas",
  "A7_col_last_enrollment_year": "Último Ano com Matrícula",
  "A7_info_no_ceased_offers": "Não foram identificados cursos que cumpram claramente o critério de cessação de oferta.",
  "A7_a8_subheader_3": "📉 Focos de Atenção: Matrícula Reduzida (Inferior a {umbral})",
  "A7_a8_markdown_3_revised": "O gráfico a seguir agrupa os cursos de acordo com seu nível de matrícula no ano letivo {curso}. Cada ponto representa um curso em uma universidade específica. Passe o cursor sobre um ponto para ver os detalhes. Isso nos ajuda a ver onde se concentram os casos de matrícula mais crítica (ex. 1 ou 2 estudantes).",
  "A7_chart_title_low_enrollment": "Ofertas com Matrícula Reduzida (Ano Letivo {curso}, < {umbral} Estudantes)",
  "A7_chart_yaxis_low_enrollment": "Número de Estudantes",
  "A7_expander_low_enrollment": "Ver a lista completa dos {count} cursos com matrícula baixa",
  "A7_col_enrollment_last_year": "Matrícula ({curso})",
  "A7_info_no_low_enrollment": "Não foram identificados cursos com matrícula inferior a {umbral} (e >0) no último ano.",
  "A7_conclusion_markdown_1": "---\n**Decisões Informadas para uma Gestão Proativa:**\nA informação apresentada nesta seção é um chamado à ação específica:\n*   **Novas Ofertas / Reativações:**\n    *   **Verificar:** Correspondem a lançamentos ou reativações planejadas?\n    *   **Monitorar:** Avaliar sua evolução inicial, necessidades de recursos e estratégias de consolidação.\n    *   **Aprender:** Respondem a uma demanda social ou laboral emergente que poderia ser replicada?\n*   **Possíveis Cessações de Oferta:**\n    *   **Confirmar:** A descontinuação é oficial e definitiva? Atualizar registros se necessário.\n    *   **Avaliar Impacto:** Se a cessação não foi planejada ou tem implicações negativas (ex. única oferta em uma região), investigar causas.\n*   **Matrícula Reduzida:**\n    *   **Análise Causa-Raiz:** Trata-se de cursos altamente especializados com demanda limitada por natureza? Problemas de captação? Currículo desatualizado? Falta de pertinência laboral?\n    *   **Estratégias Diferenciadas:** Dependendo do diagnóstico, as ações poderiam ir desde a promoção focada, redesenho curricular, até a consideração de fusão com outros cursos ou, em última instância, uma descontinuação planejada se sua manutenção não se justificar.\n\nUma gestão atenta a estes detalhes permite otimizar recursos, responder melhor às necessidades do país e garantir a vitalidade e pertinência da oferta acadêmica universitária.",
  "A7_game_subheader": "🕵️‍♂️ Encontre o Foco de Atenção",
  "A7_game_intro": "Entre as múltiplas ofertas acadêmicas das universidades, algumas prosperam com centenas de estudantes, enquanto outras lutam para se manter à tona. A seguir, apresentamos quatro ofertas universitárias. Três delas têm uma matrícula saudável, mas uma é um \"foco de atenção\" com uma matrícula criticamente baixa. Consegue identificar o impostor?",
  "A7_game_title": "O Impostor da Matrícula Baixa",
  "A7_chart_yaxis_enrollment": "Matrícula Total",
  "A7_chart_title_projection": "Projeção de Matrícula para Cursos Selecionados",
  "a7_proy_warning": "Não foi possível gerar dados de projeção para: {careers}.",
  "a7_void_info": "Selecione pelo menos um curso para ver sua projeção.",
  "a7_end_markdown": "---\n**Planejando com Visão de Futuro:**\nEstas projeções, com todas as suas limitações, são um insumo valioso para:\n*   Antecipar necessidades de **infraestrutura e corpo docente**.\n*   Debater sobre a **alocação de vagas e recursos** entre diferentes áreas e cursos.\n*   Identificar áreas que possam exigir **estratégias proativas** para reverter tendências negativas ou para gerir um crescimento sustentável.\n*   Fomentar um diálogo informado sobre o **futuro da oferta acadêmica** em Cuba.",
  "B1_header_1": "🔬 Laboratório: Perfil Detalhado do Curso",
  "B1_markdown_1": "Mergulhe nos detalhes do curso que você escolher. Descubra sua evolução histórica, sua taxa de crescimento e um panorama anual das universidades e da composição de gênero.",
  "B1_selectbox_label_1": "Selecione um Curso para analisar seu perfil:",
  "b1_info_select_career": "Por favor, selecione um Curso para continuar.",
  "B1_spinner_1_hist": "Gerando perfil histórico para {career}...",
  "B1_subheader_1_hist": "Evolução e Crescimento de: {career}",
  "B1_markdown_1_rama": "Ramo da Ciência",
  "B1_chart_title_evolution_stacked": "Evolução e Composição da Matrícula: {career}",
  "B1_info_no_evolution_data": "Não há dados de evolução disponíveis para este curso.",
  "B1_slider_label_cagr": "Selecione o intervalo de anos para o cálculo do CAGR:",
  "B1_subheader_2_snapshot": "Análise Anual Detalhada",
  "B1_slider_label_snapshot": "Selecione um ano para ver os detalhes:",
  "B1_spinner_2_snapshot": "Carregando dados para o ano {year}...",
  "B1_pie_title_genero_yearly": "Distribuição de Gênero ({curso})",
  "B1_info_no_gender_data_pie": "Sem dados de gênero para este ano.",
  "b1_bar_chart_title": "Matrícula por Universidade",
  "b1_info_no_universities_data_year": "Nenhuma universidade registrou matrícula neste ano.",
  "b1_warning_no_data_for_year": "Não foram encontrados dados para o curso '{career}' no ano {year}.",
  "b2_header": "🗺️ Guia de Instituições: Explore a Oferta Acadêmica por Localidade",
  "b2_intro": "Descubra as instituições de ensino superior em Cuba, filtrando por província e município. Para cada universidade, você encontrará informações gerais e a oferta acadêmica por ramos e cursos no ano que selecionar.",
  "b2_error_no_institutions_data": "Os dados das instituições não estão disponíveis. Esta seção não pode ser exibida.",
  "b2_error_no_enrollment_data": "Os dados de matrícula não estão disponíveis. A informação da oferta será limitada.",
  "b2_subheader_filters": "Filtros de Busca:",
  "b2_label_province": "Província:",
  "b2_label_municipality": "Município:",
  "b2_label_search_pattern": "Buscar por nome ou sigla da instituição (filtro visual):",
  "b2_spinner_loading": "Carregando guia de instituições...",
  "b2_warning_basic_analysis_failed": "Não foi possível carregar a lista básica de instituições. Estado: {status}",
  "b2_info_showing_unis": "Mostrando {shown} de {total} instituição(ões) ({last_year}).",
  "b2_warning_no_years_for_detail": "Não há anos de matrícula disponíveis para ver detalhes.",
  "b2_slider_year_detail": "Selecione o ano para ver a oferta acadêmica detalhada:",
  "b2_info_no_unis_matched_filters": "Nenhuma instituição encontrada que corresponda aos filtros aplicados.",
  "b2_pie_title_gender_total": "Gênero Total ({curso})",
  "b2_caption_no_gender_data_for_year": "Sem dados de gênero disponíveis para {curso}.",
  "b2_markdown_academic_offering": "**Oferta Acadêmica ({curso}, ramos e cursos com matrícula):**",
  "b2_info_no_branches_for_year": "Esta instituição não tem ramos de ciências com oferta ativa ou cursos com matrícula reportada para {curso}.",
  "conclusion_header": "🏁 Conclusões e Horizontes Futuros: Forjando a Universidade do Amanhã",
  "conclusion_intro": "Viajamos através de uma década de dados, explorando o complexo ecossistema do ensino superior em Cuba. Seja como analista ou como explorador, cada gráfico desbloqueado e cada desafio superado foi uma peça de um quebra-cabeça maior: a história de milhares de aspirações, de esforços institucionais e da busca incessante pelo conhecimento que define nossa nação.\n\nEsta análise не é um ponto final, mas um farol que ilumina o caminho percorrido e nos ajuda a discernir as trilhas que se abrem diante de nós.",
  "conclusion_success_message": "**A informação é poder, e o poder destes dados reside em nossa capacidade de transformá-los em ação sábia e visão estratégica.**",
  "conclusion_findings_subheader": "🌟 Destaques da Jornada: Principais Descobertas",
  "conclusion_findings_text": "Ao olharmos para trás em nossa análise, emergem vários faróis que guiam nossa compreensão:\n\n1.  **O Pulso Dinâmico da Nação:** A matrícula universitária nacional mostrou uma notável capacidade de expansão, atingindo picos significativos no início da década de 2020, seguida de uma fase de ajuste mais recente. Esta flutuação nos lembra da sensibilidade do sistema a fatores contextuais e da necessidade de um planejamento flexível. *(Ref. Seção 1)*\n\n2.  **O Coração Médico e a Alma Pedagógica:** As **Ciências Médicas** se consolidam como a espinha dorsal em termos de volume estudantil, um testemunho de sua importância estratégica. As **Ciências Pedagógicas**, por sua vez, demonstraram um dinamismo extraordinário, com um crescimento massivo seguido de uma contração, refletindo possíveis mudanças na demanda ou nas políticas de formação de professores. *(Ref. Seção 2)*\n\n3.  **A Ascensão de Novas Vocações:** A análise de crescimento (CAGR) revelou a decolagem impressionante de cursos como **Serviços Odontológicos** e o vigor de várias **Engenharias** (Artística, Processos Agroindustriais, Informática), sinalizando possíveis novas fronteiras de interesse e demanda de trabalho. *(Ref. Seção 3)*\n\n4.  **Avanços e Desafios na Equidade de Gênero:** Embora Cuba exiba uma alta participação feminina no ensino superior, com muitos ramos e cursos mostrando uma maioria de mulheres, persistem desafios significativos. A sub-representação feminina nas **Ciências Técnicas** e em **Engenharias específicas**, bem como nas **Ciências da Cultura Física e do Desporto**, nos chama a redobrar esforços para construir um panorama verdadeiramente equitativo. *(Ref. Seção 4)*\n\n5.  **A Riqueza da Diversidade Institucional:** Cada universidade contribui com sua nuance única ao sistema. Vimos desde grandes centros multidisciplinares até instituições com uma marcada especialização (como as Universidades de Ciências Médicas). A identificação de cursos com oferta limitada sublinha a importância de uma rede universitária coordenada e estrategicamente distribuída. *(Ref. Seção 5)*\n\n6.  **Um Olhar Prudente para o Amanhã:** As projeções, embora sujeitas à incerteza inerente ao futuro, sugerem uma possível continuação da fase de ajuste na matrícula geral e em vários ramos e cursos-chave. Isso não é um presságio, mas um convite à preparação e à ação proativa. *(Ref. Seção 6)*\n\n7.  **A Importância dos Detalhes:** A análise de \"Áreas de Atenção\" nos lembrou que a saúde do sistema também reside na vitalidade de cada um de seus componentes, incluindo os cursos emergentes, aqueles com matrícula reduzida ou os que podem estar concluindo seu ciclo. *(Ref. Seção 7)*",
  "conclusion_player_summary_header": "🏆 Resumo da sua Aventura como Explorador",
  "metric_total_score": "Pontuação Final",
  "metric_games_played": "Jogos Concluídos",
  "metric_analyst_profile": "Perfil de Analista",
  "profile_strategist": "O Estrategista",
  "profile_strategist_desc": "Seu ponto forte é classificar e ordenar. Você vê o quadro geral e coloca cada peça em seu lugar.",
  "profile_competitor": "O Competidor",
  "profile_competitor_desc": "Você adora duelos. Comparar e escolher o vencedor é sua especialidade.",
  "profile_visionary": "O Visionário",
  "profile_visionary_desc": "Você tem um dom para estimar números e magnitudes com precisão.",
  "profile_prophet": "O Profeta",
  "profile_prophet_desc": "Você intui as tendências futuras como ninguém. Sua bola de cristal funciona!",
  "profile_cartographer": "O Cartógrafo",
  "profile_cartographer_desc": "Você conhece o terreno. Localizar cada instituição no mapa é seu talento natural.",
  "profile_detective": "O Detetive",
  "profile_detective_desc": "Ninguém te engana. Você é um especialista em encontrar o elemento que não se encaixa.",
  "profile_scholar": "O Erudito",
  "profile_scholar_desc": "Você responde a perguntas diretas com conhecimento e certeza.",
  "profile_explorer": "O Explorador",
  "profile_explorer_desc": "Você aproveita a jornada e aprende com cada desafio, cobrindo todas as áreas.",
  "leaderboard_header": "Ranking Global de Exploradores",
  "leaderboard_intro": "Compita com outros analistas e deixe sua marca no ranking. Você estará entre os melhores?",
  "player_name_label": "Seu nome para o ranking:",
  "submit_score_button": "🚀 Enviar minha pontuação!",
  "enter_name_warning": "Por favor, insira um nome.",
  "score_submitted_info": "Sua pontuação já foi enviada! Obrigado por participar.",
  "loading_leaderboard_spinner": "Carregando o ranking...",
  "leaderboard_col_timestamp": "Data",
  "leaderboard_col_playername": "Jogador",
  "leaderboard_col_score": "Pontuação",
  "leaderboard_empty_caption": "O ranking está vazio. Seja o primeiro a aparecer!",
  "leaderboard_connection_warning": "Não foi possível conectar ao serviço de ranking. A funcionalidade não está disponível no momento.",
  "conclusion_recommendations_subheader": "🧭 Traçando a Carta de Navegação: Recomendações Estratégicas",
  "conclusion_recommendations_text": "Com estas descobertas como bússola, propomos as seguintes linhas de ação para a Sede Central e todos os atores envolvidos no Ensino Superior cubano:\n\n*   **Fortalecer o Observatório do Ensino Superior:**\n    *   **Ação:** Manter e enriquecer este sistema de análise de dados como uma ferramenta permanente para o monitoramento de tendências, a avaliação de políticas e a tomada de decisões informadas.\n    *   **Impacto Esperado:** Maior agilidade e capacidade de resposta do sistema às dinâmicas em mudança.\n\n*   **Fomentar a Pertinência e a Qualidade com Visão de Futuro:**\n    *   **Ação:** Realizar estudos prospectivos contínuos sobre as necessidades do desenvolvimento socioeconômico do país e as demandas do mercado de trabalho para alinhar a oferta acadêmica. Avaliar e atualizar os currículos dos cursos com baixa demanda ou em declínio, e investir naqueles com potencial de crescimento e relevância estratégica.\n    *   **Impacto Esperado:** Graduados mais bem preparados para os desafios do futuro e uma maior contribuição da universidade para o desenvolvimento nacional.\n\n*   **Impulsionar a Equidade de Gênero em Todas as Disciplinas:**\n    *   **Ação:** Desenhar e implementar programas específicos e sustentados para incentivar a participação feminina em cursos STEM e outras áreas sub-representadas, e vice-versa, abordando estereótipos desde as primeiras etapas da educação.\n    *   **Impacto Esperado:** Um sistema universitário mais inclusivo que aproveite o talento de toda a população sem vieses de gênero.\n\n*   **Otimizar a Rede Universitária e Promover a Colaboração:**\n    *   **Ação:** Utilizar as análises de especialização e distribuição para tomar decisões sobre a abertura, fusão ou fechamento de cursos em diferentes instituições, buscando eficiência, qualidade e cobertura territorial equitativa. Fomentar a criação de redes de conhecimento e programas inter-universitários.\n    *   **Impacto Esperado:** Um sistema mais coeso, com centros de excelência fortalecidos e uma melhor utilização dos recursos disponíveis.\n\n*   **Integrar a Voz dos Atores:**\n    *   **Ação:** Complementar as análises quantitativas com pesquisas qualitativas que coletem as percepções e experiências de estudantes, professores, graduados e empregadores.\n    *   **Impacto Esperado:** Decisões mais holísticas e políticas mais bem adaptadas às realidades e expectativas da comunidade universitária e da sociedade.",
  "conclusion_final_header": "✨ Um Legado Contínuo, Um Futuro Brilhante",
  "conclusion_final_paragraph": "A análise destes dados não é meramente um exercício acadêmico; é um ato de responsabilidade e um compromisso com o futuro. As Universidades Cubanas, cada uma com sua rica história e seu papel transcendental na sociedade, enfrentam o desafio e a oportunidade de continuar evoluindo, se adaptando e inovando.\n\nEsperamos que estes dados inspirem todos a trabalhar juntos por um ensino superior que não apenas responda às necessidades do presente, mas que ativamente modele um amanhã mais próspero, justo e cheio de conhecimento para todos os jovens cubanos."
}